["\n\n  MUMBAI: The airspace from India to the Gulf is getting increasingly crowded with call signs from IndiGo. The country's biggest carrier by market-share is quietly, but aggressively, expanding in a region that sends the biggest worker remittances, and acts as a hub for onward journey to Europe or the eastern water margin of the US.\n  \n\n  And losing out in the bargain are rivals such as Air India Express and Jet Airways, the latter reducing seat-capacity in flights to the Gulf, while the Gurgaon-based airline is doing just the reverse. IndiGo has increased its seat-capacity to the Gulf by 40% in the past one year. It now offers 26,460 weekly seats from India to Dubai, Doha, Sharjah and Muscat, the airline said.\n  \n\n  Indigo has started flights connecting Chennai and Kozhikode with Muscat, Kozhikode and Thiruvananthapuram with Sharjah, and Mumbai and Delhi with Doha. Regulator Directorate General of Civil Aviation (DGCA) has allowed Indigo to further increase seats, which can go up to 31,500 a week. That would mean a 66% jump in one year.\n  \n\n  By contrast, Jet Airways has decreased its weekly capacity to the Middle-East by 14% to 51,100 seats between the last winter schedule and the ongoing summer schedule, said a source in the know. In the last few months, Jet has stopped flights connecting Bengaluru, Ahmedabad and Goa to Abu Dhabi. It has also withdrawn services connecting Mangalore and Kozhikode to Sharjah, and Thiruvananthapuram with Dubai, sources said.\n  \n\n  According to Indian aviation norms, the financial year is divided into two schedules of seven and five months. At the start of each schedule, airlines revise their flight operations — services, slsots, seat capacity — after approval from the DGCA. For its part, Jet reiterated that its dominant status would be strengthened by its partnership with Etihad.\n  \n\n  \"Jet Airways remains committed to the Gulf region. Together with our strategic partner Etihad Airways, we are the dominant carrier, both in terms of market and capacity share. Our growth plans for the Gulf region remain unchanged. We have consistently increased capacity into selected Gulf routes by 5-6% per annum over the past years, and will continue to do so in this new financial year.\"\n  \n\n  India's aviation relations with the Gulf have been more dynamic than with any other region or country in the world. Indian carriers have historically milked the labour traffic and the SME traffic flying to middle-eastern markets, while premium Gulf carriers have flown rich Indian passengers to the rest of the world. To be sure, Jet still offers almost double the capacity of IndiGo on the region.\n  \n\n  The gap widens further when Jet's services are clubbed with those of its strategic partner Etihad, which has the right to offer 51,000 weekly seats to India. Etihad owns 24% of Jet.\n  \n\n  Yet, IndiGo is expanding much faster than others. It operates flights to just four Gulf sectors compared to Jet's 10. The airline already offers more capacity than its Indian peers in Dubai and Muscat.\n  \n\n  In these two sectors, it has long toppled Air India Express, the regionalinternational subsidiary of national carrier Air India, and primarily a Gulf flyer. \"Moreover, IndiGo now offers 2,520 seats to Doha.\n  \n\n  It has DGCA's approval for 7,560. If it expands to its fully approved capacity to the city, it will beat Air India Express (2,604) and be neckto-neck with Jet Airways (7,672),\" said Habibullah Ubaidullah, an independent aviation researcher and consultant. Also, as part of its Gulf expansion, IndiGo has focused on traffic from southern India.\n  \n\n  \"DGCA figures showed the airline has more than doubled its weekly capacity between south India and the Gulf in the last one year to 13,820 seats,\" said Ubaidullah. That can be expanded to 18,860. Jet offers 15,288 seats, he added.\n  \n", "\n\n  NEW DELHI: In a move that may add to discontent in its ranks, Jet Airways has frozen salary hikes of its senior employees of manager grade and above, including most pilots, this fiscal. In a mail sent late on Thursday night, the airline told these employees: \"....there is also an immediate need to stabilize our employee cost. In line with the same, it has been decided to freeze salary increases for this financial year. This salary freeze will be applicable to all employees in manager grades M3 and above and will be effective April 1, 2017. We understand that these measures are difficult and unsettling, but are unavoidable.\"\n  \n\nJet Airways's employee benefit expenses in the financial year ended March 31, 2016, was Rs 2,388.1 crore, up from FY 14-15 figure of Rs 2,243 crore. Last Saturday, the union of Jet's Indian pilots had asked its members not to fly with foreign pilots in the airline from May 1. The pilots had before that warned of trouble over pay hikes as well.\n  \n\n  \"Our company continues to have a very competitive policy on compensation & benefits. We have been able to retain employees and provide them with substantial growth basis performance and opportunities within the company. At Jet Airways, increments have been periodic and annual, basis the criteria of performance, inflationary trends, standard of living and other relevant factors,\" Jet told its senior employees in the letter. The airline' spokesman could not be reached for comment.\n  \n\n  \"Given the competitive pressures and challenges in the airline industry, the need to drive a higher level of performance is immense. We are now on the threshold of change and it is imperative to reengineer our process and systems. Hence, it is essential to re-examine our standard remuneration policy and introduce a more dynamic reward mechanism which considers both, the company and individual performance parameters as the paramount criterion and factors in other market dynamics including overall wage cost and profitability. While we are undertaking several measures to overcome these impediments, there is also an immediate need to stabilize our employee cost,\" it adds.\n  \n\n  Jet's pilots had recently warned the airline of trouble on this issue. The airline tried to soothe their nerves by saying it is \"working on a robust performance management scheme which will reward employees with pay-outs based on performance. This scheme will enable us to actively shift the needle towards a highly results driven culture. We look forward to your support during these tough times. We hope to collectively shape our journey ahead by embracing new opportunities and delivering on challenges.\"\n  \n\n", "\n\n  NEW DELHI: Indian information technology services companies can breathe easy for the moment, with US President Donald Trump choosing not to push for legislative changes in the country's visa programme for technology workers in his latest executive order.\n  \n\n  Instead, on Tuesday, Trump signed the executive order named 'Buy American and Hire American' in which he directed the US secretary of state, attorney general, secretary of labor and secretary of homeland security \"to suggest reforms to help ensure that H-1B visas are awarded to the most-skilled or highest-paid beneficiaries\".\n  \n\n  The $150-billion Indian outsourcing industry has been bracing for drastic changes in the H-1B visa programme, the most favoured route to send Indian engineers to the US, which allowed IT services firms to keep costs low and gain an advantage over global competitors.\n  \n\n  \"Nothing is being proposed that would impact or change the fiscal 2018 H-1B lottery that is currently underway. The proposed changes are forward-looking and non-specific,\" said the industry body National Association of Software and Services Companies in a statement.\n  \n\n  There are four bills proposed in the US related to H-1B reforms, six related to outsourcing and three that deal with immigration.\n  \n\n  Industry experts too were of the view that Tuesday's executive orders were \"not as bad as expected\". Phil Fersht, research firm HfS Research CEO, told ET the order is \"very good news\" for the IT industry.\n  \n\n  Trump had passed the buck to the American bureaucracy to \"make some legislative changes, as opposed to trying to force through the draconian measures that had been suggested during his campaign\", said Fersht.\n  \n\n  Those terms, which included an increase in minimum annual wage to a whopping $130,000 for a skilled engineer in the US, would have had a \"crippling impact on Indian IT competitiveness in the US\", he said.\n  \n\n  The current H-1B programme, which is lottery-based, allows a maximum of 65,000 visas for the general category and a further 20,000 for people who have a US master's degree from an accredited institution. The application cap for financial year 2018 was reached within four days of the lottery opening this year.\n  \n\n  Indian IT companies have been accused of misusing the H-1B visa regime, which they have consistently denied.\n  \n\n  For their part, companies have been working towards a business model which is less dependent on visas. \"As long as it is fair and even, a level playing field for everyone, we are committed to stay compliant,\" Rajesh Gopinathan, CEO of Tata Consultancy Services told ET.\n  \n\n  \"We have said that our dependence on visas will progressively reduce as our size and scale increases... We are shifting to a less-visa-dependent model,\" he said.\n  \n\n  Infosys, India's second-largest IT company, said it continues \"to invest in the local communities in which we operate, including hiring local American top talent, bringing education and training to our clients to shrink the skills gap in the US, and working with policymakers to foster innovation within states and across the country\".\n  \n\n\n    UNINTENDED CONSEQUENCES\n    \n\n\n  Nasscom also warned of the unintended consequences of using salary levels or skills as the metric to judge the merit of an H-1B application as it \"could advantage certain regions such as Silicon Valley over other regions of the US\" while also placing \"federal bureaucrats in the role of technology consultants and human resource specialists\".\n  \n\n  The latest order is regarded as an attempt to improve the implementation of existing laws. \"The US government has alternately loosened and tightened restrictions, and there hasn't really been any change to a law. He (Trump) is only talking about tighter implementation of the existing policy,\" said Sid Pai, an expert on the Indian outsourcing industry and former Asia-Pacific head at consultancy ISG.\n  \n\n  The impact of the latest executive order would be to make Indian outsourcing as well as US technology companies more compliant with the spirit of the law.\n  \n\n  \"Even before this latest executive order it is clear that the Indian service provider industry was taking steps to reduce dependency on H-1B as reflected by the drop in overall applications for H-1B from 236,000 last year to 199,000 this year. The majority of this reduction is thought to be the reduced number of applications that the service providers are submitting,\" Peter Bendor-Samuel, CEO of the Everest Group, told ET.\n  \n\n\n    GOVERNMENT IN TALKS\n    \n\n\n  An external affairs ministry spokesperson said the government was in touch with authorities in the US and Australia on changes in their respective tech visa policies, and was assessing the impact in consultation with stakeholders.\n  \n\n  The changes announced by Australia merely entail replacing one scheme with another, the spokesperson said, adding that officials there had assured the impact will be negligible on Indian IT workers.\n  \n", "\n\n  NEW DELHI: Despite intense lobbying by India Inc, the government has opted to retain restrictions on how many layers of subsidiaries a company can have as it attempts to ensure that their operations remain transparent and transactions are not routed through a maze of entities.\n  \n\n  Sources told TOI that the modified Companies (Amendment) Bill, which was cleared by the Union Cabinet earlier this month but could not be tabled during the Budget session of Parliament, has opted to retain the existing provision where corporate houses can make investments \"through not more than two layers of companies\".\n  \n\n  While the government had inserted the clause in the wake of the Satyam scam, the corporate sector has been pitching hard to have the condition removed, arguing that it was impacting flexibility in their operations. The NDA government, which has been receptive to the proposals that were put forward by industry chambers, has already amended the Companies Act once and had moved a bill to amend the Act for second time.\n  \n\n\n  While the parliamentary standing committee was not averse to the plan, a powerful section within the government was of the view that by amending the provision, the Act would be significantly diluted and the Modi government did not want to be seen to be in favour of promoting a structure that is not transparent.\n  \n\n  In any case, the tax department along with the ministry of corporate affairs is waging battle against shell companies, many of which depend on routing funds through several entities to hide the ultimate beneficiary. \"The government has decided to retain the cap on two layers for investment companies and it will also have flexibility of intervene in case of others,\" said a source, who did not wish to be identified.\n  \n\n  Similarly, the government has also decided against amending provisions that bar chartered accountants whose relative or partner has a loan from a company or has given a guarantee or has similar relationship. This was again cited as a step impeding business. But the government has opted to play safe and avoid possibilities of conflict of interest. Auditors had said that relatives with links with a company were an inhibiting factor in getting business.\n  \n\n  The government now hopes to get the revised amendment bill passed by both houses during the monsoon session.\n  \n", "\n\n  MUMBAI/CHENNAI: If you have ever defaulted on a credit card payment or had an extension on your student loan, watch out! Your credit history could impact decisions — right from buying an iPhone6 to landing a new job. This is because credit bureau Cibil has tied up with e-commerce players and employee-screening firms to share data on consumers and potential job candidates.\n  \n\n  In order to help e-commerce firms, Cibil allows a credit screening after the consumer submits an EMI application for a consumer durable. With the consumer's consent, the e-commerce site accesses their Cibil score and report. \"This will reduce the rejection rate on applications, making the process more efficient, faster and easier for both the e-commerce company and the consumer,\" said Hrushi Mehta, VP and head (consumer interactive), TransUnion Cibil.\n  \n\n  Capricious borrowers also may find their loan-repayment track record returning to haunt them at the time of seeking new employment. \"We have been getting multiple requests from banks and background-screening firms that in addition to the present screening processes that they have for employees — like the education, criminal and medical tests — they also wanted to do a financial credit test,\" said Mehta. He added that employers making these requests out of a compliance perspective were largely multinational companies.\n  \n\n  Although credit histories are usually requested by lenders who have received a loan proposal, TU Cibil is able to provide this service as it is given after consumer consent. \"We have a process where the customer authenticates it, only then we release it to the third party. The way it is used in the employee-screening process is that it is an indicator of risk and whether the company should do further due diligence on a prospective candidate or not,\" said Mehta. He added that if the report is that of a chronic defaulter, it is up to the company whether to hire the consumer or not.\n  \n\n  But will the new credit offering make it more difficult for job seekers facing a tough financial situation? What if someone has defaulted on a loan only because they lost their job, when their former employer downsized a few months ago? \"We cannot comment on the possible decisions of corporates or the potential ramifications of our data. But we reiterate: The consumer/candidate also has the right to decline access to their data,\" said Mehta.\n  \n\n  According to Mehta, since the service has only just started, there is no study on whether there is a correlation between credit score and employee dedication. However, according to TU Cibil, a chronically credit-impaired individual may be more vulnerable to indulge in corporate misappropriation than an individual who is financially disciplined and pays debts on time. \"This is a positive step towards strengthening internal controls along international standards,\" said Mehta.\n  \n\n  In addition to providing assistance to prospective employers, TU Cibil has launched another service for fintech and e-commerce companies. With this new initiative, the consumer will not only see offers they are eligible for but will also have access to the Cibil score and report that is used to display the offers. This may reduce the rejection rate on applications, making the process more efficient, faster and easier for both the e-commerce company and the consumer.\n  \n\n", "\n\n  MUMBAI: The rupee lost 13 paise against the dollar to 64.71 in early trade today on the Interbank Foreign Exchange due to appreciation of the US currency overseas.\n  \n\n  Increased demand for the dollar from importers also put pressure on the rupee.\n  \n\n  Dealers attributed the rupee's fall to dollar gains against other currencies overseas but a higher opening of the domestic equity market capped the fall.\n  \n\n  Yesterday, the rupee had gained 5 paise to close at 64.58 a dollar on fresh selling of the American currency by banks and exporters.\n  \n\n  Meanwhile, the BSE benchmark Sensex rose 63.57 points, or 0.22 per cent, at 29,400 in early trade today.\n  \n", "\n\n  NEW DELHI: The government has directed Internet service providers (ISP) to block distribution and transmission of child sexual abuse content by July 31.\n  \n\n  \"ISP's having cable landing station gateways/ international long distance licences in India shall be required to adopt and implement IWF (Internet Watch Foundation) resources on or before July 31, 2017, to prevent distribution and transmission of online CSAM in to India,\" the Ministry of Electronics and IT (Meity) said in an order dated April 18, 2017.\n  \n\n  The directive has been issued after the recommendation of an inter-ministerial committee that was constituted to recommend solutions to address the issue of child sexual abuse material (CSAM) following a Supreme Court order.\n  \n\n  The panel noted that most of the CSAM is being hosted outside India and the websites or web links to access such unlawful content are dynamic in nature and frequently changing which makes it difficult to block such content.\n  \n\n  The panel noted that no centralised mechanism exists in India to monitor online CSAM.\n  \n\n  However, it noted that an entity, Internet Watch Foundation (IWF), maintains such a list of dynamically updated websites and web pages containing online CSAM.\n  \n\n  The IWF has been adopted by many countries and is already being implemented by leading online service providers in other jurisdictions but not in India.\n  \n\n  The IWF resources are also available to ISPs on a subscription basis either individually or collectively.\n  \n\n  The ministry (Meity) has asked all the ISPs to continue to observe the existing due diligence requirements prescribed by the central government under the Information Technology Act 2000 and rules and regulations.\n  \n\n  The publication or transmission of material depicting children in sexually explicit act or conduct in electronic form is heinous crime, specifically prohibited by section 67B of the IT Act 2000.\n  \n\n  The Supreme Court in an order dated July 12, 2013, had directed the government to tackle the CSAM issue.\n  \n\n", "\n\n  NEW DELHI: The proposed dismantling of Foreign Investment Promotion Board, which vets proposals involving fund inflows from overseas, is likely to be bundled with related policy reforms.\n  \n\n  On top of the list is doing away with prior government approval for investments in most sectors, including single-brand retail, which could see dilution of the 30% domestic sourcing clause.\n  \n\n  \"Contours of the proposed changes to the foreign direct investment policy are almost ready... Non-strategic sectors should be on automatic,\" said a senior government official privy to discussions on the matter.\n  \n\n  With domestic private investment not picking up, the government is largely counting on foreign funds to speed up infrastructure creation. India needs an estimated $1.5 trillion over 10 years to build infrastructure such as roads, airports and power projects.\n  \n\n  The latest round of FDI reforms is aimed at making the process easier for foreign investors.\n  \n\n  \"The multiple layers in clearance often lead to unnecessary delays,\" the official said, justifying the decision to put more sectors on the automatic approval route.\n  \n\n  Most sectors have automatic approval for investments up to 49%. Government approval is required for investments in sectors such as telecom services, food products retailing, mining and minerals, multi-brand retail and private security agencies.\n  \n\n  In most cases, approval is required for investments exceeding 49%, but in some such as multibrand retailing, approval is needed for any level of investment.\n  \n\n  In mining and minerals, 100% FDI is allowed but government approval is required. Many of these sectors could be freed up in the policy review.\n  \n\n  Top government officials have already discussed details of the new FDI regime and a call will be taken shortly.\n  \n\n  The finance ministry, separately, has moved a draft cabinet note for dismantling FIPB.\n  \n\n  The proposal to phase out FIPB in 2017-18 was made in the Budget presented on February 1. Finance minister Arun Jaitley said the government had undertaken substantive reforms in FDI policy over the past two years and more than 90% of the total FDI inflows were now through the automatic route.\n  \n\n  Jaitley said FIPB has implemented e-filing and online processing of FDI applications and had reached a stage where it could be abolished.\n  \n\n  The Department of Industrial Policy and Promotion has been authorised to vet and recommend foreign investment proposals to the finance minister. The government is keen to remove even that layer by abolishing the need for approvals for most sectors. In such cases, the sector regulators are likely to be charged with ensuring foreign investment is compliant with limits and policy.\n  \n\n  RETAIL TO BENEFIT\n  \n\n  Foreign direct investment up to 49% in the single-brand retail sector is allowed via the automatic route, without prior approval, but proposals beyond that level require government consent. India allowed 100% FDI in the sector in 2012.\n  \n\n  The government is likely to relax the rule and allow investment in single-brand retail under the automatic route.\n  \n\n  Single-brand retailers bringing FDI beyond 49% have to adhere to stringent 30% local sourcing norms but sections within the government favour diluting the clause as marquee brands come in completely manufactured form, including packaging.\n  \n\n  A call on this would be taken after deliberations as the government is also keen to push manufacturing and job creation in the country.\n  \n\n  Equity FDI into India increased 69% to $96.1 billion during October 2014-January 2017 from $57 billion in the July 2012-September 2014 period, commerce minister Nirmala Sitharaman said earlier this month.\n  \n\n  ET View: Remove Fetters\n  \n\n  FIPB is logical as 90% of the FDI now comes through the automatic route. Besides, sectoral regulation is also strong. The government should allow foreign investment to freely flow in retail. It would help retailers grow and promote foreign investment in manufacturing by mid-size companies.\n  \n\n", "\n\n  MUMBAI: Four major private airports in the country will require an investment of Rs 27,000 crore in expanding the existing capacity, which has reached near optimum level, by 2021, a report said today.\n  \n\n  The four private airports -- New Delhi, Mumbai, Hyderabad and Bengaluru -- cater to nearly 55 per cent of the country's total air traffic.\n  \n\n  These airports are operating at near-full capacity and will need to spend heavily on expansion through 2021, said the report by ratings firm Crisil.\n  \n\n  \"Because of surging footfalls and high capacity utilisation of over 90 per cent, we estimate the four airports would need to invest Rs 27,000 crore for expansion,\" Crisil Ratings President Gurpreet Chhatwal said.\n  \n\n  Yet, their credit quality will remain healthy because of business model strength backed by robust traffic growth and predictable cash flows under a regulated tariff framework, the rating outfit said.\n  \n\n  According to the firm, air passenger traffic in the country grew 20 per cent in the last fiscal which was a big leap over the sedate 9 per cent average seen since 2011.\n  \n\n  Bengaluru and Hyderabad airports have clocked even faster growth of over 24 per cent, the report said, adding rising private consumption and healthy economic growth would continue to provide tailwind to traffic growth at airports.\n  \n\n  Of the four aerodromes, GMR group runs Delhi and Hyderabad airports, while GVK group operates Mumbai.\n  \n\n  In the Bengaluru airport, India-born Canadian billionaire Prem Watsa's Fairfax holds 38 per cent, while Germany's Siemens Project Ventures GmbH has 26 per cent stake.\n  \n\n  Besides, state-owned Airports Authority of India and Karnataka State Industrial and Infrastructure Development Corporation hold 13 per cent each. The rest 10 per cent holding is with the GVK group.\n  \n\n  Despite such massive funding requirement, credit quality of these airports will not suffer because of low implementation risk. As such expansions are brownfield and modular in nature and conducive tariff regulation, Chhtawal said.\n  \n\n  Tariffs such as passenger user fee levied by airports is calculated in blocks of five years, called `control periods', based on a fixed return on capex and base traffic growth assumption\n  \n\n  This not only compensates for the risks taken, but also provides for adjustment in user fee on account of any large variation in traffic, capex plan in a control period, the report noted.\n  \n\n  As per Crisil, as the traffic increase rapidly, aeronautical revenue streams from passenger user fees and landing and parking charges would also increase in the ongoing control period.\n  \n\n  Significantly, India became the third largest aviation market in domestic traffic last year, unseating Japan. India's domestic air passenger traffic stood at 100 million in 2016 and was behind only the US (719 million) and China (436 million).\n  \n\n  \"While aeronautical revenues may moderate in the next control period due to adjustment in passenger user fee, rising footfalls can offset this through higher non-aeronautical revenue so it's unlikely to curb the earnings' momentum of these airports,\" Manish Gupta, Director, Crisil Ratings, said.\n  \n\n  The contribution from non-aeronautical revenue is expected to increase to over 50 per cent over the next four years from over 35 per cent now. Such unique characteristics make airports a prized infrastructure asset class that enjoys much lower risks compared with roads, power generation, and distribution, as per the report.\n  \n\n  Noting that the risks are also lower because of pricing power emanating from operational exclusivities, low complexity of operations, and ability to raise resources by monetising contiguous land parcels, Crisil said liquidity retention will be essential to offset any sharp fall in cash flows - most likely from macroeconomic shocks.\n  \n\n  Another key risk is timeliness in the tariff setting process and increasing regulatory scrutiny around expenditure, it said, adding the differences in recognising capital costs could potentially lower tariffs and hence returns.\n  \n", "\n\n  ET INTELLIGENCE GROUP: Domestic money flow into Indian equities outstripped foreign fund flows in a cumulative two-year cycle in FY16-17 for the first time in seven years while a broad-based comparison of stock ownership suggests favourable tailwind for Indian funds and investors.\n  \n\n  The total market value of domestic money invested in the BSE-200 at the end of March 2017 was bigger than the value of foreign fund holdings for the first time in two years. It is estimated that the value of Indian non-promoter and non-government holdings was $323 billion compared with $303 billion for foreign funds. This is the first time this has happened in eight quarters.\n  \n\n  The cumulative 24-month flow of domestic funds have been greater than the FPI flow for the first time since October 2010. Domestic funds invested $16 billion in local stocks in the two years compared with $6 billion for FPIs.\n  \n\n  After a gap of seven years, domestic investors are once again emerging as a force to reckon with in the Indian equity market as foreign fund flows remain volatile.\n  \n\n  Experts and financial market analysts say that fund flow from domestic institutional investors (DIIs) appears to be more stable and is growing by day thanks to increasing SIP (systematic investment plan) investments and rising flows into National Pension Scheme and the Employee Provident Fund Organisation (EPFO).\n  \n\n  Domestic money includes investment by institutional investors and retail investors.\n  \n\n  \"Domestic investors have been building strong positions in equities for the last many months and we are continuing to see strong inflows from domestic investors as they believe strongly in India's growth story,\" said Sunil Singhania, head of equities, Reliance Capital Asset Management, one of India's largest mutual funds.\n  \n\n  The rising share of local funds is important as it reduces market volatility and fluctuation every time FPIs pull out money as part of global risk aversion strategy. This was a major reason for the Indian equity market to hold on its own in the December 2016 quarter even though FPIs sold $4.5 billion worth of equities.\n  \n\n  Domestic mutual funds have received investments worth $12.5 billion every year in the last two years. The assets under management (AUMs) of domestic equity funds increased to $94 billion in FY17 against $31 billion in FY14, implying an annualised growth of 44%. \"The volatility of market has come down as domestic money has been able to absorb the fluctuation in FPI flow,\" said A Balasubramanian, CEO, Birla Sun Life AMC. \"We are expecting monthly SIP book to increase to Rs 6,000 crore by next fiscal as compared with Rs 4,200 crore currently.\"\n  \n\n\n    SIP SHARE\n    \n\n\n  SIPs by retail investors have played a big role with monthly flows increasing to Rs 4,200 crore from about Rs 3,500 crore last year. According to Association of Mutual funds of India (AMFI), mutual funds are on an average adding 6.3 lakh SIP accounts every month with an average SIP size of Rs 3,200 per account.\n  \n\n  SIP accounts for nearly 40% of the total monthly equity mutual fund collection in the past few months. The contribution of equity MFs is likely to increase to 45% in five years from current 35% led by growth in financial savings and steady returns, said brokerage firm CLSA.\n  \n\n  The firm expects 17% CAGR growth in AUM in the next five years on the back of 29% growth in the past three years. The AUM penetration in India is lowest at 12% of GDP compared with 55% for the world.\n  \n\n  There are two other important reasons behind the spurt in domestic flows. First, the government has mandated that all new government employees have to subscribe to the NPS.\n  \n\n  The total AUM of the NPS has reached around Rs 1.7 lakh crore through the contribution of 51 lakh employees. Of this, over 12.7% was in equities in February 2017.\n  \n\n  Besides, new NPS accounts have been opened by people in the private sector to avail additional tax rebate of Rs 50,000.\n  \n\n  The incremental contribution from government and private sector employee may add $700-$1000 million every year to equities.\n  \n\n  Second, the government raised the share of equity investment by the EPFO to 10% of the new money in FY17 from 5% in FY16.\n  \n\n  EPFO fund is worth Rs 1lakh crore, which means around Rs 10,000 crore will be deployed in equities. At the end of FY16, total AUM of EPFO was Rs 6.3 lakh crore. The EPFO invests in equities primarily through exchange traded funds (ETF).\n  \n\n", "\n\n  NEW DELHI: Markets regulator Sebi has decided to make daily cause list public about enforcement action taken against entities for violation of securities laws.\n  \n\n  The regulator said that details of quasi-judicial hearings conducted under the securities laws by Adjudicating Officers, Designated Authorities and Whole-Time Members of Sebi, will be uploaded on the website to enable all stakeholders to be aware of different stages of pending proceedings.\n  \n\n  In order to make entities aware of the details of quasi- judicial hearings, it has decided to publish a daily \"cause- list\" on its website, the regulator said in a statement.\n  \n\n  Earlier this week, the Securities and Exchange Board of India (Sebi) launched its revamped website having several user-friendly features and compatible with all desktop and mobile devices.\n  \n\n  The revamped website ensure a better user experience across various devices, including desktop and mobile. The website now also allows visitors to share web pages on their social media network.\n  \n\n  The 'search' function has been enhanced with better search facilities in databases as well as in the content files.\n  \n\n  Besides, the content has been increased to enable need based search in order to increase accessibility of data. The speed of loading web pages has also been raised significantly.\n  \n\n", "\n\n  MUMBAI: Jet Airways has announced launch of two new flights directly connecting Chennai with Paris and Bengaluru with Amsterdam. The launch of these new routes will enable passengers to travel to destinations in Europe and North America with its codeshare partners Air France, KLM Royal Dutch Airlines and Delta Air Lines, said the airline in a press release issued on Thursday.\n  \n\n  Commencing on October 29, Jet Airways 9W 236 will depart from Bengaluru at 02:25 hrs (LT) and arrive at Amsterdam at 08:35 hrs (LT). On the return leg, Jet Airways 9W 235 will depart from Amsterdam at 10:50 hrs (LT) and arrive at Bengaluru at 00:40 hrs (LT). These flights will be operated in conjunction with KLM Royal Dutch Airlines and Delta Air Lines, with each airline placing their respective codes on the service.\n  \n\n  \"On the same day, Jet Airways 9W 128 will depart from Chennai at 01:45 hrs (LT) and will arrive into Paris at 08:10 hrs (LT). Departing from Paris at 10:10 hrs (LT), Jet Airways 9W 127 will return to Chennai at 00:15 hrs (LT). Both Air France and Delta Air Lines will be codeshare partners on these flights,'' the release said.\n  \n\n  Jet Airways will operate a daily service between Bengaluru-Amsterdam, while the flight between Chennai-Paris will be operated five days a week. These new flights will complement the airline's existing direct operations from Delhi & Mumbai to Amsterdam and onwards to Toronto as well as direct flights from Mumbai to Paris.\n  \n\n  The addition of the Bengaluru and Chennai flights will make Jet Airways the only airline to offer direct non-stop services between these cities\n  \n", "\n\n  MUMBAI: The deceleration in the domestic air traffic growth continues for the second consecutive month this year with the demand for travel going up nearly 15 per cent to 90.45 lakh in March.\n  \n\n  The local airlines had flown 78.72 lakh passengers in March 2016.\n  \n\n  After posting over 20 per cent growth in domestic passenger market for the 13 consecutive months till January this year, the demand for air travel dropped to 15.77 per cent in February.\n  \n\n  According to Monthly traffic data released today, eleven domestic airlines together flew 90.45 lakh passengers in the previous month, registering a growth of 14.91 per cent.\n  \n\n  The private carriers, which include Jet Airways, IndiGo, SpiceJet, GoAir, Vistara and AirAsia India, among others, increased their share in the total domestic travel market by 1.7 per cent to 87 per cent in March this year compared to 85.3 per cent a year ago.\n  \n\n  National carrier Air India's market share during the month stood at 13 per cent, down from 14.7 per cent in March 2016, according to the Directorate General of Civil Aviation (DGCA) data.\n  \n\n  The budget carrier IndiGo continued to lead the pack with 30.23 lakh passengers flown by it during the previous month, while another budget airline SpiceJet saw the highest occupancy across its flights among all other carriers at 91.1 per cent in March.\n  \n\n  In the month, as many as 1,109 passengers were denied boarding by the domestic carriers for various reasons, according to the data, with private carrier Jet Airways disallowing the maximum number of passengers (913) from entering its aircraft prior to departure.\n  \n\n  National carrier Air India, also did not allow 174 passengers to board its flights during March 2017, the DGCA data shows.\n  \n\n", "\n\n  MUMBAI: The Reserve Bank of India on Wednesday fixed the reference rate of the rupee at 64.5443 against the US dollar and 69.1915 for the euro.\n  \n\n  The corresponding rates were 64.5657 and 68.7431 on Tuesday.\n  \n\n  According to an RBI statement, the exchange rates for the pound and the yen against the rupee were 82.7458 and 59.39 per 100 yens, respectively, based on reference rates for the dollar and cross-currency quotes at noon.\n  \n\n  The SDR-rupee figure will be based on this rate, the statement added.\n  \n", "\n\n  NEW DELHI: The government is redrawing a micro-credit programme to help pull rural households out of poverty. The proposal is to lend up to Rs 1 lakh per family in the next three to five years, with the loans coming collateral-free and with subsidised interest rates.\n  \n\n  \"We have simplified the process for accessing loans... We are getting into the details of livelihood each house can undertake so that the money can be lent accordingly,\" said rural development secretary Amarjeet Sinha.\n  \n\n  Nearly 8.5 crore poor households identified in the Socio Economic and Caste Census will be linked to the plan by 2019.\n  \n\n  The government wants to double bank linkages to lend Rs 60,000 crore per year for creation of livelihood for deprived rural households by 2019. The aim is to reduce their dependence on local moneylenders and microfinance companies who charge usurious interest rates as against 11 per cent by banks. Under the new proposal, the interest burden on the borrower is much lower due to subvention.\n  \n\n\n  The rural development ministry has signed a memorandum of understanding with the agriculture and animal husbandry ministry to enable lending to such households for activities including tilling and setting up of poultry farms and goat sheds.\n  \n\n  The rural development ministry will provide an interest rate subvention of 4 per cent to make loans available at 7 per cent . Households in 250 backward districts will get an additional interest subvention of 3 per cent on prompt repayment, making their effective interest rate at 4 per cent .\n  \n\n  \"We want to create diversified livelihood opportunities by providing loans which will help households utilise their resources and skills,\" Sinha added.\n  \n\n  The government has, for instance, taken up expansion of dairy activities in several states by collaborating with the National Dairy Development Board to provide better market linkages and bring producer groups together with companies.\n  \n\n  In order to expand its credit reach, the ministry is also studying the lending models of different states in rural areas, such as Tamil Nadu's Panchayat Level Federation and Telangana's Stree Nidhi Cooperative which lends to self-help groups.\n  \n\n  Rural credit in India raised by selfhelp groups grew 40 per cent in 2015-16 to Rs 30,000 crore. These groups have mobilised credit of about Rs 70,000 crore since they were formed in 2011, to fund creation of social capital in villages that could lift nonfarm jobs.\n  \n", "\n\n  MUMBAI: The benchmark BSE Sensex advanced almost 64 points to 29,400.14 in early trade today on sustained buying by domestic institutional investors amid firm Asian cues.\n  \n\n  The 30-share index rose 63.57 points or 0.22 per cent to 29,400.14. The gauge had gained 17.43 points in the previous session.\n  \n\n  Also, the NSE Nifty was up 23 points, or 0.25 per cent, to 9,126.50.\n  \n\n  Sectoral indices, led by realty, metal and FMCG, were trading in the positive zone with gains of up to 0.87 per cent.\n  \n\n  Brokers said that a firm trend at other Asian markets after crude oil prices rebounded from an overnight sell-off amid Japan reporting stronger-than-expected exports in March and easing tensions over North Korea helped lift sentiments.\n  \n\n  Shares of private lender Yes Bank, however, plunged 6.50 per cent to Rs 1,501 after the asset quality of the bank slipped in the results declared yesterday.\n  \n\n  Among other Asian markets, Japan's Nikkei was up 0.31 per cent while Hong Kong's Hang Seng index rose 0.33 per cent in morning trade.\n  \n\n  The US Dow Jones Industrial Average ended 0.58 per cent down in yesterday's trade, weighed down by weak earnings.\n  \n", "\n\n  NEW DELHI: Leading bourse BSE will add 11 companies, including Fortis Healthcare, Gujarat State Fertilizers & Chemicals and Nestle India in securities lending and borrowing (SLB) segment from next month.\n  \n\n  The other eight firms are Mangalore Refinery & Petrochemicals, Berger Paints India, Can Fin Homes, V-Guard Industries, Godfrey Phillips India, Balrampur Chini Mills, Raymond and Balkrishna Industries.\n  \n\n  In a circular, BSE said these eleven securities will be available for trading in the SLB segment with effect from May 5, 2017.\n  \n\n  SLB mechanism allows short sellers to borrow securities for making deliveries. There are more than 200 companies in the BSE SLB segment.\n  \n\n  As per an earlier circular of the exchange, these companies will also be available for trading in the equity derivatives segment from April 28.\n  \n\n  According to Sebi guidelines, shares with an average monthly trading turnover of Rs 100 crore or more in the previous six months are eligible for trading in SLB segment.\n  \n\n  Besides, shares with market-wide position limit (which indicates the investors interest in a share) of at least Rs 100 crore are also eligible for the inclusion in SLB scheme\n  \n", "\n\n  MANGALURU: With the US tightening the norms for H-1B visas under the President Donald Trump's 'Buy American, Hire American' campaign, the Indian IT companies are bound to face disruptions by way of higher costs and even some laying off work force back home, as the rising rupee is aggravating the situation further for the technology export firms, an ASSOCHAM paper has cautioned.\n  \n\n  Nearly 86% of the H-1B visas issued for workers in the computer space go to Indians and this figure is now sure to be scaled down to about 60% or even less.\n  \n\n  Remittances from US would decline hurting the balance of payment. World bank data showed the U.S was the second largest source of remittance for India in 2015, behind Saudi Arabia, and about $10.96 billion- nearly 16 per cent of the total inflows were sent to India. ASSOCHAM expects it to disturb the balance by 8-10%.\n  \n\n  As the cost pressure would increase, aggravated by rising rupee leading to lower realizations, the Indian IT firms may be forced to displace work force. \"In that case, the chances of layoffs are real,\" the ASSOCHAM secretary general D S Rawat cautioned, while impressing upon the IT industry apex bodies and the government to work out a joint strategy to deal with the unfolding situation. In the last three months, the Indian currency has gained by at least five per cent against US dollar, reducing net realizations for software exporters, among other export -oriented sectors.\n  \n\n  \"After all, our stakes are quite high. It is a question of $100 billion software export industry that employs over four million people and reservations for H-1B visa for start-ups with less than 50 employee will decrease the number of visa available for Indian firms.\n  \n\n  According to the ASSOCHAM paper, the reverses resulting from the tightening of the H-1B visas would force IT giants to create fundamental changes in their strategies in terms of hiring, salaries, jobs, impacting employees in India too.\n  \n\n  The move would also have an adverse macro impact for the Indian external sector economy. Remittances from US would decline hurting the balance of payment. \"We expect disturbances in remittances by 8-10%\", the paper said, adding there would be fewer opportunities for individuals to work on offshore location.\n  \n\n  With the UK already hiking the minimum wage requirement to £35,000 for tier-2 visa immigrants, this latest move by the US will act as a definitive dampener to the Indian outsourcing industry.\n  \n\n  The alternate solutions for the Indian outsourcing industry are: investing in \"near shore centres\" - facilities close to the US, focus on local hiring in America and to work virtually, which is becoming easier with the wider adoption of cloud services and greater digitization.\n  \n", "\n\n  BEIJING: Top diplomats from China and the European Union pledged closer cooperation on Wednesday at a time of global uncertainty, highlighting their common interests in peace and security and pushing a message of free trade and open engagement in contrast to fears that the US is turning inward under President Donald Trump.\n  \n\n  The statements came as China and the EU held their first high-level talks since Trump took office in January. EU foreign policy chief Federica Mogherini co-chaired the Seventh EU-China Strategic Dialogue with State Councilor Yang Jiechi, China's highest-ranking diplomat.\n  \n\n  \"At present, the international situation is complex with many new developments, challenges and problems,\" Yang told Mogherini at the outset.\n  \n\n  \"Against this backdrop, for China and the EU to deepen cooperation and coordinate positions not only concerns the common interests of the two sides, but also is of great significance for the development of international political and economic relations,\" he added.\n  \n\n  Mogherini said China and the European Union had \"a big responsibility\" during \"times of uncertainty.\"\n  \n\n  \"We are looking forward to intensifying our cooperation on a positive agenda, what the EU and China can do together for the benefit not only of our citizens, but also of the world,\" Mogherini said.\n  \n\n  Cooperation on regional and security issues and climate change were among the agenda items for the one-day talks, which come ahead of an EU-China summit scheduled for Brussels in June.\n  \n\n  Yesterday, Mogherini met with Chinese Premier Li Keqiang, who said the international community was looking at how China and the EU would work together to tackle challenges including the world economic recovery, global conflicts and terrorism, and Britain's pending withdrawal from the EU.\n  \n\n  Li said he was optimistic about the outcome of the talks based on \"a stable China-EU relationship, with the consistency of our two sides toward multilateralism and free trade, and with our joint commitment to improving the international governance structure.\"\n  \n\n  Unlike Trump, who was elected promising to tear up trade deals, impose new tariffs and bring jobs back to America, Chinese President Xi Jinping has cast his country as a champion of free trade and stability, and spoken out against protectionism.\n  \n\n  Mogherini said that such speeches by Xi \"have raised high\n  \n\n  expectations that China and the European Union can work together on multilateralism, on rules-based global order\" and trade.\n  \n\n  \"Not only our people, but probably the multilateral system, need Europe and China to work together on some of the major global issues we are facing, from climate change to migration or counterterrorism, and also the many crises we have around us such as the tensions on the Korean Peninsula,\" Mogherini told Li at the start of their meeting at the Chinese leadership compound Zhongnanhai in central Beijing.\n  \n\n  Beijing and Brussels have disagreements on trade, however, including complaints by European and other foreign companies that they blocked from acquiring Chinese assets while China's companies are buying major global brands.\n  \n\n  They also say they are barred from or sharply restricted in telecoms, information technology, finance and other promising industries in violation of Beijing's free-trading pledges.\n  \n", "\n\n  KOLKATA: ITC aims to outrun Nestle and Britannia as the leader of India's packaged-foods industry in the next two-three years, crowning the two-decade transformation of the century old tobacco giant into a diversified consumer-goods company.\n  \n\n  The formula for dominance in the increasingly competitive packaged foods industry would be accelerated introduction of new products, and entry into seven-eight newer categories, divisional chief executive for foods business Hemant Malik told ET.\n  \n\n  In essence, the recipe would borrow the template ITC had initially chosen in 2003, when a flurry of products marked ITC's expansion beyond the bailiwick of tobacco and hotels.\n  \n\n  \"We are constantly evaluating different categories, and our R&D; team is working on multiple products that would be superior and differentiated. A lot of back-end exploratory work is going on,\" he said.\n  \n\n  For instance, ITC is evaluating staples and edible oil, health foods, and value-added dairy products as categories it might enter.\n  \n\n  ITC's climb on the packagedfoods leader-board chronicles the transformation of a business that began as the Imperial Tobacco Company in the year George the Fifth became the King of England. For more than eight decades after it launched the Scissors cigarette at the 1911 Delhi Darbar, tobacco remained ITC's pronounced leitmotif.\n  \n\n  A strategic push toward foods and other daily needs began around the beginning of the new millennium, reflecting ITC's evolution into a diversified conglomerate. The maker of Sunfeast biscuits and Bingo chips is now the third-largest player in the packaged foods market, with Rs 7,097 crore sales in 2015-16.\n  \n\n  By contrast, Nestle had Rs 8,175 crore sales in calendar 2015, and Britannia reported Rs 7,947 crore revenue in 2015-16.\n  \n\n  ITC is profitable in the packaged foods business, while the broader non-cigarette FMCG business is yet to generate money consistently every quarter.\n  \n\n  It plans to introduce about 40 new food products in the next year - a record for ITC - and sell premium chocolates and coffee through retail chains and online stores.\n  \n\n  Malik said the 40 new differentiated products will not only be variants, but also new products. ITC's foods business is expected to be the majority contributor to its goal of achieving a turnover of Rs 1lakh crore from its non-cigarette FMCG businesses by 2030. The company is expecting Rs 60,000 crore to Rs 65,000 crore will be generated from the foods business by then.\n  \n\n  \"We can achieve our goal, given the huge opportunities that lie in every segment, and the GDP growth rate that India will be witnessing over the years. ITC has forayed into multiple categories and we are constantly expanding our portfolio of offerings,\" Malik said.\n  \n\n  ITC is the market leader in packaged atta and premium cream biscuits, and the secondlargest player in snacks and instant noodles. Aashirvaad atta and Sunfeast are its largest food brands, each with sales of Rs 3,000 crore.\n  \n\n"]