{
    "articles": [
    	{
            "content": "The 30-share index was trading higher by 0.43%.\nThe Sensex registered a good beginning on Tuesday as it recouped over 127 points after Monday's loss, with Asia providing a positive backdrop amid sustained foreign inflows.\nThe 30-share index was trading higher by 127.47 points, or 0.43%, at 29,364.62, with all indices led by technology, IT, power and healthcare trading in the green with gains up to 0.79%. The gauge had lost 184.25 points in the previous session.\nThe NSE Nifty rose by 46.35 points, or 0.51%, to 9,091.55. Retail investors got back to buying and foreign money kept coming in amid a firming Asian trend on renewed optimism for tax reforms in the US.\n Major players that supported the recovery were Axis Bank, Sun Pharma, Tata Motors, Wipro, HDFC Ltd, Asian Paints, NTPC and ICICI Bank, gaining by up to 1.96%.\nHong Kong's Hang Seng was up by 0.50% while Japan's Nikkei rose 1.07% in early trade on Tuesday.\n Shanghai Composite, however, shed 0.23%. The US Dow Jones Industrial Average ended 0.22% lower on Monday.\n",
            "title": "Sensex registers good beginning, recoupes over 127 pts",
            "source_url": "http://www.dnaindia.com/money/report-sensex-regiters-good-beginning-recoupes-over-127-pts-2371569",
            "author": "PTI",
            "published": "28/03/2017",
            "newspaper": "dnaindia"
        },
        {
        	"content": "The merger's fallout will be a loss of one (or both) iconic brands and the ad campaigns that built the two brands\nBy the time you read this piece, you might also read that Vodafone and Idea have merged into one mammoth telecom company.\n The implications of the merger will be manifold: job losses (as duplication will be weeded out), efficiencies (as the new entity takes stock of common resources such as towers), added reach (as the new entity will take advantage of the unique reach of each of the original partners) and so on.\n But the tragedy will be the loss of one (or both) of the extraordinary brands built over decades and the entertaining and effective communication built by Vodafone (in its various avatars, from Hutchison Max, Orange and Vodafone) and Idea.\nFrom the days of the heady and soft 'You and I' campaign when the pug first said hello to viewers, to the extraordinary ZooZoos, peppered with some offbeat films for cobranded Vodafone-Facebook and Vodafone-BlackBerry, the Ogilvy Vodafone partnership has built a formidable brand while delighting consumers - even when the consumer was unhappy with the coverage or service from the telco.\n The 'What an Idea, Sirjee' campaign by Lowe Lintas is the foundation that built the brand Idea Cellular, featuring Abhishek Bachchan in his most successful role to date.\n The exposure for Abhishek Bachchan in the Idea films is perhaps greater than his cumulative exposure in Bollywood films.\nThe new entity will, one presumes, be new.\n Which means that both brands will die and, with the deaths, the advertising created thus far will die as well.\nThat is a huge loss to advertising.\n The common thread that binds both the successful Vodafone and Idea work is the relationship that the two telcos built with their advertising agency partners.\n In both instances, the advertising agencies were trusted partners in brand-building, extensions of the marketing teams in these companies.\n It is this spirit of partnership that allowed Ogilvy the license (and the budgets) to create the ZooZoos and for Lowe to take the 'movement' route with What an Idea, Sirjee.\nThe marketing teams at both Vodafone and Idea have changed many times over the years, but it is the continuity of the relationship with their agencies that has allowed them to create impactful advertising despite the changes.\n Who will be responsible for the advertising after the merger? Both Ogilvy and Lowe have invested heavily in resources on these accounts and been remunerated handsomely as well.\n The loss of an account such as this will be a blow, both in terms of revenue and in the opportunity to do good work.\n Will the work go to Ogilvy? To Lowe? Or will it be shared, in a new and unusual arrangement?\nOr will the new entity call a pitch and invite a host of other agencies to present their ideas? We have no answers, but we can say that the new advertising will be different from what either of the agencies has created so far - and that a new marketing team will emerge at Vodafone-Idea.\n What the new entity needs to do is to look hard at the value that resides in the relationships between the erstwhile companies and their agencies - and not waste this wealth.\nWhile Ogilvy and Lowe undoubtedly know how to create communication, there is an additional value.\n Having spent, in both cases, more than two decades with their clients, Ogilvy and Lowe have a rich understanding of the mobile services business and the consumers of this business.\nThey know what makes these consumers tick, what makes them smile and what makes them write cheques.\n And they can replace the pug, create another ZooZoo and get another great idea, sirjee.\n",
        	"title": "Vodafone-Idea merger: Advertising's loss",
        	"source_url": "http://www.dnaindia.com/analysis/column-vodafone-idea-merger-advertising-s-loss-2362678",
        	"author": "ANANT RANGASWAMI",
        	"published": "22/03/2017",
        	"newspaper": "dnaindia"
        },
        {
        	"content": "Badrinath Ki Dulhania Review: Varun and Alia's crackling chemistry works wonders for this desi love story!\nBadrinath Ki Dulhania is no sequel to Humpty Sharma, neither does it try to pick the plot from the first film.\n Where it does follow up though is by casting Varun Dhawan and Alia Bhatt as the lead pair of the film.\n That isn't a brave or novel choice.\n But with a film like BKD, both Alia and Varun get to showcase their natural charm and unmatchable chemistry.\n Badrinath (Varun) belongs to a family in Jhansi who believes that men make the decision while women merely nod in approval.\n When he falls in love with an unlikely girl like Vaidehi (Alia), belief system and values clash.\n She seeks independence and self respect, while Badri is conditioned to believe that he can marry any girl he sets his eyes on.\n The interval revolves around a dramatic scene involving two weddings and a break up! BKD has a very valid and strong message about equal rights and even touches upon the subject of dowry in a progressive manner.\n However, the vibe of the film isn't preachy or serious thanks to Shashank Khaitan's vibrant direction and the lead pair who manages to keep you invested in most of the film.\nWhat's hot:Despite being light and breezy, BKD has some heavy duty scenes that allow Varun and Alia to showcase their acting chops.\n Both have already established their versatility in different genres, which makes their performances in BKD even more endearing.\n As the naive, bumbling village buffoon in the first half Varun engages you with his goofiness.\n It doesn't take him too long to change gear and show his serious side in the second half as the narrative takes a dramatic turn.\n Badri is a likeable guy and Varun goes all out to ensure we are by his side.\n His comic timing with his sidekick (Sahil Vaid) is as good as his chemistry with Alia in the romantic scenes Varun's restraint in the climax scene is worth a applause, when he could have easily succumbed to the temptation of going all out and making it caricaturish.\n Alia is her usual self, which means she's damn good! Be it her accent or scenes with Varun, she proves yet again why she can take on any role and make it her own.\n Sahil Vaid as the accomplice in his love story deserves a special mention.\n Tamma Tamma looks good on the big screen and the soundtrack lends the right melody to the story.\nWhat's not:Mid way through the film, you get a sense of been there seen that.\n Varun-Alia's pairing is terrific, but the novelty is missing.\n Scenes of auditioning a bridegroom for a bride seem dated.\n Also the second half gets a bit lazy before leading to a very predictable climax.\n There are moments when you wish the screenplay had something more to offer.\n Varun and Alia's hinterland accents take some time to get used to.\n Vaidehi and Badri are from Kota and Jhansi, which aren't necessarily small towns, yet their characters seem too urban in terms of their look and styling.\nWhat to do:Badrinath Ki Dulhania is light, entertaining and likeable.\n Varun Dhawan and Alia Bhatt prove that on screen chemistry can be enough sometimes to keep you engaged in an average plot with a predictable narrative.\nRating: *** (3 stars)\n",
        	"title": "Badrinath Ki Dulhania Movie Review",
        	"source_url": "http://www.dnaindia.com/entertainment/review-badrinath-ki-dulhania-review-varun-and-alia-s-chemistry-keeps-you-engaged-despite-an-average-plot-2348603",
        	"author": "TUSHAR JOSHI",
        	"published": "10/03/2017",
        	"newspaper": "dnaindia"
        },
        {
        	"content":"Karan Johar questions the definition of love, Ranbir-Anushka are delightful\nWHAT'S IT ABOUT:As relationships get more complicated in the real world, trust filmmakers to add those complexities on celluloid too.\n Karan Johar's latest film poses several questions on the definition of love.\n Ayan (Ranbir Kapoor) and Alizeh (Anushka Sharma) meet at a bar.\n After a failed attempt at making out, they hang out, drink, laugh, talk and become friends.\n Soon enough, he falls in love with her but she is in love with another.\n They part ways when Alizeh marries her true love.\n Meanwhile, Ayan tried to move on with the sexy Saba (Aishwarya Rai Bachchan) but that doesn't work out either.\n Fate brings him back with Alizeh but nothing much has changed.\n She still doesn't want a romance and he still hasn't given up.\n But this time, there is a tragic lining that hangs over their friendship.\n How Ayan and Alizeh cope with it and their relationship forms the rest of the story.\nWHAT'S HOT:There's always something new to expect from every Karan Johar film.\n This time, he questions the definition of love.\n There is also the emphasis on one-sided love and to Johar's credit, he handles it with maturity.\n He captures the friendship between Ayan and Alizeh brilliantly - without letting Ayan's attraction for her spoil the relationship.\n The moments are real and the setting (London, Vienna and Paris) is filled with romance.\n The winter look adds to the beauty of the film.\n ADHM is conversational, intimate, complex and fierce in terms of its approach towards love.\n Ranbir Kapoor is a delight on screen, no matter what he does.\n From dancing to Jeetendra's songs to doing Sunny Leone's steps from 'Babydoll', he is magic on screen.\n When he cries in 'Channa Mereya', you cry with him. But ADHM belongs to Anushka Sharma who delivers her most nuanced performance.\n As Alizeh, her sincerity is so severe that she steals every frame she is a part of.\n This performance clearly establishes her as the finest actor of her generation.\n Aishwarya Rai Bachchan looks stunning and is excellent despite not having much to do.\n Lisa Haydon is absolutely adorable as bimbette, making you wonder why we don't see more of her.\nWHAT'S NOT:Karan Johar always tells beautiful love stories and presents his actors wonderfully.\n But no actor in his film has ever risen above the script, or been let down by it.\n When you leave the theatre after watching a KJo film, you remember the songs, the scenes and moments that make you laugh and cry.\n In ADHM, you leave the theatre carrying just Ranbir's heartache and Anushka's performance.\n This film could easily be Karan Johar's tribute to Imtiaz Ali (with a nod to Farah Khan courtesy all the 'I-love-Bollywood' moments).\n The first half is similar to Tamasha and the second half, Rockstar.\n Unfortunately both those films also starred Ranbir Kapoor, so there is a sense of deja vu.\n It's all very well to make fun of Hindi films from the 80s, but then you can't have your protagonists dancing to synchronized steps with foreign background dancers in a disco in London.\n Sadly, the continuity jerks also are far too many.\n When Alizeh wants to take the heartbroken Ayan home, she asks him for his address and then she takes him to her house when he is too drunk to tell her.\n But she has been in his house before. Also, when she is leaving Paris for London, she is shown desperately trying to pack things into a red bag.\n But she leaves the hotel with just a backpack. Alizeh play-acting the dramatic Hindi TV serial heroine is straight out of Tees Maar Khan.\n Ranbir Kapoor's filmi dance moves in another song will take you into a flash from Bachna Ae Haseeno.\n KJo's films are always KJo's films. This one seems heavily borrowed, diluting the overall impact.\n The biggest letdown is that despite all the focus on relationships, the film lacks the capacity to choke you with emotion.\n The only one that comes close is when Ayan and Alizeh waltz on Lag Jaa Galey and that too because of the inherent emotional value of the classic song.\n",
        	"title": "Ae Dil Hai Mushkil Movie Review",
        	"source_url": "http://www.dnaindia.com/entertainment/review-ae-dil-hai-mushkil-review-karan-johar-questions-the-definition-of-love-ranbir-anushka-are-delightful-2268255",
        	"author": "SARITA A TANWAR",
        	"published": "28/10/2016",
        	"newspaper": "dnaindia"
        },
        {
        	"content": "It is that time of the year when the community swimming pool turns into a fantastic commentary on our body image perception.\nIt is when the beer-biryani bellies are on glorious display as men strip down to aspirational briefs (read: two-sizes too small) and take the plunge.\nThe confidence with which the Average Indian Male (AIM) struts his stuff leaves you with no doubt that he is indeed God’s gift to mankind.\nOn the other hand, look at the women. In frock-style swim wear, arms and legs often concealed in something that is a cross between scuba gear and a burkini.\nHer body language: Apologetic. She is almost sorry for being there, and would rather remain under water than emerge for air.\nThere are a million invisible lines of power in our community pools.\nThey start with separate timings for men and women.\nThe AIMs, it is presumed, have professional commitments and hence need to use the pool before the women.\nThe Ladies Exclusive timings are later in the day — well after the men have left for work and the kids for school.\nIt is often around noon, under the blistering sun.\nIt is perhaps a little different in upscale gated communities.\nThe pool is usually open to all, at all times of the day. Even then, it is not uncommon to spot the alpha male, showing us how to use a certain kind of body language while marking territory in water.\nI wonder if this confidence comes from the knowledge that most women, irrespective of their conditioning and confidence, tend to take up lesser space wherever they go.\nThey sit elegantly, legs crossed. They swim gracefully — yes even your average thunder-thighs aunty can show you how to master the dive, the butterfly and backstroke without making too much of a splash.\nOn the dance floor, they move in concentric circles, even as their men make drunken squiggles on the floor.\nWhich is why, Vidya Balan’s big body language — legs spread, arms on knees, piercing gaze — in an upcoming film is so much about a woman’s sexual expression and identity than just a brothel owner making a statement.\nMaybe this poolside gender role-play also has something to do with our collective fantasies.\nThe pool, in popular imagination, has been where men have had the best of everything.\nA soft Turkish robe, chilled beer, leggy women pawing him, rubbing sunscreen on his chest and a cartel of substances that boosted his already inflated ego.\nWomen, unless they were professional swimmers, would get into the pool only for his pleasure.\nAn idea reinforced by 007 and Ajit the Loin.\nWhich could also explain why the AIM is so insistent on taking selfies at every goddamned pool he meets — at resorts, hotels, clubs.\nHis FB or Insta feeds will even have pictures of unused pools where he lounges in his blue reflector sunglasses and chaddis.\nAnd so while I slip into a regulation swim wear and stick to my end of the pool, I watch the boys, men on the other side, taking up more than their share of space — both physical and otherwise.\nI wonder if they know I am judging them. Happily.\n",
            "title": "Swimming with the Sharks\n",
        	"source_url": "http://www.dnaindia.com/lifestyle/column-swimming-with-the-sharks-2374170",
        	"author": "CHANDRIMA PAL",
        	"published": "30/03/2017",
        	"newspaper": "dnaindia"
        },
        {
        	"content": "Sonam Kapoor on her skin and hair secrets, why she isn't concerned about ageing and her message to young girls\nShe has established herself as a name to reckon with in the world of fashion, but Sonam Kapoor isn't far behind when it comes to beauty.\n She's one of the few actors constantly experimenting with hair and make-up and in a tete-a-tete with After Hrs we got her to divulge some of her secrets.\nWhat are your make-up essentials?I use a kajal, concealer,lip balm,a red lipstick and a blush.\nDescribe your skin care routine\nI wash my face and use sunblock in the morning, and in the night I wear a heavy night cream and an undereye cream.\n I do facials often because I wear so much make-up. Also, Bombay is not a clean city, you need to do it.\nAre you concerned about ageing now that you're 30 plus?\nNo, I'm not concerned about ageing. I have told everybody I'm 31.\n My mom is like 'Are you serious?' I am not hiding anything. I like my lines, I feel like I've earned each and every one of them.\n I've gone through torture in the last 10 years, I feel like I might as well have something to show for it.\n And I feel as an actor I don't want to do stuff to my face and look frozen.\nHow do you deal with blemishes and pimples?Like anybody else, I cry.\nDo you do your own make-up?Sometimes I do my make-up, like today.\n I usually just wear my spectacles or my lenses, otherwise I don't know what I'm doing.\nHave you learned any make-up tips from Namrata Soni?\nMy tip from Namrata is to always wear mascara and if anything goes wrong, call her up.\n I'm like, 'Please save me.'Do you have a signature fragrance?I like to wear mogra.\n So anything with jasmine in it.Is there any beauty recipe you've learnt from your mother or grandmother?\nMultani mitti, but now I've stopped. My mom says the reason you don't have hair like your father is because I used to do ubtan for you every day and I said I never used to have hair.\n I just don't have it since I've taken after you.\nAny celebrity whose look you admire?\nJennifer Lopez, she's so hot. How old is she, like 50? I like her beauty game, I don't know about her fashion game.\n It's not my style.What's your beauty regime for your off days?\nI don't use make-up. I'll show you some pictures on my off days and you'll be like, is this the person who everybody thinks is fashionable.\n I'm in my sweatshirts. I just sit at home and read books and eat French Fries because that's vegan.\nAs a role model to young girls what message would you like to give them?\nDon't try to look like me. First of all, look like yourself and be confident and young.\n And if you want to wear lipstick, wear it. If you don't want to wear it, don't wear it.\n It's your choice.This or that Red lips or nude lips Red lips.Smoky eye or winged liner Winged liner Lip gloss or matt lipstick,Matt lipstick,Liquid liner or pencil liner.Both Contouring or Highlighting\nI don't need contouring, every make-up artist has told me I can't do that as I already have a really skinny face but I like highlighting the good parts.\nSheet mask or gel mask Sheet mask Cream blush or powder blush\nBoth - I use cream blush under my foundation and powder blush on top to last all day\nStatement lips or statement eyes\nBoth together sometimes there should be no rules in beauty and fashion. In fact, no rules in life\nMake-up brush or make-up sponge\nHands - fingers Curls or straight hair I'm born with poker straight hair so I will say curls Ponytail or a chignon Ponytail Oil massage or hair spa Oil massage Nail art or French mani Bare nails\n",
        	"title": "There should be no rules in beauty and fashion",
        	"source_url": "http://www.dnaindia.com/entertainment/interview-there-should-be-no-rules-in-beauty-and-fashion-2362383",
        	"author": "SANAYA CHAVDA",
        	"published": "22/03/2017",
        	"newspaper": "dnaindia"
        },
        {
        	"content": "A clinical India today regained the Border-Gavaskar Trophy, beating Australia by eight wickets in the deciding fourth Test here to clinch one of the most controversial and hard-fought bilateral contests in recent times.\nIt was India's seventh Test series win in a row -- continuing the dominance that started in 2015 with Sri Lanka, South Africa, West Indies, New Zealand, England and Bangladesh being annihilated.\nNeeding 87 runs on the fourth day to reach a modest victory target of 106, opener Lokesh Rahul (51 not out) dominated from the start with a flurry of boundaries and finished with six half-centuries in the series.\nThe match ended in just three days and a session, a reflection of India's distinct upperhand in the 2-1 triumph.\nThere were some hiccups when Murali Vijay (8) and Cheteshwar Pujara (0) were out in quick succession but stand-in skipper Ajinkya Rahane (38 off 27 balls) came in with the intent of hammering the bowlers into submission.\nRahane and Rahul added 60 runs for a third wicket partnership which took the team to victory in 23.5 overs.\nFittingly, Rahul finished the match with a hard-run three and celebrated wildly.\n Regular skipper Virat Kohli, who sat out of the contest due to a shoulder injury, and the rest of the Indian team gave Rahul a standing ovation.\nIn fact, Rahul ran in towards the Australian dressing room before taking off his helmet and letting out a wild war cry -- an indication of how intensely the series had been fought.\nBut putting aside the hostilities that started with the infamous 'Brain Fade' of rival captain Steve Smith, the two teams shook hands at the end of an aggressively-fought series.\nRahul's innings of 76 balls had nine fours while Rahane hit four boundaries and two huge sixes of Pat Cummins.\nIt brought the curtains down on a very productive home season in which India won 10 out of the 13 Test matches with two draws and the only defeat coming on a Pune dust-bowl against Smith's side.\nThe victory was even more special as skipper and team's premier batsman Kohli was unavailable in the deciding contest.\nA reticent Rahane, completely different in character from Kohli, marshalled his resources well in what could be termed as the best out of the 13 Test wins.\nMore so because the conditions were more Australian than Indian and the home team punted on rookie Chinaman Kuldeep Yadav, risking a batsman less in the playing XI.\nThe day started with a Rahul back cut off Josh Hazlewood followed by a square cut.\n A swept boundary off Steve O'Keefe set the tone for the day and an imperious pull shot off Hazlewood showed why Rahul is rated so highly.\nOnce India were 46 for 2, Rahane came in and showed uncharacteristic aggression, taking on the bowlers from word go.\nCummins was pulled and then slashed over the cover region for a couple of sixes, leaving the entire Australian team stunned.\nA paddle sweep off Lyon by Rahane was a delicate one after the brutal assault he unleashed on the speed merchant.\n",
        	"title": "Seven in a row: India beat Australia to win series 2-1",
        	"source_url": "http://www.dnaindia.com/sport/report-seven-in-a-row-india-beat-australia-to-win-series-2-1-2371651",
        	"author": "PTI",
        	"published": "28/03/2017",
        	"newspaper": "dnaindia"
        },
        {
        	"content":"Australia captain Steve Smith on Tuesday apologised for letting his \"emotions slip\" during the aggressively-contested but lost Test series against India, saying that he was in his \"own bubble\" at times.\n\"At times I have been in my own bubble and have let my emotions slip.\n I apologise for that,\" Smith said at the end of the four-match series, which India won 2-1 to reclaim the Border-Gavaskar trophy.\nIndia defeated Australia by eight wickets in the fourth and final Test to seal the issue at the HPCA Stadium.\n It was probably the most competitive series that India played at home in recent years with not an inch given by the visitors.\nThe series had its share of controversies and hostilities that started with the infamous 'Brain Fade' of Smith, when he was caught on camera seeking clues from the dressing room while taking a DRS call.\n The incident snowballed into a massive furore after Indian captain Virat Kohli stopped just short of calling Smith a cheat.\nThe hostilities didn't end after that and players from the two sides had regular on-field run-ins.\n However, putting it all aside, Smith was gracious in defeat and lauded India for their dominance despite Australia's resolute show.\n\"(It was a) magnificent series. One of the best I have been a part of.\n Credit to India, they are a fantastic cricket side, particularly in their backyard.\n If you give them a sniff, they will take that,\" the Australian skipper said.\nBefore the start of the series, many predicted that the Smith-led young Australian side will be whitewashed by the Indians.\n But the visitors showed tremendous fighting spirit and managed to surprise with their resolute performances, quite creditable given that they didn't have a lot of experience of playing in the sub-continent.\n\"For Australia, this is the toughest conditions for us.\n To challenge them so much, I am proud. A lot of people wrote us off.\n They said it was going to be a 4-0 whitewash. I am proud of the way we have competed.\n We have probably let a few moments slip,\" Smith said. \"Against India you can't do that.\n The middle session yesterday, when you lose five for 70, you put yourself behind. Credit to India.\n Umesh (Yadav) was fantastic. They have all been fantastic.\"\nSmith also praised the HPCA Stadium.\n \"What an amazing ground. The wicket was a good one.\n Pace and bounce, that's what we like. It suited spinners as well.\n If you are willing to bat time, you can get runs,\" he said.\n",
        	"title": "#INDvAUS: 'Have let my emotions slip, I apologise,' says a gracious Steve Smith",
        	"source_url": "http://www.dnaindia.com/sport/report-indvaus-have-let-my-emotions-slip-i-apologise-says-a-gracious-steve-smith-2371697",
        	"author": "PTI",
        	"published": "28/03/2107",
        	"newspaper": "dnaindia"
        },
        
        {
        	"content": "Samsung Galaxy S8 and Galaxy S8+ spec sheets have been leaked online.\n The usually well-informed blogger Evan Blass posted a list of tech specs on his Twitter account supposedly describing features of the upcoming Samsung Galaxy S8+, a phablet version of the Galaxy S8.\nAccording to the blogger, Samsung could be accompanying its Galaxy S8 with an even larger model called the Galaxy S8+.\nThe most immediately striking detail on the spec list is the device's screen size, since the Samsung Galaxy S8+ will apparently have a 6.2-inch QHD+ Super AMOLED screen in the standard model and a 6.1-inch screen in the curved-edge version.\n The Samsung Galaxy S8+ could also get an iris scanner to identify users, plus 4GB of RAM, 64GB of onboard storage (plus a microSD card slot), a rear-facing 12-megapixel dual camera and an 8-megapixel front facing camera.\n It's also rumored to be IP68-certified for water- and dust-resistance, earphone by AKG, and the spec list mentions a wireless charging system, sold separately.\nFirst spotted by TechnoBuffalo, the Galaxy S8 spec sheet is strikingly similar to the Galaxy S8+.\n The only noticeable difference is that the Galaxy S8 features a smaller 5.8-inch display compared to the 6.2-inch screen on the Galaxy S8+.\nSamsung's forthcoming flagship smartphone, the Galaxy S8 and the Galaxy S8+ are expected to debut a new borderless display a first for the South Korean firm's mobile devices with a screen that covers almost all of the phone's front face.\n The phones should be equipped with the latest cutting-edge components, as well as a new AI-based virtual assistant called Bixby, promising sophisticated understanding of natural language.\n both of which are expected to land in models with and without curved edges.\nBoth smartphones are expected to be revealed at a special event in March 2017.\n The headsets are rumoured to be priced at 799Euros (Approximately Rs 56,400) while the while Galaxy S8+ will reportedly carry a price tag of 899Euros (Approximately Rs 63,500).\nSamsung no doubt hopes that the devices will go some way to repairing the reputational damage caused by last year's exploding Note 7 fiasco.\n",
        	"title": "Samsung Galaxy S8 and Galaxy S8+ spec sheets leaked online",
        	"source_url": "http://www.dnaindia.com/scitech/report-samsung-galaxy-s8-and-galaxy-s8-spec-sheets-leaked-online-2334048",
        	"author": "DNEurosA WEB TEAM ",
        	"published": "24/02/2017",
        	"newspaper": "dnaindia"
        },
        {
        	"content": "Xiaomi's new entry-level phone embodies a compelling blend of features and capabilities in its price band\nOn 20 March, Xiaomi took the wraps off their Rs 5,999 Redmi 4A smartphone.\n Based on a 5-inch HD screen (720x1280), a Quad-core 1.4GHz 64-bit processor based on the Qualcomm Snapdragon 425 platform, an Adreno 308 GPU, 2GB RAM and 16GB of internal storage, it's a balanced blend of features and performance that is rare to find in its particular price range.\n However its 3,120mAH battery is the kicker - power that the company claims is good for seven days of standby time.\n The new MIUI 8 also has the unique ability to maintain two separate accounts of popular apps on the same phone, including Facebook, WhatsApp etc.\nThe phone will be going on sale today on Amazon India and on the Mi India store at noon, along with a range of accessories.\n This includes original cases for the phone starting from Rs 349, a deal with Idea Cellular where a subscriber can get 28GB of 4G data and unlimited calls with the purchase of this phone, and a Rs 200 promotion credit for Kindle ebooks using the Android app on the phone.\nAlso on offer is an additional 10 per cent cashback on IndusInd Bank credit and debit cards, where only one phone is allowed per card, and the entire amount needs to be paid during the purchase process.\n It is also valid when choosing the 'Card payment on delivery' option, subject to the PoS machine working at the time.\n",
        	"title": "The Rs 5,999 Xiaomi Redmi 4A goes on sale today - here's how to get additional 10% cashback and 28GB of 4G data with it",
        	"source_url": "http://www.dnaindia.com/scitech/report-the-rs-5999-xiaomi-redmi-4a-goes-on-sale-today-here-s-to-get-additional-10-cashback-and-28gb-of-4g-data-with-it-2364710",
        	"author": "DNA WEB TEAM",
        	"published": "23/03/2017",
        	"newspaper": "dnaindia"
        }

     
        ]
}            