["\n\n  After winning million hearts and appreciation for his performances in 'Udta Punjab' and 'Phillauri', Diljit Dosanjh has made it big. Recently, the singer-actor posted pictures and videos of him in his recently bought private jet.\n  \n  The 'Naughty Billo' singer took to Twitter to post a picture of his jet and captioned it, \"New Beginning Starts With Private Jet\"\n  \n\n\n\n\nNew Beginning Starts With Private Jet 🛩 https://t.co/xXC6fmpzAl\n        — DILJIT DOSANJH (@diljitdosanjh)\n        1492420922000\n\n\n\n\n\n  Diljit also uploaded a video with the pilot and co-pilot and wrote, \"Thug Life Jet Life\"\n  \n\n\n\n\n🛩 https://t.co/rIMFYAr4I4\n        — DILJIT DOSANJH (@diljitdosanjh)\n        1492426371000\n\n\n\n\n\n  On the professional front, Diljit is gearing up for his Dream Tour which will take place in the month of May. He will be performing in Vancouver on May 6, in Edmonton on May 13, and in Winnipeg on May 17, and in Toronto on May 22, 2017.\n  \n\n", "BEGUM IS SPIRITED BUT DOESN’T SERVE UP SOUL CURRY  Begum Jaan Story: On the eve of Independence, the chairman of the Border Commission, Sir Cyril Radcliffe decides to divide India and Pakistan into equitable halves. What the administration doesn’t account for is the line running through the middle of Begum Jaan’s(Vidya Balan) brothel situated plonk on the border; with one half falling in India and the other in Pakistan.  Begum Jaan Review: It’s a good period and story to revisit because even 70-years after Partition, anything around it still piques interest. Then again, here the narrative deals less with the horror of the divide and serves more as an ode to the spiritedness of Begum; widowed in her childhood and sold to a brothel. Also, Mukherji is revisiting his Bengali film Rajkahini(2015).  movie  Coming back to our protagonist – kings, administrators and commoners are hooked onto the pleasures provided by her girls, so Begum with her guile manages to rule. Till, Radcliffe draws the Lakshman-Rekha.  Vidya invests fully in Begum and her dialogue-baazi (a lot of which is raunchy) will get ceetis. However, the writer-director’s interest level in everything else, falters. A sense of deja-vu pervades as one watches a prostitute staring sightlessly at the celling when \"entertaining\" a customer; or when sex-workers get sentimental over a child, \"because all of them are mothers first and whores later.\" Surely these women needed to be fleshed out with more finesse.  Begum’s spunk is infectious though. She resembles a Bengal tigress whether she is defending her body or boundaries. However, trying to retell her virtues through various historical avatars in animation, is far too indulgent. Also conversations between officials of the INC and Muslim League, or for that matter between other cardboard cutouts, is superficial. The cinematographer’s effort to capture the Indo-Pak divide with close-ups in half frames, seems amiss.  The Holi number is peppy with striking visuals. Otherwise having the 11 women in one frame becomes nothing but a screech-fest. Having Vidya in a film is an asset though. She is an audacious actor, who merits an extra half star for her ability to shoulder a film.  Also Read:  'Begum Jaan' is the symbol of power, courage and strength  Also Read: Begum Jaan Review in Hindi ", "\n\n\n  'The Guardians of the Galaxy Vol 2' gave a special treat to their Indian fans with a new trailer featuring popular Hindi track \"Jhoom Jhoom Jhoom Baba\".\n  \n\n  The Marvel Comics superhero characters dancing to the tunes of Bappi Lahiri's classic disco number, gives the trailer a perfect Indian touch.\n  \n\n\nMarvel premieres 'Guardians of the Galaxy Vol. 2' new teaser trailerThe second trailer of Marvel's 'Guardians of the Galaxy Vol.2' was recently released, promising more Baby Groot, more action and more rock and roll from Chris Pratt.\n\n\n\n  Besides this, Zoe Saldana and Dave Bautista also gave a shout out to their fans in the country by sharing a special message for them.\n  \n\n  \"Namaste India, I'm Dave Bautista and I'm Zoe Saldana and here's something special from the Guardians of the Galaxy, just for you. Obviously,\" the actor duo said in the clip.\n  \n\n  'Guardians of the Galaxy Vol 2', written and directed by James Gunn, also stars Chris Pratt and features the voices of Vin Diesel and Bradley Cooper.\n  \n\n\n\n\n", "\nSinger Palash Sen, who has launched a rock song on Jesus Christ, said that no one sings about him and that the reasons could be communal, commercial or political. While people celebrated the Easter Sunday on April 16, Sen unveiled the song 'Jesus, the Lord has risen'.\n  \n\n  \"No one sings about a man like Jesus... the reasons could be communal, commercial or political. I have always believed music and poetic expressions are way above all this,\" he said.\n  \n\n  \"The music and the film industries have regularly ignored the Christ and I have always wondered why. Lately, all one hears in the name of faith... are so-called Sufi songs,\" added the frontman of band Euphoria.\n  \n\n  Speaking on the current scenario of the music industry and singers, Sen said: \"The successful singers in the industry are happy to sing songs made by others... be at the back and call of the producers and directors who treat them like crap.\"\n  \n\n\nPalash Sen and Rabbi Shergill raise funds as well as the level of fun in DelhiIt was a gala evening when People for Animals (PFA) organized a concert in the city with Palash Sen and Rabbi Shergill to raise funds for animal welfare.\n\n\n  \"The singers wait for that one hit song that will give them tonnes of money. And the wait goes on. No one spends his or her money doing the music he or she likes. It's unfortunate,\" he added.\n  \n\n  The new song is written, composed and produced by Sen. Explaining the reason behind it, he said: \"Rock might not be the music of choice and English might not be the preferred language for the film or the music industry of India, nor is Jesus Christ the commercially viable subject of a song. Well then, that's what Euphoria is exactly going to do,\" he said.\n  \n\n  \"The reason to sing a song about Jesus is just one --- we felt like,\" he added.\n  \n\nPalash Sen faces the music for 'sexist' remarks at IIT fest03:31\n\nAisa Yeh Jahaan: Screening129Aisa Yeh Jahaan: ScreeningPalash Sen during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Amruta Fadnavis during the screeningAmruta Fadnavis during the screening of Bollywood film Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics: Viral Bhayani)Palash Sen with a guest during the screeningPalash Sen with a guest during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Divija Fadnavis during the screeningDivija Fadnavis during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Krishna Raj Kapoor during the screeningKrishna Raj Kapoor during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Palash Sen during the screeningPalash Sen during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Guests during the screeningGuests during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Palash Sen and Amruta FadnavisPalash Sen and Amruta Fadnavis during the screening of Bollywood\nfilm Aisa Yeh Jahaan, held at Lightbox, in Mumbai, on July 25, 2015. (Pics:\nViral Bhayani)Aisa Yeh Jahaan: ScreeningSonam Kapoor during the screening of the movie Aisa Yeh Jahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Palash Sen during the screeningPalash Sen during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor and Ira Dubey during the screeningKymsleen Kholie, Ayushmann Khurrana, Sonam Kapoor and Ira Dubey during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Ayushmann Khurrana and Palash Sen during the screeningAyushmann Khurrana and Palash Sen during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor with Biswajeet BoraSonam Kapoor with Biswajeet Bora (R) during the screening of the movie Aisa Yeh Jahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor and Ira Dubey during the screeningSonam Kapoor and Ira Dubey during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Jay Bhanushali during the screeningJay Bhanushali during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor and Kymsleen Kholie during the screeningSonam Kapoor and Kymsleen Kholie during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Ira Dubey and filmmaker Biswajeet Bora during the screeningKymsleen\nKholie, Palash Sen, Ira Dubey and filmmaker Biswajeet Bora during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Kymsleen Kholie and filmmaker Biswajeet Bora during the screeningKymsleen\nKholie and filmmaker Biswajeet Bora during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Ira Dubey during the screening of the movie Aisa Yeh JahaanIra Dubey during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Palash Sen and Ira Dubey during the screeningPalash Sen and Ira Dubey during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor and Ira Dubey hug each other during the screeningSonam Kapoor and Ira Dubey hug each other during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Kymsleen Kholie during the screeningKymsleen Kholie during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor and Kymsleen Kholie during the screeningSonam Kapoor and Kymsleen Kholie during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Sonam Kapoor during the screeningSonam Kapoor during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Palash Sen and Ira Dubey during the screeningPalash Sen and Ira Dubey during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Carol Gracias during the screeningCarol Gracias during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Kailash Kher during the screening of the movie Aisa Yeh JahaanKailash Kher during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Yashpal Sharma during the screeningYashpal Sharma during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)Kymsleen Kholie during the screeningKymsleen Kholie during\nthe screening of the movie Aisa Yeh\nJahaan, in Mumbai, on July 23, 2015. (Pic: Viral Bhayani)\n\n", "\n\n  10 years ago, Bollywood saw the coming together of Abhishek Bachchan and Aishwarya Rai. In these 10 years, not only has the couple proved to us time and again that true love exists, but they've also given us major couple goals!\n  \n  Have a look at the 5 Best Moments of Abhishek & Aishwarya:\n  \n\n  1. When Abhishek recalled Aishwarya saying yes to him on a balcony in New York when it was freezing!\n  \n\n\n\n\n  2. November 16th 2011, When Aishwarya gave birth to their beautiful baby girl Aaradhya!\n  \n\n\n\n\n  3. When Nandu Bhide taught his wife his signature 'Snakes Dance'\n  \n\n\n\n\n  4. When Abhishek supported Aishwarya with his Witty one liner!\n  \n\n\n\n\n  5. Abhi-Aish stood by each other throughout their 10 year long journey!\n  \n\n\n\n\n\n  By\n  Lakshmi Venkateswaran\n\n", "\n\n  If you're one of those who were disappointed with Priyanka Chopra's blink-and-miss appearance in 'Baywatch' trailers, here's something that will put a smile on your face. The 'Baywatch' team has released a new poster of the film and it's our desi girl who commands all the attention. The poster has Priyanka with a wicked smile while Dwayne 'The Rock' Johnson, Zac Efron, Alexandra Daddario and others can also be seen. The tagline on the poster simply reads, \"Go ahead and stare.\" Something tells us that's exactly what people will be doing - after all, Priyanka looks gorgeous in the close-up shot and it's hard to take your eyes off her.\n  \n\n\n\n\n\n\n  Priyanka, who has already made her mark in the West courtesy her popular show 'Quantico', makes her debut in Hollywood with 'Baywatch'. The actress is playing the baddie Victoria Leeds in this action-comedy film, which is directed by Seth Gordon. PeeCee has been teasing her fans with glimpses of her debut film and we can't wait to watch the movie once it hits theatres on May 25.\n  \n\nPriyanka Chopra looks dangerously hot in new ‘Baywatch’ poster00:55\n\n", "\nKareena Kapoor and Karisma Kapoor's mother Babita Kapoor rang in her 69th birthday in style as the entire Kapoor clan gathered to celebrate her birthday in a private bash which was hosted by her lovely daughters.\n  \n\n  Kareena made a grand entry in a simple yet classy gown along with hubby Saif who sported a white shirt, denims and a vest. The couple happily posed for the shutterbugs as they arrived at the venue.\n  \n\n\n\n\n\n\n\n\n\n\n\n\n  Karisma was spotted with her children Samaira Kapoor and Kiaan Raj Kapoor. The others present were Randhir Kapoor, Rishi Kapoor, Neetu Kapoor, Rima Jain, Sanjana Kapoor, Kunal Kapoor, Armaan Jain and Rajiv Kapoor.\n  \n\n\n\n\n\n\nSaif, Kareena and Karisma party in style at Babita's birthday bash01:41\n\n\n  Missing from the scene was Ranbir Kapoor who is busy shooting for his upcoming biopic on Sanjay Dutt and Lolo's rumoured beau Sandeep Toshniwal who attended Randhir Kapoor's birthday bash a couple of months ago.\n  \n\n", "Story: The film is a poignant, true tale of survival that unfolded at the Warsaw Zoo during Germany’s invasion of Poland in the Second World War. Based on Diane Ackerman’s book, the wartime drama pays tribute to the heroic Polish couple - Jan and Antonina Zabinski, former Warsaw zookeeper and his wife. The daring duo saved hundreds of Jews by sheltering them in the basement of their dilapidated zoo right under the noses of the Nazis, who bombed the place, killed the animals and shifted a few valuable species to Germany. Against all odds, the Warsaw zoo was rebuilt and is open till date.  Review: Niki Caro’s suspenseful, awe-inspiring and captivating cinematic adaptation salutes the indomitable spirit of the Zabinskis, who exuded compassion, kindness and unflinching courage in the face of fear. It will compel you to visit the iconic zoo, which serves partially as a museum today. Powerful and gut-wrenching without an ounce of melodrama, the film tugs at your heartstrings and reinstates your belief in goodness and love towards other living being - be it man or animal.  It is the director’s astute storytelling and ability to showcase varied human tendencies that allow her film to shuttle between a heartrending human drama and compelling war thriller. Every attempt of the couple, who put their lives on the line by indulging in guerrilla tactics against the Germans, sends shivers down your spine.  Quite emotional and therapeutic, tears roll down your cheeks when Antonina (played by Jessica Chastain) reveals why she loves animals. “You look into their eyes and you know exactly what's in their hearts”, she says. Chastain’s riveting portrayal and her comfort level with the animals is noteworthy. Especially the scenes where she plays the piano to warn the Jews hiding in her house are outstanding. Daniel Bruhl's intense performance as the German zoologist with suspicious intentions, lends gravitas to the period drama. The supporting cast is equally credible.  The Zookeeper's Wife is an incredible real life story that reminds us what makes us human - our ability to hope and rise beyond the darkness and hatred.  ", "\nDisha Patani, who shot to fame with 'M.S. Dhoni: The Untold Story' starring Sushant Singh Rajput, left the audience mesmerised with her on-screen presence. With her striking features looks, that beautiful smile and an amazing style quotient, it's not surprising that Disha has become a sensation. The actress often posts some drool-worthy pictures on her Instagram handle and her fans can't have enough of them.\n  \n\n  Recently, a few unseen pictures of Disha from her teenage years surfaced on the internet and you'll be amazed to see how different she looked at the beginning of her journey. The pictures in question are said to be from her first photo shoot. Clad in different sarees, Disha looks demure and dainty. We bet you'll do a double take on seeing these pictures.\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThese unseen pictures of Disha Patani's old photoshoot will blow your mind00:42\n\n\n\n", "MAATR IS RELEVANT BUT MAKES YOU QUEASY  Maatr Story : Vidya Chauhan (Raveena), a school teacher and her teenage daughter Tia (Alisha) are raped, assaulted and dumped on the roadside. Tia succumbs to her injuries while Vidya survives. Since the police are dragging their feet all over the investigation, Vidya devises her own revenge strategy.  Maatr Review : Delhi, where this film is based is often referred to as the rape capital of India. And the film’s sole intention is to serve as a wake-up call for the atrocities against women. So you applaud the intention. However, the film itself is over-dramatized account of the heinous crime and what follows.  Minutes into the movie, you see how a mother and daughter end up taking a wrong turn and unwittingly find themselves at the home of Apurva Malik (Madhur Mittal), the wayward son of a politician. High on substance, he and his gang of morally-depraved friends are ever ready to score. They rape and abuse Vidya and Tia in a brutal way, leaving you anguished. And, even before you can recover from the viciousness of it all, these two are flung from the car, onto the kerb in Nirbhaaya style, making you flinch further.  Obviously the idea is to get people out of their slumber but to achieve better results, the screenplay and characterization needed to be sharper. Instead it plays out like a drill. Mother is hospitalized. Her insensitive husband, mourns the loss of his daughter, but wants to divorce her. An artist friend, Ritu(Divya Jagdale) provides succour. And the police are stereotypes, who mouth ridiculous lines like, ``PM desh ko shape karne ki baat kar rahe hain, aur yeh rape ki baat kar rahi hai.’’  Next the mother, pulls off her bandages, steps on the treadmill and adorns the avenging angel avatar. Turn by turn, she plots the murders of the men who wronged her. Of course, because her suffering has been so deep, you empathize with her initially. However, her brand of vigilantism violence is equally disturbing.  Raveena is sincere as the victim who sullies her hands to get justice. But, the amount of bloodshed, leaves you asking, what is worse. Are the images of rape gorier, or is the bloodshed of the perpetrators of the crime, grosser?  ", "Sonata Story: Three intelligent, self-sufficient women debate companionship, compromises and compassion over wine, cheese and (sour) grapes.  Sonata Review: You’d sooner see a flying saucer streak across the night sky than an Indian film with three 60-plus female protagonists who aren’t playing doting mothers, dying aunts or devious matchmakers. Kudos to Aparna Sen for pulling this lost demographic out of the shadows.  In Sonata, a movie adaptation of Mahesh Elkunchwar’s play, Sen casually invites us into the lives of three women in the their sunset years.  Aruna (Sen) is a linguistic scholar who won’t stand foul language; she’s comfortable living by the social code of a time whose scriptures she deciphers. While she’s in her prudish cocoon, her long-time friend and roommate Dolon (Azmi) is the butterfly that Aruna never quite morphed into. Dolon is the little devil on Aruna’s shoulder, always coaxing her into things that she’s uncomfortable with. The movie thrives on the nervous energy between Aruna and Dolon. The possibility of a subtle romantic subtext there is intriguing and handled smartly. Their third friend Subi (Dubey) flits in and out of their house and gives them something to think about with every visit.  The movie has an unmissable Woody Allen influence, where the plot is merely a crutch to display well-rounded, vibrant characters. So while you cannot summarize the story, you can best describe it as an evening spent chatting with friends - you being the designated listener - where you are amused by Dolon’s indecision, Aruna’s meekness and Subi’s bouts with her men.  And like all evenings with friends, there will be awkward silences when you will momentarily zone out when a character is droning about Beethoven, or an actor is delivering a heightened performance. In a play, this is charming. Sen hasn’t quite altered the screenplay or the treatment to fit this new medium. Static shots and indulgent conversations are Sonata's bane.  However, it is rare for unapologetic narratives about older single women (who \"aren't even feminists!\") to find their way to the screen. This is the kind of movie that you need to sip and savour. It won’t go well with popcorn and soda, but it’s worth a visit to the theatre anyway.  ", "\n\n  After the success of their last two films, Salman Khan and filmmaker Kabir Khan are back this Eid with 'Tubelight', an entertaining family drama set in a small town in the hills of Northern India. The film is about one man's unshakable belief in himself and his love for his family.\n  \n\n\n\n\n\nShah Rukh To Make A Cameo In Salman’s ‘Tubelight’00:33\n\n\n"]