["\n\n  NEW DELHI: In his own inimitable way, Bollywood superstar Shah Rukh Khan on Wednesday wished Sachin Tendulkar for his upcoming film and elicited a philosophical response from the cricket legend.\n  \n\n  A film on Tendulkar - Sachin A Billion Dreams - will release worldwide on May 26 and celebrities across various walks of life have been wishing the cricket legend on social media. Shah Rukh's good luck post though stood out.\n  \n\n  Tendulkar, who rarely shows his emotions, gave a glimpse of his philosophical side while responding to the gesture of extremely popular actor.\n  \n\n  \"I believed, when u did well I would 2 & when u didn't,I will fail. Like a billion others I miss my guiding lite. ATB for the film,\" Shah Rukh tweeted.\n  \n\n\n    Zindagi me haar na hoti to koi kabhi jeet ta nahi aur kuch seekhta bhi nahi. Touched by your words like a billion others, love u\n    @iamsrk\n    :-)\n    https://t.co/zsjDfStHQY\n\n\n    — sachin tendulkar (@sachin_rt)\n    April 19, 2017\n\n  In reply, Tendulkar tagged Shah Rukh's post and replied:\"Zindagi me haar na hoti to koi kabhi jeet ta nahi aur kuch seekhta bhi nahi. Touched by your words like a billion others, love u @iamsrk :-)\".\n  \n\n  Among the other notable personalities to have wished Tendulkar include Rajnikanth, Madhuri Dixit-Nene, Shreya Ghosal.\n  \n\n", "\n\n  HYDERABAD: The young guns of Delhi came up short after a Kane Williamson masterclass on Wednesday. The New Zealand captain made his first appearance in IPL X a memorable one for Sunrisers Hyderabad as they added Delhi Daredevils to the list of teams that succumbed to the hosts' never-say-die attitude.\n  \n\n  In doing a David Warner, Williamson showed that he's a consummate professional and his 89 (51b, 4x6, 6x5) was sheer class. Coach Tom Moody had lavished praise on the New Zealander ahead of the game, saying how he's such a positive influence on the team and how he's of immense help to Warner with his leadership abilities.\n  \n\n  The Sunrisers' skipper had a rare off day after winning the toss and batting first against Delhi on the same wicket where they had walloped Royal Challengers Bangalore in the opener.\n  \n\n  An express delivery from Chris Morris got rid of Warner, but that was the only success Delhi had for the next 14 overs as man of the match Williamson, one of the two changes Sunrisers made to the team that defeated Kings XI Punjab, assumed charge.\n  \n\nShikhar Dhawan (70; 50b, 4x7, 6x1) had a headstart of seven runs when the New Zealand captain came in to bat on Wednesday and the way he dominated the Delhi attack enthralled the crowd at the Rajiv Gandhi International Stadium - the 15-run win was the Sunrisers' fourth win at this venue this season.\n  \n\n  Morris' second over fetched 10 runs for the hosts, Angelo Mathews' first went for 16, a Pat Cummins' screamer was creamed over square leg and the 14th over bowled by Amit Mishra went for 19 runs, as Williamson shifted gears.\n  \n\n  The hosts couldn't have asked for a better No.3 whose authentic cricketing shots, brisk running between the wickets, and 136-run partnership with Dhawan put Sunrisers on course for 191 for four.\n  \n\n  It took a good catch by Shreyas Iyer off Morris, the only successful bowler for Delhi with four for 26, to dismiss Williamson, but Sunrisers, who had cruised to 80 for one at the halfway stage, added 55 in the next five and another 56 in the last five.\n  \n\n  The second change Hyderabad made also worked well. With 62 wickets from 21 matches, Mohd Siraj is one of the top wicket-takers in domestic season 2016-17 and he had topper Siddarth Kaul (67 from 21 games) for company.\n  \n\n  Sam Billings hit Siraj for three boundaries but the bowler had the last laugh. Sanju Samson (42; 33b, 4x2, 6x2) and Karun Nair (33; 23b, 5x4, 6x1) added 71 for the second as Delhi cruised to 56 for one in the first six overs and hardly looked in trouble till Nair was run out and Rishabh Pant succumbed soon after.\n  \n\n  Samson's dismissal soon after the strategic timeout, meant Delhi needed 65 from the last 30 deliveries, but they only mustered 176 for five.\n  \n\n  The 70-run fifth wicket partnership between Shreyas Iyer (50 no; 31b, 5x4, 6x2) and Mathews (31; 23b, 4x2, 6x1) whittled it down to 34 from the last 12 deliveries. But Bhuvneshwar was as usual brilliant in the penultimate over, conceding 10 runs, and for the second successive game, Kaul sealed the win with a remarkable final over.\n  \n\n", "\n\n  NEW DELHI: In a high-octane second week of matches (April 13-19) in IPL 2017, we've seen a tremendous display of accurate and incisive pace bowling from Purple Cap holder Bhuvneshwar Kumar, a heroic 95 from Manan Vohra, hat-tricks from Samuel Badree and IPL debutant Andrew Tye (who converted his into a five-wicket haul), a match-turning 70 from Kieron Pollard and a whirlwind return to form by Chris Gayle who in the process became the first batsman to 10,000 runs in Twenty20 cricket.\n  \n\n  But for his consistency and contribution to table-toppers Kolkata Knight Riders' hat-trick of victories this past week, there is no looking past the all-sorts spinner Sunil Narine. Three wickets in three matches at a superb economy rate of 4.75 puts Narine as the stand-out spin bowler of the past week of matches, and there was also a match-winning innings when the West Indian was promoted to open the innings with his skipper Gautam Gambhir versus Kings XI Punjab, which fetched Narine the Man-of-the-Match award.\n  \n\n  In the aforementioned match against KXIP, Narine had figures of 4-0-19-1 out of a total of 170/9. He bowled his first over during the Powerplay and conceded eight runs, and then came back to bowl the eighth and cramped Marcus Stoinis for room before drawing a fatal shot that cannoned into the stumps. In four overs spread apart across the fifth and 16th overs of KXIP's innings, Narine bowled 14 dot balls and did not concede a single boundary.\n  \n\n  Sent in as a pinch-hitter in the absence of the injured Chris Lynn, Narine found the boundary seven times - three sixes and four fours - during an electric 37 off 18 balls that gave KKR an opening stand of 76 in just 5.4 overs. A target of 171 was achieved for the loss of two wickets inside 17 overs, and the two-time champions were up and running.\n  \n\n  Two days later, Narine was at the forefront of another win, this one over defending champions Sunrisers Hyderabad. He failed as opener, scoring six of nine balls, but was excellent with the ball with figures of 4-0-18-1. Varying his pace and hitting a scrambled seam repeatedly, Narine befuddled the batsmen and in his third over - the 14th over of SRH's chase - he had Deepak Hooda stumped. In his four overs, Narine conceded one four and sent down 10 dot deliveries. KKR won by 17 runs, and when you consider that Umesh Yadav conceded nine runs an over, Trent Boult 8.25 and Chris Woakes 12.25, Narine's economy of 4.50 is stunning.\n  \n\n  In KKR's third won in a row, over Delhi Daredevils by four wickets off the penultimate delivery of the match, Narine was again outstanding with an analysis of 4-0-20-1. On a sluggish Feroz Shah Kotla surface, he wheeled away his four overs for in what was his most teasing display so far, and should have a second wicket if not for a dropped catch by Robin Uthappa behind the stumps. In two overs inside the Powerplay, Narine gave away eight runs while bowling four dots. In the 18th over, he duped big-hitting Angelo Mathews who was bowled when dashing out.\n  \n\n  Success for a winning team over a period of time is critical in assessing performances in a tournament as condensed as the IPL, and hence Narine edges out the other star performers of the past seven days.\n  \n", "\n\n  NEW DELHI: Sunrisers Hyderabad beat Delhi Daredevils by 15 runs to register their fourth straight win at home this IPL. Needing 192 to win, Sunrisers Hyderabad finished on 176 for 5 with Siddharth Kaul bowling a magnificent final over, conceding just eight off it and winning the match for his side.\n  \n\n  We break down the match in five different passages of play that determined the outcome.\n  \n\nWhere was Kane Williamson all this while?\n\n\n  ...Is the first question that comes to mind when you consider the kind of knock the New Zealand skipper played. Playing his first game of this IPL, Williamson scored a refined half-century. He walked in at No. 3, ahead of Moises Henriques and when Sunrisers had lost David Warner cheaply. The Delhi bowlers kept Williamson and Dhawan quiet with some disciplined bowling from Zaheer Khan and Pat Cummins. But once the Powerplay concluded, Williamson got Sunrisers moving with consecutive sixes off Angelo Mathews.\n  \n\n  On a slow surface, he paddled Zaheer towards the fine-leg boundary and drilled Pat Cummins past him. His real assault came against Amit Mishra. The legspinner tossed it up and Williamson gave himself room and used his feet to launch him over the fence twice in three balls. With Zaheer mixing it up, Williamson shuffled and whipped one behind square. It was ball-striking at its best. Not all timing and muscle but just about enough to get the job done. Williamson looked set to notch up the second individual three-figure digit of this season, but a terrific effort on the field by Shreyas Iyer ended his knock for 89.\n  \n\nDhawan gets some form going\n\n\n  Shikhar Dhawan, despite scoring a couple of 40s in the tournament, hadn't looked at his free-flowing best. But it happened here against the Daredevils. He and Williamson put on a 136-run stand for the second wicket and did the intelligent part of playing himself in. Dhawan quietly went about scoring runs when all the focus remained on Williamson and how easily he was belting the Daredevils bowlers. Dhawan brought up his 27th IPL half-century soon after his partner notched up his. He played the anchor role well.\n  \n\n  It wasn't as if Dhawan was slow. He began with a four after the first ball of the match resulted in a free hit and hit a couple of delightful cover drives off Cummins and Morris. A period of lull followed but whenever the opportunity arrived, Dhawan punished the loose balls. Once he went past his fifty, the left-hander put Morris for two boundaries in the 17th over and cleared the midwicket boundary off a Mathews' delivery that was right in the slot. He fell to an awful Morris delivery, one that was way down leg. Dhawan swung and the ball went straight down Mathews' throat at deep-square leg.\n  \n\nNo stopping Morris\n\n\n  Chris Morris continues to amaze. Having already registered figures of 3/21 against Royal Challengers Bangalore and 3/23 against Kings XI Punjab, the South African allrounder delivered once again - this time his second best IPL figures of 2/26 in four overs. He provided Daredevils the perfect start, sending back Warner in the second over, and then returned for his second spell in the 17th over to remove the dangerous Williamson. In his next and final over, Morris pinned Dhawan and Yuvraj off successive deliveries to deny Sunrisers a final thrust. Even though Deepak Hooda and Moises Henriques' small cameos towards the end ensured that Sunrisers got to 191/4, without Morris, they could have very well breached the 200 barrier or even more.\n  \n\nSamson, Nair keep chase in control before Yuvraj gamble pays off\n\n\n  Mohammed Siraj, the debutant, after getting hit for three fours in his first over, got his man Sam Billings. It was an uppish flick but was hit straight to Hooda at mid-wicket. But despite the wicket, Sanju Samson and Karun Nair kept the scoreboard moving at a brisk pace. It was a wonderful Powerplay for the Daredevils as they race to 56/1 in six overs. Samson cracked a couple of sixes, while Nair played a few lovely cover drives and finally seemed to be getting some runs under his belt. 20 off his first 25 runs came in boundaries. The two put on 71 runs and at 75/1, Sunrisers seemed to be in control of the proceedings.\n  \n\n  The Daredevils then took a gamble when they handed the ball to Yuvraj Singh, and it paid off. His first ball went for a four but off the second, Vijay Shankar put in a powerful throw from the deep to run Nair out. Three balls later, Rishabh Pant slog swept Yuvraj to find Warner at long-on. The double blow shifted the tide in favour of Sunrisers.\n  \n\nIyer fights, but Kaul prevails\n\n\n  With Samson perishing and 91 needed off the final six, it was time to go for the big shots, and Iyer began doing so with a couple of sixes off Rashid Khan. But some terrific bowling by Moises Henriques, Siraj and then Bhuvneshwar Kumar and Siddharth Kaul in the death was too much for even Iyer to overcome. Daredevils might have missed a trick by sending Mathews ahead of Morris, who never got a chance to bat. Iyer fought hard, and his unbeaten 50 off 31 balls - five fours and two sixes - brought the equation down to 24 needed off the final over. But Kaul held his nerves to bowl a fabulous final over, where he conceded just eight and won his side the match by 15 runs.\n  \n", "\nCristiano Ronaldo asked for immunity from the boos of the ever-demanding Santiago Bernabeu crowd after his hat-trick against Bayern Munich on Tuesday fired Real Madrid into the semi-finals of the Champions League for a seventh consecutive season.\n  \n\n  Ronaldo's double in Munich had given Real a 2-1 lead in the first leg and after a couple of wayward shots in the first half had provoked whistles from the home supporters, the prolific Portuguese proved the difference in an eventual 4-2 win over Bayern after extra-time, setting up a 6-3 aggregate victory.\n  \n\n  His header cancelled out Robert Lewandowski's goal late in the second half and he then finished off Bayern with strikes in either half of extra-time after Sergio Ramos' own goal had levelled the scores on aggregate, although his last two goals were from offside positions.\n  \n\n  His third goal of the night and fifth of the tie saw him become the first player to reach 100 goals in the Champions League, and the four-times World Player of the Year put his finger to his lips to the supporters who had booed him earlier.\n  \n\n  \"I'm not asking them to name streets after me, the only thing I ask is that they don't boo me here,\" Ronaldo told Spanish TV station Antena 3.\n  \n\n  \"I want them to stop booing me because I always give my best and even when I don't score I try to help Real Madrid.\"\n  \n\n  Manager Zinedine Zidane lavished praise on the team's all-time top scorer but reminded Ronaldo that Real players had to get used to the relentless pressure from supporters of the 11-time European champions.\n  \n\n  \"Perhaps the fans won't boo him any more, but this is the Bernabeu and it can happen from time to time and he knows that,\" said the former France captain.\n  \n\n  \"The only thing he did was to stay calm and he proved himself on the pitch. There are few players that are always there in the key moments, and the fans will be grateful for what Cristiano has done here.\n  \n\n  \"He always knows that when there's an important occasion, he's going to be there and he showed it again tonight. What he did is outside any sort of category. There are few players who can do what Ronaldo has done and we all know that.\"\n  \n", "\n\n  KOLKATA: He wants to finish games like he did for the Kolkata Knight Riders against Delhi Daredevils but Yusuf Pathan won't change his flamboyant style of batsmanship.\n  \n\n  \"There was a lot of pressure I just wanted to play my natural game. You will always get out at some point, be it in the first ball or in the 40th ball. But it's about playing my shots and making the balls count,\" Pathan told PTI during an interview.\n  \n\n  On his own admission, Pathan feels that he is a special talent, who need not to compete with anyone but focus on his own game.\n  \n\n  \"Everyone has some special talents, and I am also special in my way. I don't want to compete with anyone. I want to prove myself with my performance on the field,\" Pathan said with a lot of conviction.\n  \n\n  So does he harbour hopes of an India comeback with so many ahead of him for those couple of slots in the middle- order?\n  \n\n  \"It does not matter to me who's ahead of me (in representing India). I consider myself as a special talent,\" Pathan said.\n  \n\n  Having scored 39-ball 59 against Delhi Daredevils, the India discard proved why he is so highly rated in the Kolkata Knight Riders ranks despite his game-changing knocks being few and far in between.\n  \n\n  \"I have to back my talent. It does not take time for things to change. If I continue to perform well, at some point I will get an opportunity if not today then tomorrow,\" Pathan seemed positive that he may once again don the India blues.\n  \n\n  \"I don't want to look at others. My job is to play good cricket and the start has been good this time. I should be satisfied with my cricket and be prepared whenever I get a chance,\" he said.\n  \n\n  Pathan has had his share of disappointment with the team especially during their maiden title-winning campaign in 2012 when he managed just 194 in 17 matches without a single half- century but the Shah Rukh Khan co-owned franchise has backed him throughout these years.\n  \n\n  In fact, his 112 matches since 2011 is one more than skipper Gautam Gambhir's 111 games for the popular Kolkata franchise.\n  \n\n  \"The only message from Shah Rukh Khan, continue to entertain the way you have been,\" Pathan said.\n  \n\n  Pathan refused to agree his style has changed but says he's keen to finish off games now.\n  \n\n  \"Having played for so long, you are aware of your team's strength. If you are set, it's all about finishing the game. It's about setting a precedent for the youngsters in the team as well. They should also get an opportunity to learn. It's about winning comfortably.\"\n  \n\n  Pathan believes that as long as he is at the crease, KKR can win matches.\n  \n\n  \"I think as long as I am at the crease, the team will win comfortably. In the past, I have seen the team has gone on to lose the match after I got out. All these things, I have brought some changes in my game. It's about playing shots.\"\n  \n\n  At this stage of his career, Pathan only wants to enjoy his cricket.\n  \n\n  \"I just want to enjoy my cricket. If you see in the last game, I've started playing shots from the very second ball. My style has not changed, it is just that I want to make sure that I take the team through till end. This is the only change,\" he said.\n  \n\n  Pathan credited chief coach Jacques Kallis and his deputy Simon Katich for bringing a balance in the team, which is leading the table with four wins from five matches.\n  \n\n  \"The credit goes to Katich and Kallis. They have put on a lot of hard work. They have put a clear picture on every player's mind. Everyone knows their role well. If you play well result will come your way.\"\n  \n\n  Pathan also hailed the Kolkata crowd for turning up in huge numbers in every game.\n  \n\n  \"It was heartening to see packed crowd from the very first match. In previous seasons, there would be many empty seats in the initial phase but now it's all packed up. Such an excitement among the crowd is really motivating to do even better,\" he signed off.\n  \n\n", "\n\n  BARCELONA: A distraught Neymar left the field in tears as Juventus held Barcelona to a 0-0 draw at the Camp Nou on Wednesday to reach the Champions League semi-finals 3-0 on aggregate.\n  \n\n  Barca had overcome a 4-0 first-leg deficit against Paris Saint-Germain in the last 16 with a dramatic 6-1 win back on home soil.\n  \n\n  But Juventus showed why they boast the best defensive record in the competition as Lionel Messi, Luis Suarez and Neymar were blunted as the Italians gained revenge for their defeat in the 2015 Champions League final.\n  \n\n  \"To not concede a goal in two games against Barcelona says a lot about the tactical level of the team,\" said Juventus boss Massimiliano Allegri.\n  \n\n  \"They had more chances in Turin than they did tonight. The team defended very solidly tonight.\"\n  \n\n  Juventus join holders Real Madrid, Atletico Madrid and Monaco in Friday's semi-final draw.\n  \n\n  \"We tried with all our might, but we couldn't find the route to goal,\" said Barca coach Luis Enrique.\n  \n\n  \"We played a very poor first half in Turin and that has cost us dearly. I will remember what happened in the first half there.\"\n  \n\n  Straight from kick-off the visitors seemed determined to learn from the French champions' mistakes.\n  \n\n  Allegri's men pressed high to prevent Barca dominating possession and enjoyed the better of the early chances.\n  \n\nGonzalo Higuain volleyed over from the edge of the area before only a brilliant challenge from Gerard Pique prevented Juan Cuadrado's cross providing Higuain with a tap in.\n  \n\n  Barca had to wait 19 minutes for their first clear sight of goal as they intricately worked the ball around a packed Juventus box before Messi fired inches wide.\n  \n\n  Messi then stung Gianluigi Buffon's palms for the first time on the half-hour mark.\n  \n\n  \"Overall they were the better team and deserved to go through,\" Pique told BeIN Sports Spain.\n  \n\n  \"Little-by-little we started to create chances, but they built a mountain.\"\n  \n\n  At the other end, Higuain threatened again when he just couldn't get enough power on Miralem Pjanic's dinked cross to beat Marc-Andre ter Stegen.\n  \n\n  Neymar had been Barca's hero in a remarkable finish with two goals and an assist in the final minutes against PSG.\n  \n\n  Yet, he found it far harder up against friend and former Barca teammate Dani Alves and his frustrations at a perceived lack of protection from referee Bjorn Kuipers spilled over as he was booked just before half-time.\n  \n\n  Juventus also had the first big chance of the second half as Cuadrado fired across Ter Stegen but wide of the far post.\n  \n\n  Ter Stegen was then forced to turn behind another driven effort from the Colombian.\n  \n\n  Messi was being forced to come deep in search of possession, but he briefly had Juventus hearts in mouths with a low effort that was deflected fractionally wide.\n  \n\n  Enrique forlornly turned to Paco Alcacer from the bench as the hosts played with four forwards for the final half hour.\n  \n\n  Messi had another big chance after a rare Buffon handling error from a corner, but unfortunately for Barca it fell on his right foot and the Argentine fired well over.\n  \n\n  Sergi Roberto was Barca's unlikely hero with the 95th-minute goal that sealed the 6-1 win over PSG six weeks ago.\n  \n\n  He nearly delivered another important and rare goal, but when the right-back's effort flew just wide 20 minutes from time so did Barcelona's hopes.\n  \n\n  Juventus comfortably saw out the final stages to register their eighth clean sheet in 10 Champions League games this season.\n  \n\n  And the only negative news of the night for the Bianconeri was a yellow card for Sami Khedira that will rule the German international out of the first leg of their semi-final.\n  \n", "\n\n  PARIS: Spaniard Albert Ramos dumped world number one Andy Murray out of the Monte Carlo Masters 2-6, 6-2, 7-5 on Thursday after firing back from 4-0 down in the final set to take his place in the quarter-finals.\n  \n\n  Murray, who suffered an elbow injury in March and made his return from a five-week layoff on Wednesday after a first-round bye, won the opening set in 48 minutes before losing concentration.\n  \n\n  Left-hander Ramos, ranked 24th in the world and the 15th seed, ripped through the second set in 36 minutes and refused to give up after the Scot had romped to a 4-0 advantage in the third with victory beckoning.\n  \n\n  The Spaniard won four games in a row before Murray, his serve misfiring, applied some late pressure. But Ramos was implacable as he won the next two with back-to-back breaks and served for the match.\n  \n\n  Murray saved one match point before hitting a return into the net to hand Ramos an impressive victory over his top-ranked opponent in the first European claycourt tournament of the season.\n  \n", "\n\n  KOLKATA: He was one of Mahendra Singh Dhoni's trusted lieutenants during the best days of Chennai Super Kings and not only does Suresh Raina \"miss\" his captain but also feels disappointed in the manner he was removed from Rising Pune Supergiant's captaincy.\n  \n\n  \"I was disappointed. He has done so well for the country as well as for the IPL teams. He should be respected every time. It's about not me saying, it's the world saying,\" Raina told PTI in an interview.\n  \n\n  Dhoni has so far scored only 61 runs in five games with a strike-rate of 87 and that has invited criticism from all quarters.\n  \n\n  \"Having shared the dressing room with him (for India and CSK), you know what goes through when one faces hardships. He (Dhoni) should be respected as a player. In any profession, be it as a player or a journalist, you need to be respected. Even a player, however short his career span may be, wants to earn respect.\"\n  \n\n  Asked whether it's affecting Dhoni, he said: \"I don't think. He's back among runs. Hope he will do well better after two-three matches. We have only played five matches. After sometime the picture will be clear. He should bat up the order and bat long. He's a world class finisher.\"\n  \n\n  Raina termed his eight-year stint with CSK as the \"best experience\".\n  \n\n  \"The time I spent with Chennai Super Kings will always remain special. We have won so many trophies, be it IPL or Champions League T20. When I was very young, it gave me a great learning opportunity by being among all the legends,\" Raina, who was the man-of-the-match in their maiden IPL win over Mumbai Indians in 2010, said.\n  \n\n  On a different note, Raina seemed hopeful that Virat Kohli's Indian team will be able to retain Champions Trophy won in 2013.\n  \n\n  Raina said that Kohli's aggression is his biggest plus point.\n  \n\n  \"Kohli has done really well in that department (passion and intensity). I feel he will lift the Champions Trophy for India this time. He knows how to channelise his emotion into aggression,\" Raina said.\n  \n\n  In order to get winning results, one needs to full support from the team and he has got that.\n  \n\n  \"Everyone supports him on the field. All the players like to play that way. If he starts scoring runs, I don't think anyone can stop him from winning the Champions Trophy. He has done well in Test and one-day cricket. Now it's time to go to England and do what MS did in ODIs (in 2013),\" the Champions Trophy winner said.\n  \n\n  Raina said that IPL transformed him as a player making him more assertive and positive in his approach.\n  \n\n  \"By playing IPL, I got over my hesitations. It created a positive vibe in me. Like you say cricketing instincts. You are in a good zone when you hit a bowler instinctively -- I developed that and dominated the bowlers.\"\n  \n\n  Raina has picked Kerala pacer Basil Thampi and Jharkhand batsman Ishan Kishan as two special talents who would go on to play for India.\n  \n\n  \"He (Thampi) knows what he has to do on the match day as well as in practice. He has done really well in first-class cricket. He may get a look-in into the Indian team. He works really hard.\"\n  \n\n  \"Ishan Kishan is also a very bright prospect for the Indian team. Both have done well so far. No 7 is such a crucial position, where you have pressure to finish a game. I think he has it in him. He comes from the same place as Dhoni bhai. He has played with him. I've seen him for last two years. He got a good attitude. I want him to play for India,\" Dhoni lauded Kishan.\n  \n\n  With Lions failing to replicate last year's performance where they finished table toppers, Raina said:\"This time, we made some mistakes and we are not able to get our combination right. Bravo has been out; Jadeja could not play first two matches. It's a matter of posting one big win.\"\n  \n", "\n\n  NEW DELHI: The Supreme Court on Thursday quashed a criminal complaint against former India cricket captain Mahendra Singh Dhoni by an Andhra Pradesh resident following his depiction as Lord Vishnu by a business magazine.\n  \n\n  Quashing the criminal complaint, the bench headed by Justice Dipak Misra said that the ingredients of the offence alleged in the criminal complaint amounting to hurting the religious feelings of the complainant are not made out.\n  \n\n  Another bench of the apex court had in September last year quashed an identical complaint filed by another complainant before a court in Bengaluru.\n  \n\n  In the magazine cover that was released in 2013, Dhoni - dressed up as Lord Vishnu - was seen holding several objects in his hands, including a shoe.\n  \n\n  A court in Anantapur, Andhra Pradesh had issued a non-bailable warrant against him for allegedly hurting religious sentiments.\n  \n\n  That had prompted Dhoni to approach the Supreme Court seeking quashing of the criminal proceedings against him.\n  \n", "\n\n  SYDNEY: Fast bowlers Mitchell Starc and James Pattinson were Thursday named in Australia's 15-man squad for the ICC Champions Trophy in England and Wales.\n  \n\n  Starc has recovered from a stress fracture in his right foot which sent him home from Australia's Test series in India last month, while Pattinson is fit again after serious shin and back injuries.\n  \n\n  Pattinson is currently playing for Nottinghamshire in English cricket after taking part in Victoria's Sheffield Shield championship victory in the recently finished domestic season.\n  \n\n  Selectors have boosted Australia's fast bowling stocks for the Champions Trophy with Starc, Pattinson and John Hastings joining Josh Hazlewood and Pat Cummins.\n  \n\n  \"Both James and John have made very good returns from injury and are bowling well for their respective teams... as well as both contributing well with the bat,\" chief selector Trevor Hohns said.\n  \n\n  \"When you also add Mitchell Starc, Josh Hazlewood and Pat Cummins to the fast bowling artillery it becomes a very exciting proposition for Australian cricket.\"\n  \n\n  Big-hitting Queensland batsman Chris Lynn has also been named in the squad as he returns from a third shoulder injury inside two years, while playing for the Kolkata Knight Riders in the Indian Premier League.\n  \n\n  \"Our medical staff will continue to monitor Mitchell and Chris' recovery from their respective injuries but we are hopeful they will be fit in time for the team's departure on May 18,\" Hohns said.\n  \n\n  New South Wales batting all-rounder Moises Henriques has also been recalled to the side having last played for the national one-day squad against Sri Lanka in August last year.\n  \n\n  \"Moises finished off the domestic season very well and has had a great start in the IPL,\" Hohns said.\n  \n\n  \"We believe Moises' batting has improved significantly in the past six months and he will provide us with a strong option should he be selected.\"\n  \n\n  But Tasmanian all-rounder James Faulkner was omitted from the side, with Hohns describing him as an \"unlucky omission\" after other players returned to fitness.\n  \n\n  The selected players who are in Australia will depart for England on May 18 with the remaining players in the IPL to join as their teams finish in the tournament.\n  \n\nAustralia:\nSteve Smith (capt), David Warner, Pat Cummins, Aaron Finch, John Hastings, Josh Hazlewood, Travis Head, Moises Henriques, Chris Lynn, Glenn Maxwell, James Pattinson, Mitchell Starc, Marcus Stoinis, Matthew Wade, Adam Zampa.\n  \n", "\n\n  MONACO: Teenage sensation Kylian Mbappe scored again to set Monaco on their way to a 3-1 second-leg victory over Borussia Dortmund on Wednesday that allowed them to win their Champions League quarter-final 6-3 on aggregate.\n  \n\nRadamel Falcao also netted for the home side in a whirlwind start at the Stade Louis II, and Dortmund were left with too much to do to save the tie.\n  \n\n  Their skipper Marco Reus pulled a goal back early in the second half but Valere Germain came off the bench to put the seal on a famous win for a brilliant young Monaco side, who go through to the last four for the first time since 2004.\n  \n\n  \"We are very pleased to have taken Monaco to the semi-finals. It is very important for French clubs and France,\" Falcao told beIN Sports.\n  \n\n  \"Right from the start we pressed high and scoring early on served us well.\"\n  \n\n  Meanwhile, Dortmund bow out after a tie overshadowed by the bomb attack on the team's bus last week that forced the first leg to be postponed by a day.\n  \n\n  The Germans lost that match 3-2, their minds elsewhere, but their hopes of turning the tie around in the second leg were not helped when their bus was held up on the way to the Stade Louis II, leading to a five-minute delay to the kick-off.\n  \n\n  UEFA blamed \"heavy traffic\" for the hold-up but, on their official Twitter account, Dortmund said they had been delayed in leaving their hotel by police for around 20 minutes \"without justification\".\n  \n\n  \"It was the worst thing that could happen a week after the attack -- everyone was on the bus ready to go but we were not allowed to,\" Tuchel said.\n  \n\n  \"You come into such a game trying to have a clear mind to go out and turn the tie around, but with just an hour and a quarter to go before the match we were not able to think about football at all and it wasn't ideal.\"\n  \n\n  While the appearance of Spanish defender Marc Bartra -- who needed surgery for a broken wrist suffered in last week's attack -- at the stadium was a boost to Dortmund, the delay unsettled Thomas Tuchel's side and their hopes were effectively ended in a terrible opening 20 minutes.\n  \n\n  The away defence backed off as Benjamin Mendy advanced and when the full-back's powerful left-foot strike stung the palms of goalkeeper Roman Burki, the 18-year-old Mbappe was on hand to convert the rebound.\n  \n\n  That strike meant Mbappe, who netted twice in the first leg, became the youngest player ever to reach five goals in the Champions League, beating Real Madrid great Raul by 41 days.\n  \n\nNuri Sahin cracked a free-kick off a post at the other end and Monaco survived that scare to increase their lead on 17 minutes at the end of a counter-attack.\n  \n\n  The rampaging Mendy's initial cross came back to Thomas Lemar and he held up a ball that was headed home by captain Falcao, the prolific Colombian marking his 50th appearance in European competition with his 45th goal.\n  \n\n  Like in the first leg, Tuchel's decision to start with three at the back had backfired and he changed things up before the half-hour mark, bringing on Ousmane Dembele for Erik Durm and reverting to a four-man defence.\n  \n\n  Dortmund now needed to score three times without reply just to force extra time but they did not manage to get one back until three minutes after the restart, Dembele tormenting Mendy on the right before his cutback was lashed home first-time by Reus.\n  \n\n  But it was Monaco who had the best chances to score again after that, with Burki tipping over Almamy Toure's looping header and Falcao squandering a fine chance before substitute Germain made sure of their place in the last four.\n  \n\n  He had only just come on for Mbappe when he converted Lemar's square ball with his first touch with nine minutes to go, as Monaco join Real Madrid, Atletico Madrid and Juventus in the semi-final draw.\n  \n", "\n\n  NEW DELHI: With four wins on the trot, heavyweights Mumbai Indians are the team to beat in IPL 2017 and next in their path towards the play-offs are Kings XI Punjab, who will hope to stop their impressive run while trying to stay above the basement.\n  \n\n  After defeat in their first match, Mumbai have put together an impressive streak with victories over two top teams (Kolkata Knight Riders and Sunrisers Hyderabad) and two strugglers (Royal Challengers Bangalore and Rising Pune Supergiant). Apart from coping with a very good MI bowling attack, KXIP's biggest challenge at their second home of Indore on Thursday will be to keep a superb middle order, which has scored 441 runs in five matches while repeatedly finishing matches, quiet.\n  \n\n  Punjab started the season with two wins which featured exciting unbeaten forties from their new skipper Glenn Maxwell, but after three consecutive defeats their skeptics will have plenty of reasons to write them off. Their descent started with an eight-wicket loss to KKR, followed by a 51-run loss to Delhi Daredevils and most recently a five-run defeat to SRH in which Manan Vohra's exceptional 95 took them to the doorstep of victory.\n  \n\n  Maxwell's men need to lift themselves out of the middle portion of the IPL points table, and for that their foreign players must deliver. Maxwell's last three innings have been 25, 0 and 10, David Miller has thrown away starts regularly, Hashim Amla bagged a first-ball duck in the last match and Eoin Morgan has struggled in both appearances.\n  \n\nVenue:\n  Holkar Cricket Stadium, Indore\n  \nDate:\n  April 20, 2017\n  \nTime:\n  20:00 IST\n  \nWeather:\n  A warm evening with temperatures dropping from a high of 41 to the high-20s.\n  \n\n\n    Team News:\n    \n\n\n\n    MI\n    \n\n  The management won't be inclined to tinker with a winning unit, but its time Jos Buttler converted his starts into a defining innings that underlines his power as a T20 superstar.\n  \n\nProbable XI:\n  1 Parthiv Patel (wk), 2 Jos Buttler, 3 Nitish Rana, 4 Rohit Sharma (capt), 5 Kieron Pollard, 6 Krunal Pandya, 7 Hardik Pandya, 8 Harbhajan Singh, 9 Mitchell McClenaghan, 10 Lasith Malinga, 11 Jasprit Bumrah\n  \n\n\n    KXIP\n    \n\n  Punjab have yet to play Martin Guptill or Shaun Marsh, and considering they are on the verge of desperation to stay in contention for the play-offs, it could be time to unleash one of the two at the expense of Amla and Morgan. Guptill could easily slot in as opener, while Marsh could bat at one-down or the fourth spot in place of the struggling Morgan. Seam bowler Anureet Singh - a consistent performer for KXIP over the past few seasons - should also be seriously considered to bolster a flagging attack.\n  \n\nProbable XI:\n  1 Hashim Amla/Martin Guptill, 2 Manan Vohra, 3 Glenn Maxwell (capt), 4 Eoin Morgan/Shaun Marsh, 5 David Miller, 6 Wriddhiman Saha (wk), 7 Axar Patel, 8 Mohit Sharma, 9 Ishant Sharma, 10 Sandeep Sharma, 11 Anureet Singh\n  \n\n\n    Stats\n  \n\n-\n  KXIP have three batsmen to cross 100 runs, but only two have scored fifties.\n  \n\n-\n  Morgan has taken the most catches in an innings - three.\n  \n\n-\n  The most extras conceded in an innings - 16 - has been by KXIP.\n  \n\n-\n  Each of Rohit Sharma's four dismissals this season has been to spinners.\n  \n\nHead to Head record:\n  9-9\n  \n\n\n    Quotes\n  \n\n  \"Every win is important against whichever team. We don't play the opposition, we play the team. A lot of credit to the players - each and everybody. To have four consecutive wins is never easy.\" - Rohit Sharma\n  \n\n  \"I got a great opportunity to finish the game, but I couldn't do that, so I am pretty sad about this.\" - Manan Vohra\n  \n", "\n\n  RAJKOT: It had been in the pipeline for a while now, but kept getting delayed due to his indifferent form and lack on patience on the part of the of the Royal Challengers Bangalore team management.\n  \n\n  When IPL 10 began, Chris Gayle was just 67 runs short of becoming the first batsman to score 10,000 runs in T20 cricket. After he put together scores of 32, 6 and 22 in three out of the five games that the RCB played this season, the \"Universe Boss\" needed only three to reach the unique, unbelievable landmark, but the big Jamaican wasn't sure of a place in the XI when his team took on the Gujarat Lions at the SCA Stadium here on Wednesday night.\n  \n\n  History, however, is often built on mishaps. On the eve of the game, Bangalore suffered a big blow when AB de Villiers was ruled out due to a back injury. It meant Gayle had the chance to cross the rare milestone, which was now in his sniffing distance, and the ever-smiling Caribbean wasn't going to miss out.\n  \n\n  He got to the 10,000-run mark in singles, and then celebrated the occasion in grand style. Exploding like only he can, the 37-year-old smoked seven huge sixes and five fours while blasting 77 of 38 balls to show how he's still the \"biggest weapon of mass destruction\" in this format.\n  \n\n  Riding on his blazing return to form, RCB devoured the Lions in their own den and raced away to 213 for two, the highest score in IPL 2017 so far, after being put in. Fired by a brilliant, fighting 72 (7x6, 2x4) from Kiwi great Brendon McCullum, Gujarat were later provided a faint hope by talented youngster Ishan Kishan (39, 16b, 2x4, 4x6), who came up with some lusty blows towards the end, but the hosts eventually fell short by 21 runs to finish at 192 for seven in a high-scoring game.\n  \n\n  The win ended RCB's unwanted sequence of three defeats on the trot and move up from the bottom of the table, while ironically pushing the Lions to the last spot.\n  \n\n  Before he was finally out lbw to a Basil Thampi yorker, Gayle added 122 for the first wicket with skipper Virat Kohli, who seemed content to enjoy the 'Gayle storm' from the best seat in the house the nonstriker's end.\n  \n\n  Later, Kedar Jadhav (38,16b, 5x4, 2x6), and Travis Head (30, 16b, 2x4, 1x6) added 54 in 25 balls to provide the ideal finishing touches to the RCB innings, while showing that the visitors meant business. Nothing, though, came near to the kind of entertainment Gayle dished out.\n  \n\n  At one point, though, the 'Gayle Show' threated to get over just when it was in full flow. The left-hander looked like he was stunningly caught at the long off boundary by a diving McCullum, before replays suggested that the Kiwi's floppy hat may have touched the rope while taking the catch.\n  \n\n  It ultimately turned out to be the final six of a Ravindra Jadeja over in which the left-arm spinner ended up being thrashed for 4,4,6 and 6 off his final four balls by the Gayle.\n  \n\n  The India all-rounder seems to be struggling to find his form in the IPL. Bowling too flat and fast, he ended up conceding 57 runs off four overs. The all-rounder's miserable night was complete when he was run out in a mix-up with Kishan.\n  \n\n", "\n\n  Fantastic display of batting prowess by Mumbai Indians helped them register a thumping eight-wicket victory over Kings XI Punjab in Match 22 of the Indian Premier League season 10 at the Holkar Stadium, Indore on Thursday. MI chased down a target of 199 with over four overs remaining. Jos Buttler (77) and Parthiv Patel (37) started the assault helping Mumbai to their best ever powerplay score (82/1) before Nitish Rana joined the fray with a 34-ball 62-run knock. KXIP bowling was lacklustre and they failed to carry on the good work done by the batsmen, Hashim Amla in particular, who scored a brilliant 104 not out off 60 balls that helped KXIP post 198 for four.\n  \n\n  We breakdown the match in five:\n  \n\nAmla, Marsh start off well\n\n\n  Playing his first game of the season at the expense of an unwell Manan Vohra, Shaun Marsh showed glimpses of his immaculate strokeplay cracking five boundaries en route to 26 off just 21 balls. Hashim Amla was slow to start but picked up the pace cracking Lasith Malinga for a six. When Marsh was scalped by Mitchell McClenaghan in the sixth over, KXIP had scored 46. Wriddhiman Saha, who came to bat at number three failed to get going and was picked up by Krunal Pandya for 10 off 15 balls. Amla by that time had moved on to 40 off 30 deliveries.\n  \n\nMaxwell goes bonkers\n\n\n  Fall of Saha brought to the crease KXIP skipper Glenn Maxwell and the Australian started off well taking two consecutive boundaries off Jasprit Bumrah to make his intentions clear. Off the 16th over, bowled by McClenaghan, Maxwell went on an all out assault with three sixes and two fours, taking 28 runs off the over - second-most expensive over of the season. Amla then upped the ante taking Malinga to the cleaners with two sixes and two fours helping himself to a 34-ball 50 in the process.\n  \n\nAmla finishes off in style\n\n\n  Maxwell was undone by a slower one from Bumrah, but Amla had his eyes set for a final flourish and the South African hit Malinga for two sixes in the final over. He reached his first triple-figure mark in the format off just 58 balls - more importantly he accelerated well taking only 24 balls to go from 50 to 100. KXIP ended with 198/4\n  \n\nParthiv, Buttler put KXIP bowlers to the sword\n\n\n  In reply, Mumbai had to start well and Jos Buttler ensured that hitting Sandeep Sharma for a six in the first over. Ishant was meted out with a similar treatment with Buttler taking him for two fours in the second over. Runs continued to flow as Ishant Sharma went on to concede 17 runs off his second over while Sandeep Sharma leaked 13. Maxwell threw the ball to the third Sharma, Mohit, and he too was taken to the cleaners by Parthiv. By the end of powerplay overs, Mumbai had posted 82 for 1 - their best powerplay score in IPL. Parthiv was undone by a slower one from Marcus Stoinis and departed for 37.\n  \n\nRana adds finishing touches\n\n\n  Buttler continued his assault and finally managed to convert his good start in to something substantial. With powerful strikes down the ground and spectacular aerial shots, Buttler reached his half-century off just 24 balls, striking the ball at 208.3. One down Nitish Rana then got in to the act with a six off Axar Patel. By the end of 10 overs, Mumbai had scored 123/1, their best ever score at the halfway mark. Whatever bowling changes Maxwell made didn't work as Rana and Buttler put every KXIP bowler to the sword. Buttler perished to Mohit Sharma but not before registering his highest T20 score. Rana and Hardik Pandya (15) then added the finishing touches with Rana scoring his third fifty of the season and he went on to regain the Orange Cap. Mumbai overhauled the target with eight wickets in hand and 27 balls to spare.\n  \n\n", "\n\n  NEW DELHI: In his comeback to competitive badminton after a three-month absence, 2014 Commonwealth Games gold medalist Parupalli Kashyap has beaten Thailand's Suppanyu Avihingsanon 21-16, 21-17 to enter the last 16 of the 2017 China Grand Prix Gold.\n  \n\n  Kashyap, whose men's singles ranking has fallen to 104 in the time that he was forced out of action owing to a knee injury sustained earlier this year, took the lead in the first game before his opponent leveled the scores briefly at 15-15, but Kashyap pulled away to take it 21-16.\n  \n\n  In the second game, Avihingsanon led 14-12 before Kashyap fought back to make it 18-13, which then became 18-17 as a heated encounter intensified. Kashyap, however, held his nerve to make overcome Avihingsanon's spirited opposition.\n  \n\n  In January, Kashyap - a protege of All-England champion Pullela Gopichand - had injured himself while falling on the court during the Premier Badminton League final between winners Chennai Smashers and Mumbai Rockets, which ruled him out of action until the ongoing Grand Prix Gold tournament. The 30-year-old had got a bye in the first round and faced world No 59 Avihingsanon, whom he had lost to in their only previous encounter, in round two.\n  \n\n  Also progressing past round two of the tournament was 20-year-old Harsheel Dani, who defeated China's Yan Runze in straight games 21-16, 22-20 on Wednesday. Ranked 102 in men's singles, Dani had beaten the world No 113 Chun-Wei Chen 21-17, 21-18 a day earlier.\n  \n\n  In the women's singles, Sri Krishna Priya Kudaravalli lost to Li Yun 18-21, 11-21 and Sai Uttejitha Rao Chukka was beaten by Li Wenmei 21-4, 13-21, 21-12 to exit the competition.\n  \n\n  Most of India's major badminton players have skipped the China Grand Prix Gold in order to focus on next week's Badminton Asia Championships (Individuals).\n  \n", "\n\n  HYDERABAD: India's star shuttler PV Sindhu is focusing on coming championships and aims to give her best to achieve her ultimate goal -- becoming World No. 1.\n  \n\n  After winning the Indian Open Super Series early this month, she was almost there, with a career-best ranking of World No. 2.\n  \n\n  The 2016 Olympic silver medallist, however, slipped to fifth place last week following a first-round exit from the Malaysian Open. She also lost in the quarter-final of the Singapore Open Super Series.\n  \n\n  The double World Championship bronze medallist, however, is not disappointed. \"Winning or losing is part of life. Sometimes you will win, sometimes you will lose,\" she said.\n  \n\n  The 21-year-old Hyderabadi also doesn't want to put extra pressure on herself by bothering too much about rankings.\n  \n\n  \"If you play well and give your best, it automatically gets your ranking up,\" said Sindhu.\n  \n\n  She is now focusing on Asia Badminton Championships to be played in China between April 25 and 30. \"After that we have the Sudirman cup in May,\" said Sindhu, who hopes to do well in the two events.\n  \n\n  Sindhu, who defeated Spaniard Carolina Marin in the Indian Open final, lost 11-21, 15-21 to her arch-rival in the quarter-final of Singapore Open.\n  \n\n  With this win, two-time reigning world champion Marin has taken a 6-5 lead over the Indian in career meetings.\n  \n\n  The two had been facing each other in key contests since Sindhu lost to her in Rio Olympics final.\n  \n\n  Sindhu had avenged her defeat at Rio by beating the Spaniard in the Dubai Super Series final last year.\n  \n\n  \"I have beaten her sometimes, I have lost to her sometimes. It's all part of the game,\" said Sindhu.\n  \n\n  She said off-court they were just normal friends. \"On-court we fight each other because only one can win,\" she said.\n  \n\n  The first Indian woman to win a silver medal at the Olympics, Sindhu also achieved another milestone last year by bagging her maiden Super Series Premier title when she won China Open. It was the only trophy missing from her cabinet.\n  \n\n  The series of wins helped Sindhu become only the second Indian woman after her illustrious city mate Saina Nehwal to break into the top five of the world ranking.\n  \n", "\n\n  RAJKOT: Swashbuckling West Indies opener Chris Gayle described it as a \"special occasion\" to become the first cricketer to score 10,000 runs in Twenty20 cricket.\n  \n\n\nIPL 2017: RCB’s Chris Gayle first to 10,000 runs in T20 cricketChris Gayle has become the first batsman in the world to reach the landmark of 10,000 runs in Twenty20 cricket. The big-hitting West Indian achieved the feat during his ongoing innings for Royal Challengers Bangalore in game 20 of IPL 2017 versus Gujarat Lions\n\n\n  The self-proclaimed \"Universe-Boss\" Gayle also warned his rival IPL teams, saying he is still here and alive after he returned to form with a smashing 77 against Gujarat Lions to guide RCB to 21-run win.\n  \n\n  \"I like that name(Universe-Boss). Fans want to watch Chris Gayle, it's been fantastic. A special occasion to reach 10000 runs. People still looking out for Chris Gayle. The Universe-Boss is still here and still alive,\" said Gayle, who was adjudged the Man of the Match.\n  \n\n\n\n\nWATCH: @henrygayle - The Universe Boss of T20 cricket https://t.co/uNhnjpezCc\n        — TOI Sports (@toisports)\n        1492574978000\n\n\n\n\n  Talking about his stance, Gayle said: \"A lot of guys spoke to me about my stance. Even Shaun Pollock spoke to me about my stance. You're never too old to learn.\"\n  \n\n  RCB skipper Virat Kohli said he is fit and the shoulder injury is not bothering him.\n  \n\n  \"There's a lot of strapping on the shoulder, not getting to my head anymore, shoulder fit and fine. Happy to get those two points,\" he said.\n  \n\n  Lavishing praise on Gayle for his superb innings, Kohli said: \"Chris took his opportunity beautifully. He batting like that allows me to bat through the innings, and I can chip my way out. We thought we were 30 runs above par.\"\n  \n\n  The spinners - Yuzvendra Chahal (3/31) and Pawan Negi (1/21) played a pivotal role in the 21-run win and Kohli showered accolades on the duo.\n  \n\n  \"Negi was outstanding, very brave, not getting scared. Not many people believe in his abilities. Chahal is not scared, his biggest plus point is he always wants to take wickets,\" he said.\n  \n\n  Gujarat skipper Suresh Raina blamed the bowlers for giving away too many runs but praised his batsmen for batting well while chasing 214 to win.\n  \n\n  \"We played well, we batted well. 200 was chaseable. More than 200 is difficult to chase,\" Raina said.\n  \n\n  \"Our bowling giving too many runs. They (bowlers) have to vary their pace, bowl slow. It's a worry for us, the spin department,\" he added.\n  \n", "\n\n  KOLKATA: West Indies' World T20-winning allrounder Dwayne Bravo is mighty impressed with uncapped Kerala speedster Basil Thampi, saying he could soon represent India.\n  \n\n  Both Bravo and Thampi are turning out for Gujarat Lions in the ongoing Indian Premier League.\n  \n\n  \"Basil Thampi is a very, very talented youngster. I would say he will get the opportunity to play for Team India in a year or so. He has the talent, obviously, but he also has a lot of heart, pace and the skill. He's always willing to learn,\" Bravo told PTI on Wednesday.\n  \n\n  During Gujarat Lions' match against Mumbai Indians, the tall pacer impressed everyone by consistently bowling yorkers.\n  \n\n  On Tuesday, when Royal Challengers Bangalore took the Gujarat Lions attack to the cleaners, Thampi returned economical figures of 1/31 and bowled the maximum (11) dot balls.\n  \n\n  Thampi's maiden IPL wicket came in the form of Chris Gayle, after the opener had smashed a 38-ball 77. The bowler set it up with a yorker and trapped him next ball with another full-length delivery.\n  \n\n  An excited Bravo, who is recovering from a hamstring injury, went straight to the Kerala pacer and said he would like to take him under his wings.\n  \n\n  \"He's willing to learn. He asks the right questions. I think India cricket is in right direction when you have someone like him.\n  \n\n  \"Bowling 140-plus, like Indian speedsters Umesh Yadav, Mohammad Shami, Thampi has the skill and is really good. I really wish him all the best from the bottom of my heart.\"\n  \n\n  Bravo is ever ready to offer tips to the 23-year-old.\n  \n\n  \"I follow him very closely, I try to give him a lot of confidence and experience, explain to him, break down the game to him. He's still in a learning phase.\n  \n\n  \"He has the raw natural talent and ability. It's a matter of playing more games, give him more experience and exposure.\"\n  \n\n  Talking about himself, Bravo has said he's \"a game or two away\" from returning to action.\n  \n\n  Bravo had taken 17 wickets from 15 matches last season and his absence is hurting the team, which is struggling at the bottom of the table with just a win from five matches.\n  \n", "\n\n  MADRID: Cristiano Ronaldo scored a controversial hat-trick to become the first man to reach 100 Champions League goals as Real Madrid overcame 10-man Bayern Munich 4-2 after extra time in Tuesday's thrilling quarter-final second leg.\n  \n\n  The holders surged through 6-3 on aggregate at an exhilarated Santiago Bernabeu to take their place in Friday's semi-final draw for a record seventh consecutive year.\n  \n\n\n\n\nWATCH: #ChampionsLeague @Cristiano first to 100 @ChampionsLeague goals #RONALDO100 ⚽️ https://t.co/1hQVnS7gzD\n        — TOI Sports (@toisports)\n        1492578627000\n\n\n\n\n  But Real were pushed all the way by Bayern, who battled back from a 2-1 first-leg deficit to send the tie into extra time thanks to Robert Lewandowski's penalty and an own goal from Sergio Ramos.\n  \n\n  However, after Arturo Vidal was sent off, Ronaldo hit the century mark in Europe's top club competition on 104 minutes and completed his hat-trick five minutes later.\n  \n\n  Bayern were left incensed, though, as Ronaldo's second and third goals were clearly offside.\n  \n\n\n\n\n💯 UEFA Champions League goals! ANOTHER RECORD for @realmadrid's incredible @Cristiano Ronaldo. 👏👏👏 #UCL https://t.co/lwoR2wzldr\n        — Champions League (@ChampionsLeague)\n        1492551425000\n\n\n\n\n  \"To score six goals against a team like Bayern Munich isn't easy so we deserved to go through,\" the Portuguese striker told Spanish TV station Antena 3.\n  \n\n  \"Real Madrid is Real Madrid, we are used to suffering and we are happy to be in the semis once again.\"\n  \n\n  Marco Asensio gave a night of high-class action the finale it deserved with a sensational solo goal to rub salt in Bayern wounds.\n  \n\n  \"The (red) card for Arturo wasn't a card and then the two goals from Cristiano are offside so clearly we are not happy,\" said Bayern coach Carlo Ancelotti.\n  \n\n  \"In a quarter-final you have to put a better referee, or it is the moment to introduce video refereeing, which is what UEFA are trying because there are too many errors.\"\n  \n\n  The German champions had been beaten on their previous four trips to Spain without even scoring a goal.\n  \n\n  However, knowing they needed at least two to progress, Ancelotti's men started on the front foot and were left to rue a huge opportunity just eight minutes in.\n  \n\n  Marcelo made a miraculous block to deny Thiago Alcantara before former Real winger Arjen Robben scuffed into the side-netting on his trusted left foot.\n  \n\n  Much like the first leg, Madrid weathered the early storm and had plenty of chances to go in front before half time.\n  \n\n  Jerome Boateng bailed out a rare mistake from goalkeeper Manuel Neuer as he cleared off the line from Ramos after Neuer fumbled a simple cross.\n  \n\n  The half-time whistle brought some respite to proceedings on the field, although the Bayern fans were involved in a minor clash with police at the break.\n  \n\n  The disturbances quickly died down and Bayern soon gave the travelling 4,000 from Germany something to cheer when play resumed.\n  \n\n  Another goal-line clearance by Marcelo from Robben's dinked effort temporarily saved Madrid.\n  \n\n  But the hosts didn't escape moments later when referee Viktor Kassai pointed to the spot as Robben went down under a challenge from Casemiro.\n  \n\n  Lewandowski stayed cool under the pressure and converted from the spot for his 39th goal of the season.\n  \n\n  Ronaldo looked to have eased Madrid's nerves when he steered Casemiro's cross into the far corner 14 minutes from time.\n  \n\n  However, Real's celebrations were very short-lived as just a minute later the ball ricocheted around their box and Ramos turned into his own net.\n  \n\n  The balance of a topsy-turvy tie turned Madrid's way again with five minutes remaining as just as in the first leg, Bayern were reduced to 10 men when Vidal saw a second yellow card for chopping down Asensio.\n  \n\n  The extra man proved decisive as Madrid settled the tie with a three-goal burst either side of half time in extra time.\n  \n\n  Ronaldo took advantage at not being flagged for offside as he controlled and fired low past Neuer to become the first man to reach a Champions League century.\n  \n\n  Four minutes into the second period of extra time he had Marcelo to thank for a brilliant run and unselfish pass that allowed the Portuguese the simplest of finishes to complete his hat-trick despite again being in an offside position.\n  \n\n  And Asensio sealed victory in sensational style with a stunning solo run and low right-footed finish as many Bayern players sank to their knees knowing Champions League glory had passed them by for another year.\n  \n"]