["\n\n  In what can surely be termed the biggest price cut ever by smartphone giant Apple in India, the company has slashed the prices of its smartphones by as much as Rs 22,000. Apple iPhone 6S (128GB), which carries an MRP of Rs 82,000 so far, will now be available at an MRP of Rs 60,000 after a price drop of Rs 22,000.\n  \n\n  The bigger-screen variant of iPhone 6s, iPhone 6s Plus (128GB) will now be available at an MRP of Rs 70,000. The smartphone too has recieved a price cut of Rs 22,000.\n  \n\nApple\n  's 4-inch smartphone iPhone SE, launched earlier this year, too has got a price cut. The 64GB version of iPhone SE, currently sporting a price tag of Rs 49,000 will now be available at Rs 44,000.\n  \n\n\n\n‘Water-resistant’ Apple iPhone 7 not covered under warranty for ‘Liquid Damage’This is quite surprising as both iPhone 7 and iPhone 7 Plus are water-resistant,’ and customers are likely to use them in humid conditions.\n\n\n\n  The price cuts come as the India launch of the company's latest iPhones -- iPhone 7 and iPhone 7 Plus -- nears. Apple will launch the new iPhones in India on October 7. Though\n  Apple\n  has not yet officially started the pre-orders for the two phones, several resellers of the company like IWorld have already started accepting the pre-bookings for the device.\n  \n\n  Apple launched iPhone 6s and iPhone 6s Plus in India in October last year. The Apple\n  iPhone\n  6s (16GB) launched at a price of Rs 62,000, while iPhone 6s Plus (16GB) had an MRP of Rs 72,000.\n  \n\n\nStrong iPhone 7 pre-orders from AT&T, Sprint help Apple shares soarUS wireless carriers Sprint Corp and T-Mobile US Inc said on Tuesday they received strong pre-orders for Apple Inc's iPhone 7, sending shares of the world's most valuable listed company up 3%.\n\n\n\n  Both the\n  iPhones\n  come with 3D Touch and 2GB RAM. Both iPhone 6s and 6s Plus sport 12-megapixel iSight camera, capable of shooting 4K videos. The front FaceTime camera is 5-megapixels.\n  \n\n  Both iPhone 6s and iPhone 6s Plus feature faster-second-generation\n  TouchID\n  sensor and are made of tough aircraft grade aluminium, same as Samsung Galaxy S6 and S6 edge. Under the hood is the new 64-bit A9 chipset that is 70% faster at carrying out processes than the one seen in iPhone 6 and iPhone 6 Plus. Similarly, the graphics processing too is said to have jumped 90% aided by a new graphics processor versus previous-generation models.\n  \n\n  Apple officially launched iPhone SE in India in April. The\n  smartphone\n  comes in two variants -- 32GB and 64GB. iPhone SE sports a 4-inch LED-backlit IPS LCD display with a resolution of 640 x 1136 pixels. It is powered by Apple A9 chipset with M9 motion co-processor. Other specifications of the device are 12MP rear camera and Touch ID. It will be available in Silver, Gray, Gold, Rose Gold colours. The smartphone will be available in the country in April.\n  \n\n\nRead this story in Malayalam\n\n\n\nRead this story in Marathi\n\n\n", "\n\n  What's keeping you from buying that smartphone you had set your eyes on for ages? If you're a student or a young professional, chances are that you simply don't have enough to spare for the buy . While the former does not have regular channels of income, the latter may struggle to save enough after paying the bills. A convenient solution is to pay it off in EMIs. However, this is easier said than done, since bank loans come with their own set of conditions and in-store EMI schemes require credit cards and offer only limited options in terms of inventory .\n  \n\nFinomena, a startup with a unique system of verification and loan approval, offers an alternative. It is a customer-experience driven fintech platform that enables inclusion by offering easy access to credit for people who have never taken a loan before, and hence do not have a credit score.Moreover, it allows you to register online and simply browse ecommerce sites and choose the gadget you want.After that you can choose from the financing and EMI options and apply with a single click.\n  \n\nBanked but not eligible\n\n  The phrase 'financial inclusion' evokes the idea of a section of people without access to basic banking services. This is why one of the government's primary initiatives in facilitating financial inclusion has been to open bank accounts through the Jan Dhan Yojana. However, a bank account alone does not ensure access to credit. A section that gets largely left out in terms of access to loans and credit cards, despite holding bank accounts, includes students, young professionals and the self-employed.More than 75% of Indians do not have a traditional credit bureau score.\n  \n\n  \"We cannot rely too much on traditional models to gauge the credit score of a potential client as traditional data for these people doesn't exist.They might not have traditional income proof but with the power of a smartphone, they are leaving a massive digital footprint,\" says Abhishek Garg, cofounder, Finomena. The platform uses this big data to create machine learning-based risk and credit scoring systems that take into account over 20,000 data points to assess the credit worthiness of a borrower.\n  \n\n  Shashank Singh, 26, may be a lawyer at the Delhi High Court, but securing a loan from a bank was nearly impossible. \"As an advocate, my income fluctuates month to month , which is why banks are reluctant to issue credit cards to me or approve my loan applications,\" he says. When he wanted to purchase an iPhone 6S, Singh approached several banks for a loan, but was turned down each time. He started looking for alternatives and chanced upon Finomena. \"They had a one-on-one conversation with me about their processes, and sent someone to pick up the documents from my home. My loan was approved within a day,\" says Singh.\n  \n\nWhat's in a credit score?\n\n  A credit score is a three digit numeric summary of your entire credit history. It is prepared based on the information provided in your Credit Information Report. The credit score normally ranges between 300 and 900.Most banks and financial institutions rely on this figure to determine the credit worthiness of potential bor rowers. In fact, 79% of the loans approved are for individuals with a score over 750.\n  \n\n  However, this is a setback for the young unbanked population since they may not have a credit score at all, resulting in a vicious cycle.Finomena's founders, Riddhi Mittal and Abhishek Garg, did extensive research about loan disbursal mechanisms and the demographic of borrowers, which revealed that most banks and NBFCs steer clear of the students and young professionals because traditional modes of KYC data collection don't work for them. \"Most of our customers are in their first jobs, or self-employed with no traditional proof,\" says Mittal.\n  \n\nSpee\nd, convenience and flexibility\n\n  While there are a few options available to customers for buying high-end gadgets on an EMI basis, they often have hidden clauses. In-store EMI programmes require the customer to have a credit card. However, less than 2% Indians are credit card holders.These schemes also have set tenures and EMI amounts payable by the customer. Finomena has taken it one step further by introducing FMIs or flexible monthly installments.\n  \n\n  Viren Makwana, an IT student who also has a part-time job, was pleasantly surprised to learn that he could choose the down-payment amount, as well as how much he wanted to pay each month for buying a laptop.\n  \n\n  The 21-year-old settled for a monthly payment of Rs 2,000 to pay off the loan over a 12-month period.\n  \n\n  \"Initially I didn't believe that online EMIs were possible, but once I spoke to a Finomena representative, I was reassured that the process would work,\" he says.\n  \n\n", "\n\n  NEW DELHI: Anil Ambani-led Reliance Communications today agreed to merge its wireless\n  telecom\n  business with smaller rival Aircel to create the country's 4th-biggest mobile phone operator with asset base of more than Rs 65,000 crore.\n  \n\n  In the largest consolidation in the country's telecom sector, RCom and Aircel's majority owner, Malaysia's Maxis Communications Berhad (MCB), announced signing of definitive documents for the merger of their Indian wireless businesses.\n  \n\n  RCom and\n  Aircel\n  will hold 50 per cent each in the new company. The board of the new company will have equal representation from the two sides.\n  \n\n\nRCom offering 300 minutes of app-to-app calls for just Re 1RCom will offer about 7MB of data per day under the scheme, which, according to the company, is enough for about 10 minutes of app-to-app calls per day. This data can also be used for browsing.\n\n\n  \"The RCom-Aircel combination will create a strong operator clearly ranked amongst India's top 4 telcos by customer base and revenues, also ranking amongst the top three operators by revenues in 12 important circles,\" both the firms said in a joint statement.\n  \n\n  RCom is India's 4th-biggest telecom operator with almost 110 million customers, while Aircel ranks fifth with 84 million subscribers.\n  \n\n  RCom had 9.8 per cent market share while Aircel had 8.5% share. Sistema, which RCom earlier merged with, had 0.7% share.\n  \n\n  Both the\n  companies\n  will transfer Rs 14,000 crore of debt each to the joint venture, taking the total debt of the new company to Rs 28,000 crore, excluding Rs 6,000 crore of spectrum payment liability.\n  \n\n  The deal will help RCom pare its debt by Rs 20,000 crore (or 40 per cent of the total debt on its books).\n  \n\n  \"RCom will continue to own and operate its high growth businesses in the domestic and global\n  enterprise\n  space, Data Centres, optic fibre and related telecom infrastructure, besides owning valuable real estate,\" the statement said.\n  \n\n  MTS (Sistema) will continue to hold 10 per cent stake in RCom, with no presence on the board.\n  \n", "\n\n  NEW DELHI: Apple has revealed the\n  iPhone 7 Plus\n  and iPhone 7 model prices in India. The company has also revealed the prices of 32GB storage version of the iPhone 6s and iPhone 6s Plus in the country.\n  \n\n  The iPhone 7 Plus 32GB, 128GB and 256GB will cost Rs 72,000, Rs 82,000 and Rs 92,000 respectively, while the iPhone 7 32GB, 128GB and 256GB will be priced at Rs 60,000, Rs 70,000 and Rs 80,000 respectively. The iPhone 6s Plus 32GB version costs Rs 60,000 and the iPhone 6s 32GB storage variant costs Rs 50,000.\n  \n\n  The iPhone 6s and the iPhone 6s Plus 128GB variants are priced at Rs 60,000 and Rs 70,000 respectively. As for the iPhone SE, the 16GB version costs Rs 39,000, while the 64GB version costs Rs 44,000.\n  \n\n\nApple iPhone 7, iPhone 7 Plus available for pre-orders in IndiaAll those Apple fans out there in India waiting desperately to lay there hands on the next iPhones -- iPhone 7 and iPhone 7 Plus -- can now pre-order the new smartphones.\n\n\n  It is worth noting that the iPhone 6s 128GB previously carried a price tag of Rs Rs 82,000 and has received a price cut of Rs 22,000. The iPhone 6s Plus 128GB version also got a price cut of Rs 22,000.\n  \n\n  The price cuts come as the India launch of the company's latest iPhones --\n  iPhone 7 and iPhone 7 Plus\n  -- nears. Apple will launch the new iPhones in India on October 7. Though Apple has not yet officially started the pre-orders for the two phones, several resellers of the company like IWorld have already started accepting the pre-bookings for the device.\n  \n\n\n\n  Apple launched iPhone 6s and iPhone 6s Plus in India in October last year. The Apple iPhone6s (16GB) launched at a price of Rs 62,000, while iPhone 6s Plus (16GB) had an MRP of Rs 72,000.\n  \n\n\nApple iPhone 7, iPhone 7 Plus battery capacity detailedDuring the launch event, Apple claimed that the batteries in the iPhone 7 and iPhone 7 Plus provide these devices the longest battery backup among all the iPhones ever launched.\n\n\n  Both the iPhones come with 3D Touch and 2GB RAM. Both iPhone 6s and 6s Plus sport 12-megapixel iSight camera, capable of shooting 4K videos. The front FaceTime camera is 5-megapixels.\n  \n\n  Both iPhone 6s and iPhone 6s Plus feature faster-second-generation TouchID sensor and are made of tough aircraft grade aluminium, same as Samsung Galaxy S6 and S6 edge. Under the hood is the new 64-bit A9 chipset that is 70% faster at carrying out processes than the one seen in iPhone 6 and iPhone 6 Plus. Similarly, the graphics processing too is said to have jumped 90% aided by a new graphics processor versus previous-generation models.\n  \n\n\nApple has a warning for its usersApple is warning consumers about scam artists who pressure their victims into transferring money by purchasing iTunes gift cards after the fraudsters spin a bogus story about unpaid bills or a relative who needs bailing out of jail.\n\n\n  Apple officially launched iPhone SE in India in April. The smartphone comes in two variants -- 32GB and 64GB. iPhone SE sports a 4-inch LED-backlit IPS LCD display with a resolution of 640 x 1136 pixels. It is powered by Apple A9 chipset with M9 motion co-processor. Other specifications of the device are 12MP rear camera and Touch ID. It will be available in Silver, Gray, Gold, Rose Gold colours. The smartphone will be available in the country in April.\n  \n", "\n\n  NEW DELHI:\n  Facebook\n  has launched its Groups Discover feature for users in India. The feature lets users browse through groups divided into 25 categories such as parenting, sports, food, buy & sell and more. Each topic page highlights the top suggested groups, based on popularity and group members that users might already know.\n  \n\n  The groups are recommended to users on the basis of their location, interests or whether their Facebook friends are already members\n  \n\n  Facebook's Discover Groups tool will be rolled out to users as an update to both iOS and\n  Android\n  apps of the social network, and is already available on the website. After US and UK, India is the third country where Facebook has rolled out this feature. Interestingly, the feature is not yet available on the Facebook Groups app.\n  \n\n\nYour Facebook News Feed is set to change againFacebook said Friday it is further automating its \"trending\" stories feature, a move that will scale back human input to prevent personal bias from influencing which stories get highlighted.\n\n\n  Facebook has also added some other features to its Groups. It now allows users to directly reply to specific comments. They can also drag-and-drop files for attaching them easily.\n  \n\n  The company revealed that over 1 billion people use Facebook Groups every month. In India, over 80 million people use Groups each month.\n  \n\n  Global product manager for\n  Facebook\n  Groups, Adit Vaidya said that Facebook Groups is an ad-free feature and the company has no intentions of monetizing it as of now.\n  \n\n  Facebook held a media conference in New Delhi, emphasizing how this feature is helping diverse groups of women across the country get in touch. Facebook also shared two very interesting stories of women groups, including a group of women that came together to crochet the world's largest blanket.\n  \n\n  Recently, reports suggested that only 24% of Facebook users in India are female. Last year, the social network's India userbase touched 125 million, making the country its second largest market globally.\n  \n", "\n\n  All those Apple fans out there in India waiting desperately to lay there hands on the next iPhones -- iPhone 7 and iPhone 7 Plus -- can now pre-order the new smartphones.\n  \n\n  Most IWorld stores, Apple's Premium Resellers in Northern India, are accepting pre-bookings for Apple's new iPhones. Users can also pre-book (reserve to buy in store) the devices on the company's website. Another Apple Premium Partner in India, Unicorn, too is accepting pre-orders for the two new iPhones. Interested buyers can pre-book the smartphones after paying an advance payment of Rs 5,000. Delhi-based Unicorn has presence across several states in the country.\n  \n\n  However, two of the biggest consumer electronics retail stores in the country, Tata Group's Croma and Reliance Industry's Reliance Digital, are still to start pre-bookings for both the smartphones. Another prominent electronic retail store in the country Jumbo said that it will accept pre-orders starting next week.\n  \n\n  Officially too, Apple India is yet to announce the opening of pre-bookings for iPhone 7 and iPhone 7 Plus.\n  \n\n  Also, while Beetel Teletech Ltd, one of the distributors for Apple in India, said that it will start deliveries of the two phones at 7pm on October 7, sales person at both IWorld and Unicorn said that there stores will start selling the smartphones at dot 12 am on October 7. Another Apple distributor Rashi Peripherals too has announced that it will start selling the latest iPhones from October 7 in India. The company, however, has so far not disclosed the time when it will start sales at its 1,000 locations across the country.\n  \n\n  October 7 is the official launch date of the upcoming Apple smartphones for India. The company is launching the devices in India in the third phase. In the first phase, the new iPhones will go on sale in 28 countries across the world on September 16. In the second phase, beginning September 23, the duo will be available in over 25 countries including Andorra, Bahrain, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Estonia, Greece, Greenland, Guernsey, Hungary, Iceland, Isle of Man, Jersey, Kosovo, Kuwait, Latvia, Liechtenstein, Lithuania, Maldives, Malta, Monaco, Poland, Qatar, Romania, Russia, Saudi Arabia, Slovakia and Slovenia.\n  \n\n  Apple unveiled its latest iPhones at an even in San Francisco on September 7. The smartphone giant has not yet revealed the complete pricing details of its new smartphones in India. The company, however, just said that the price of the iPhones will start at Rs 60,000 in the country. This is likely to be the price of the base iPhone 7 model with 32GB internal storage.\n  \n\n  The iPhone 7 and iPhone 7 Plus come in 32GB, 128GB and 256GB storage variants. The colour options available are Silver, Gold, Rose Gold, Black and Jet Black. Of these, the Jet Black colour variant comes only in 128GB and 256GB variants.\n  \n\n  Apple iPhone 7 features a 4.7-inch display with 3D touch, whereas the iPhone 7 Plus has a 5.5-inch Retina HD display with 3D touch. Both the smartphones are powered by a new quad-core Apple A10 Fusion processor, which the company claims is 40% faster that Apple A9 and it runs iOS 10.\n  \n\n\nRead this story in Telugu\n\n\n", "\n\n  NEW DELHI: Lenovo-owned Motorola is all set to launch its latest budget\n  smartphone\n  - Moto E3 Power, in India. The company has confirmed on its social channels that it will be launching the Moto E3 Power at an event scheduled for September 19. The smartphone will be available exclusively on Flipakrt.\n  \n\n  In terms of specifications, Motorola Moto E3 Power has a 5-inch HD display of 720x1280 pixel resolution. The handset runs\n  Android 6.0 Marshmallow\n  operating system and is powered by a 1GHz octa-core MediaTek processor.\n  \n\n  Moto E3 Power offers 2GB of RAM and 16GB of internal storage which can be expanded further via microSD cards. The handset has an 8MP rear camera with LED flash and a 5MP front camera for selfies. For connectivity, it offers 4G, LTE, 3G, Wi-Fi, Bluetooth and GPS. There's also a 3,500mAh battery with fast charging support included.\n  \n\n\n    READ ALSO\n    \nMoto G4 Play with 5-inch display, Android 6.0 Marshmallow launched at Rs 8,999\n\n\n\n  Recently, Motorola launched its\n  Moto G4\n  Play smartphone in India. Priced at Rs 8,999, the Moto G4 Play features a 5-inch HD display of 720x1280 pixel resolution. Running Android 6.0 Marshmallow, the smartphone is powered by a 1.4GHz quad-core Qualcomm Snapdragon 410 processor paired with a 2GB of RAM.\n  \n\n  Moto G4 Play has 16GB of internal storage which is expandable further up to 128GB through microSD cards. The dual-SIM device sports an 8MP rear camera with LED flash and a 5MP front-facing snapper for selfies. The\n  smartphone\n  is powered by a 2,800mAh battery with support for quick charging and includes 4G, LTE, 3G, Wi-Fi, Bluetooth, and GPS as connectivity options.\n  \n", "\n\n  NEW DELHI: Apple started rolling out the consumer version of the\n  iOS 10 on the iPhone and iPad\n  a few hours ago. However, as soon as the update was about to be installed users started complaining of the firmware freezing some handsets. Several users took to Twitter and Facebook to vent their ire since for a certain section downloading the update led them to factory reset their device, wiping all saved data.\n  \n\n  Several user reports and news websites mentioned that after the installation process the handset showed an error prompting users to plug it to iTunes on a PC. On connecting, another error cropped up which read, \"There is a problem with the iPhone 'iPhone' that requires it to be updated or restored.\"\n  \n\n  Although some had to factory reset the device, others just experienced a temporary bricking of the handset and were able to successfully install iOS 10 later.\n  \n\n\nThis is how iOS 10 promises to protect your wet iPhoneThe new beta releases of iOS 10 alerts users about moisture or liquid inside Lightning port.\n\n\n  Confirming the news, Apple said that the issue was witnessed only in the first hour of the rollout and has now been resolved.\n  \n\n  \"We experienced a brief issue with the software update process, affecting a small number of users during the first hour of availability,\" an Apple representative told Recode website. \"The problem was quickly resolved and we apologize to those customers. Anyone who was affected should connect to iTunes to complete the update or contact AppleCare for help.\"\n  \n\n  Those who faced the problem can scrap it completely and begin the update process afresh. The complete procedure can be followed on Apple's dedicated web\n  help page\n  .\n  \n\n  The\n  iOS 10\n  upgrade is available on iPhone 5, iPhone 5S, iPhone 5C, iPhone SE, iPhone 6, iPhone 6S, iPhone 6 Plus and iPhone 6S Plus. The OS will come pre-installed in Apple's latest iPhones -- iPhone 7 and iPhone 7 Plus.\n  \n", "\n\n  NEW DELHI: Apple has announced that it will be adding the ability to capture RAW images to iPhones, starting with iOS 10. While the stock iOS camera app doesn't have the functionality to capture RAW images,\n  iPhone\n  users can use\n  Adobe's Lightroom app\n  for the same.\n  \n\n  The only requirement for being able to shoot RAW images is that the iPhone should be running iOS 10 and have a 12MP iSight camera. This means that the supported devices are iPhone 6/6 Plus, iPhone 6s /6s Plus, iPhone 7/7 Plus, iPhone SE and even the iPad Pro 9.7.\n  \n\n  Images captured in RAW format are uncompressed and don't have any post-processing effects applied to them, unlike those captured using the stock camera app. As a result, users can tweak or enhance the images as they like to get the best out of them.\n  \n\n\nAdobe Lightroom app update brings RAW support to iOSAdobe Lightroom for iOS brings RAW support and more, while Android version gets a new Pro mode.\n\n\n  Adobe Lightroom captures RAW images in DNG format. It has also expanded its has also expanded the colour gamut to match the new displays and camera on the iPhone 7 and iPhone 7 Plus.\n  \n\n  Earlier this year, Adobe rolled out a major update for its Lightroom app for\n  mobile photography\n  on iOS and Android.\n  \n\n  For iOS users, the updated Adobe Lightroom v2.4 brings two major improvements. First is the ability to import images clicked in RAW format and edit them.\n  \n\n  On Android,\n  Adobe Lightroom\n  for Android v2.1 brings a new Pro mode in its built-in camera option under DNG RAW mode. As expected, the mode lets users take control of the White Balance, ISO and focus, all inside a new interface. There is also a new Lightroom Camera widget7 which directly fires up the Lightroom's built-in camera.\n  \n", "\n\n  NEW DELHI: Instant messaging platform\n  WhatsApp\n  today opposed in Delhi High Court a plea alleging that privacy of its users has been threatened by a new privacy policy announced by Facebook, saying regulations were in place and the latter does not have access to any data as it provides end-to-end\n  encryption\n  .\n  \n\nWhatsApp had made extensive changes to its privacy policy on August 25, the first time since it was acquired by Facebook, giving users the option of sharing their account information with the social network giant. The messaging service gave its users 30 days till September 25 to opt out of the policy.\n  \n\n  The submission was made before a bench of chief justice G Rohini and Justice Sangita Dhingra Sehgal, who were hearing a PIL against WhatsApp's recent decision to share user data with parent company Facebook.\n  \n\n  Senior advocate Siddharth Luthra, appearing for WhatsApp, said there are government regulations in place and the application does not share users private messages, contents, photos or data with Facebook.\n  \n\n  He said WhatsApp only shares a user's name and the phone number with\n  Facebook\n  . \"WhatsApp does not have access to any data as it provides end-to-end encryption\".\n  \n\n\n'WhatsApp sharing data with Facebook isn't surprising'Facebook has a long history of making policies and decisions that go directly against the idea of users’ online privacy. This includes everything from lawsuits accusing the social media giant of posting users’ data on its platform without their consent to the policy of having to use ‘real names’ on profiles.\n\n\n  \"We only have access to the person's name and number which is also obtained by online consent. We are abiding by the central government's regulations for messenger apps. We are not dealing with sensitive information at all,\" Luthra said, adding that \"if any of the user wants to opt out of the new policy, he/she cannot be forced to not choose that option\".\n  \n\n  To this, the court asked WhatsApp to file a short affidavit before September 20 explaining the factual position with regard to the concerns raised in the writ petition.\n  \n\n  However, senior advocate Pratibha M Singh, appearing for petitioners Karmanya Singh Sareen and Shreya Sethi, argued the messaging service was sharing the entire data with\n  Facebook\n  even if users opt out of the new policy.\n  \n\n  The petitioners, users of the popular instant messaging service, have alleged that WhatsApp, Facebook Inc and Facebook India Online Pvt Ltd's new private policy \"compromises the rights of its users\", which is also a \"very serious breach of policy\".\n  \n", "\n\n  Gadgets and technology help us in doing nearly everything better and staying fit is no exception. Whether you're a long-term fitness buff or just getting started on the path of getting into shape, a fitness tracker is one of the best gadgets one can get. These wrist-worn (generally) devices can not only track human body's vital signs like heart rate, but also log fitness-related data such as step count, calories burnt, sleep activity and more. This data can be then used to create personalized fitness goals and diet plans, thus leading to a healthier lifestyle.\n  \n\n  When it comes to fitness trackers,\n  Fitbit\n  is a name that needs no introduction. The company recently launched two new products - Charge 2 and Flex 2. Of these, the more expensive Charge 2 is an upgrade to the Fitbit Charge HR, which is now almost two years old.\n  \n\n  We tested the Fitbit Charge 2 for a few days, using it for tracking everything from sleeping patterns to daily walks. So, is the Fitbit Charge 2 and its promise of a healthier lifestyle any good, especially at an asking price of Rs 14,999? Let's find out.\n  \n\n\n\n\nDesign and build quality\n\n\n  Fitbit Charge 2 is essentially comprises two components - tracker module and wrist band. The wrist band is made from a flexible elastomer material and comes with a stainless-steel buckle for fastening the Charge 2 around the wrist. The outer side of the band is textured, while the underside is smooth. The\n  wrist band\n  is removable and can be swapped with one of the many designer bands, which have to be purchased separately. Since it's sweat proof, the wrist band doesn't irritate the skin even when the Charge 2 is worn on the wrist for an extended period of time.\n  \n\n  As for the tracker module itself, its frame is made from stainless steel. On the top rests a slightly curved black glass, under which hides a large (at least as compared to the Charge HR)\n  OLED\n  display. The left and right sides of the frame are chamfered and a navigation button lies on the left, the only button on the Fitbit Charge 2.\n  \n\n\n\n\n  Flip the Charge 2 and you see the optical heart rate tracker with two flashing LEDs (one each at the top and bottom of the tracking chip). There are also three charging contacts at the bottom, which work by making contact with the pins on the clip-on charger. Other important components include a 3-axis accelerometer, an altimeter and a vibration motor.\n  \n\n  Overall, we found the design and build quality of the Fitbit Charge 2 to be really good. While the tracker module is quite solid, the wrist band is flexible yet sturdy enough to withstand daily wear and tear.\n  \n\nREAD ALSO:\nREAD ALSO:\n    Fitbit Charge 2 and Flex 2 launched, price starts at Rs 9,499\n\n\n\nDisplay and navigation\n\n\n  Fitbit Charge 2 comes with a touch-capable OLED\n  screen\n  that automatically turns on when the wearer flicks the wrist, although this functionality can be disabled in the Fitbit app. The display can also be turned on with a double-tap or by pressing the navigation button on the side.\n  \n\n  Though the display shows time and date by default, users also have the option to choose from the various styles available. To change the display style, simply select it from the 'Clock Display' option in the Fitbit\n  app\n  and sync the tracker with the app. The display can be single-tapped repeatedly to flip through daily activity stats like calories burnt and floors climbed.\n  \n\n\n\n\n  As for the navigation, pressing the navigation button on the left repeatedly moves through various menu options (e.g. Heart Rate, Stopwatch). While a menu item is active, its related options can be cycled through by tapping the display. Lastly, long-pressing the side navigation button starts/stops the function associated with a menu item (e.g. Run).\n  \n\n  Interestingly, on-screen options can also be shuffled through by tapping anywhere on the wristband.\n  \n\nTracking performance and companion app\n\n\n  Fitbit Charge 2 works in tandem with the Fitbit app (available on all platforms). You also need to create a free Fitbit account (if you don't already have one) to login to the app. The account/profile creation includes entering essential body statistics like weight and height, as these are required for setting up personalized meal plans and weight goals.\n  \n\n  Once you login with your Fitbit account, it's generally easy to pair the Charge 2 with the smartphone over\n  Bluetooth\n  using the app. But sometimes, the tracker does take a bit of a trial-and-error to get paired up. After pairing, you can simply wear the Charge 2 on the wrist (it can be worn on either of the wrists) and it will start doing its thing. The tracker syncs with the smartphone over Bluetooth every time the app is launched. It can be manually synchronized as well. Also, the smartphone that Fitbit Charge 2 is paired with needs to be connected to a network so that logged data can be synchronized to your Fitbit\n  account\n  .\n  \n\n\n\n\n  The 'Dashboard' is the default landing section of the app. It displays a summarized list of all the metrics that are tracked by Fitbit Charge 2, including steps walked, calories burnt, floors climbed and sleep activity. Tapping on any logged parameter gives its logged values for the past days, with the last week's data arranged in the form of a bar graph.\n  \n\n  The primary daily goal is set to steps by default, but can be changed via the tracker\n  settings\n  in the app. All data logs reset automatically at the start of the next day (00:00 hrs).\n  \n\n  During our extensive testing spanning over the course of almost a week (which included wearing the device almost 24x7), we found the Fitbit Charge 2 to be really good at logging different parameters. It detects activities like sleeping automatically and heart rate tracking is reliably accurate. Moreover, step logging is almost real-time.\n  \n\nREAD ALSO:\nREAD ALSO:\n    Fitbit rolls out software update, launches Special Edition Gold series Alta and Blaze\n\n\n\n  Fitbit Charge 2 comes with 'guided breathing sessions' (2min or 5min in length) feature. It lets you practice relaxed breathing by guiding you through inhale and exhale actions. This is something we liked a lot.\n  \n\n  There's also multi-sport tracking built-in. It can track activity when you're lifting weights, running on the treadmill, cycling or even working out generally. All this data is then synced to the companion\n  app\n  . In our testing, multi-sport tracking worked as expected.\n  \n\n  One feature we'd like to talk about is 'move reminders'. To help you stay through the entire day, Fitbit Charge 2 vibrates on an hourly basis, encouraging you to take at least 250 steps (roughly equivalent to a few minutes of walking). Of course, the reminders can be customized from the tracker's settings in the app.\n  \n\n\n\n\n  Fitbit Charge 2's 'connected GPS' functionality uses the GPS in your smartphone (provided it's the same the tracker is paired with) to track your route, thus helping in getting real-time statistics like distance travelled. During our testing, the feature worked quite well. That said, how accurate it is depends on numerous factors such as the quality of\n  GPS\n  satellite lock-in and the connection between the smartphone and tracker.\n  \n\n  If any of your friends uses a Fitbit fitness tracker, you can compare your fitness stats and take part in challenges together. However, we weren't able to test this feature out.\n  \n\n  A really useful feature of the Fitbit Charge 2 is smartphone notifications. These include alerts about calls, text messages (SMS, WhatsApp and Hangouts) and calendar events. In our testing, notifications worked exceptionally well. Consequently, we had to check our smartphone less often. But even with that, we found the alerts functionality to be limited. Competing products like the\n  Garmin\n  vivosmart HR are much better in this regard, offering not only email and social media alerts, but also the ability to control music playback and some other devices.\n  \n\n  Coming to the\n  battery\n  life, we found it to be really good. Fitbit claims that the Charge 2 can last up to five days on a single charge and indeed, the battery lasted about four and a half days (even with 24x7 tracking) before needing to be recharged.\n  \n\n\n\n\nVerdict\n\n\n  The new Fitbit Charge 2 ticks nearly all the right boxes. It's comfortable for wearing all-day, supports real-time tracking of numerous activities and the notification alerts are all good. But there are a few negatives too, such as the often inconsistent\n  Bluetooth\n  syncing and the lack of music control functionality.\n  \n\n  At Rs 14,999, we'd say that Fitbit Charge 2 is a pretty solid and well-rounded fitness tracker and definitely recommended. For those looking at alternatives, the Garmin vivosmart HR is a great option.\n  \n\n", "\n\n  NEW DELHI: Telecom operator\n  Reliance Communications\n  today posted 5.8% rise in consolidated net profit to Rs 54 crore for the three-month period ended June 30.\n  \n\n  Anil Ambani-led RCom, which today agreed to merge its wireless telecom business with smaller rival Aircel to create the country's fourth-biggest mobile phone operator had posted a net profit of Rs 51 crore in the same period a year ago.\n  \n\n  The consolidated total income from operations declined by 4.7% to Rs 5,259 crore in the reported quarter from Rs 5,521 crore it posted in corresponding period a year ago.\n  \n\n  \"Results for quarter impacted by migration of CDMA customers to 4G LTE. RCom 4G LTE services now fully operational across India ,\" RCom said in a statement.\n  \n\n  The revenue of RCom from Indian operation stood at Rs 4,693 crore, down 2.5% from Rs 4,812 crore in the same period a year ago.\n  \n\n\nRCom, Aircel announce merger; create fourth largest telco in India​Reliance Communications and Aircel will hold 50% stake each in the new combined entity, which will be listed later. Both companies will also transfer debt of Rs 14,000 crore each. As for the net worth of the new company, it’ll be around Rs 35,000 crore.​\n\n\n  The global operations segment of the company registered revenue of Rs 1,185 crore, up by 5.3%, from Rs 1,125 crore in same period of 2015-16.\n  \n\n  The company said that its revenue per minute from phone calls increased by 1.6% on year-on-year (Y-o-Y) basis while total minutes of usage declined by 4.8% to 10,000 during the period under review.\n  \n\n  RCom said that its revenue per user increased by 5.7% to Rs 148.\n  \n\n  \"The total data customer base has grown 9.9% Y-o-Y to 38.9 million including 25.4 million 3G and 4G customers in first quarter,\" the statement said.\n  \n\n  The total data traffic at 102 billion MB is up 10.4% Y-o-Y, it added.\n  \n\n  The shares of RCom closed at Rs 51.05, up by 2.72% on BSE.\n  \n\n", "\n\n  NEW DELHI: Apple recently launched its\n  iOS 10\n  operating system for all users having supported iPhone and iPad devices. And despite facing some initial glitches, iOS 10's early adoption rate has been recorded to be higher than that of iOS 9 in the same time frame.\n  \n\n  As recorded by the Mixpanel website, iOS 10 reached 14.45% of eligible devices in the first 24 hours of its release. In comparison, iOS 9 was on 12.60% of eligible device within 24 hours of it being released for all users.\n  \n\n  It is too early to guess when iOS 10 will be on about 50% of all eligible devices. As per the website, iOS 8 reached 50% adoption rate in a month, while iOS 9 hit the same spot within 12 days. We believe that the adoption rate for iOS 10 would've been even faster, had it not encountered the installation-related bugs early during rollout.\n  \n\n\n\n  For those unaware, iOS 10 was reported to have caused iPhones and iPads to freeze after they were updated with the latest OS, within hours of its public release. Several users took to Twitter and Facebook to vent their ire as\n  downloading the update\n  led them to factory reset their devices, wiping all saved data on devices. It was reported that during installation process, the handset showed an error prompting users to plug the device(s) to PC and use iTunes. On connecting, another error cropped up which read, \"There is a problem with the iPhone 'iPhone' that requires it to be updated or restored.\"\n  \n\n  However, Apple quickly addressed the issue. \"The problem was quickly resolved and we apologize to those customers. Anyone who was affected should connect to iTunes to complete the update or contact AppleCare for help,\" it said to Recode website.\n  \n", "\n\n  NEW DELHI: Google has released its monthly\n  Android\n  distribution statistics for September 2016. According to the company, Android Marshmallow 6.0 is slowly expanding to more number of handsets and sits at an 18.7% now. Android Nougat 7.0 is yet to make it to the chart.\n  \n\n  Although a significant increase, Android Marshmallow still lies below Android Lollipop, and Kitkat on the list. As per the latest distribution numbers, Android Lollipop 5.0 and v5.1 together run on 35% Android devices, followed by Android Kitkat 4.4 with a 27.7% share.\n  \n\n\nGoogle starts rolling out Android N update to Android One devicesGoogle has started rolling out the latest version of its mobile operating system, Android 7.0 Nougat, to Android One devices. The move comes some two weeks after the company started rolling Android 7.0 Nougat update to Nexus devices.\n\n\n  Android Jelly Bean on the other hand, powers 15.6% devices, while Android Ice Cream Sandwich, Gingerbread, and Froyo are placed at 1.4%, 1.5% and 0.1% respectively. These numbers were gathered by Google from Android devices accessing Google Play Store within a seven-day period till September 5.\n  \n\n\n\n  A few days ago, Google started rolling out\n  Android 7.0 Nougat\n  to Android One devices. The version was rolled out through the OTA channel. Cherry Mobile G1 was the first Android One smartphone to have received the update.\n  \n\n  The Android 7.0 Nougat update for Nexus 6P was on hold for sometime following reports of it draining the handset's battery faster than expected. The issue, however, was attributed to a glitch at Huawei's end. Google recently released factory and OTA images for the Nexus 6P and has resumed rolling the update out.\n  \n\n", "\n\n  NEW DELHI: It's a big day for Apple users. The company is not only rolling out the latest version of its\n  mobile operating system iOS 10\n  , but also a brand new OS for Apple Watch and Apple TV, called watchOS 3 and tvOS 10 respectively. While the watchOS brings improvements in Siri, redesigned UI, new watch face and more, the tvOS 10 brings better YouTube and Siri search, dark mode, easy sign-in process among others.\n  \n\n  To download watchOS 3, users are recommended to install the latest iOS version and keep the Apple Watch's minimum charge of up to 50%. They can also keep the watch on the charger till the update is complete. In addition, users can connect the iPhone to Wi-Fi network and keep it in range with the smartwatch.\n  \n\n  Users would have to then open the Apple Watch app on the iPhone, tap on My Watch tab>General>Software update. Download the update and follow the rest of the process as prompted. More details can be found on the company's\n  dedicated page\n  .\n  \n\n\nApple iOS 10 download: Update marred by glitchesSeveral user reports and news websites mentioned that after the installation process the handset showed an error prompting users to plug it to iTunes on a PC. On connecting, another error cropped up which read, “There is a problem with the iPhone 'iPhone' that requires it to be updated or restored.”\n\n\n  To download tvOS 10, users need to go Settings > System > Software Updates > Update Software on their Apple TV (4th Generation). They can then download and install the OS version by following the process. On Apple TV (2nd and 3rd Gen) users can go to Settings > General > Update Software to download the new OS version. More details can be found on the company's\n  dedicated page\n  .\n  \n\n  With watchOS 3, the apps\n  will now respond instantly\n  with lesser loading times. The OS enhancements help it load the apps seven times faster as compared to the current watchOS 2.\n  \n\n  The new version also adds quick respond options for messages with smart replies. One of the highlights of the watchOS 3 is Scribble. Using the feature, Apple Watch users can now scribble on the display to type a message.\n  \n\n\n\n  A new Minnie Mouse watch face is now also available along with a new Activity Watch Face, which itself is available in analogue, chronograph and digital versions. The platform also has a deeper integration with other services. Apple has also introduced a new emergency feature in watchOS 3 - SOS. Users can long press the side button below the crown to automatically initiate a call to 911 emergency dispatch. It also shows emergency contacts set by users on the Apple Watch display. SOS feature also works internationally. Certain changes in the health and fitness departments are also included.\n  \n\n\nWhatsApp adds Siri integration and more with latest iOS 10 updateWhatsApp is rolling out an update for its iOS app. The update introduces several new features, including those supported on the newest iOS 10 release. It also brings improved app sharing and Siri integration with third party apps on iOS 10.\n\n\n  tvOS now has new apps like Sling, Fox Sports, Molotov and more. NBA 2K, Minecraft story mode and other games will also be available. Users can take Siri's help to issue commands. The app can also use accelerometer and gyroscope of iPhone to act as gaming controller, along with having other functionalities of a TV remote. Siri can now search movies by topics through voice commands. Live channels are also available.\n  \n\n  Apple has also made it simpler to sign-in to multiple devices with a new Single sign in feature. Users would just have to sign in once to access all the apps on their devices. Besides, a new Dark mode has been unveiled as well. Users will be able to download any app on iPhone and see it appear on Apple TV (if compatible with the same) automatically. tvOS developer preview is already out and end-customers will be receiving it later this year.\n  \n", "\n\n  SAN FRANCISCO: Initial quantities of the\n  iPhone 7 Plus\n  have sold out globally as Apple Inc prepares to roll out its new gadget in stores, the company said.\n  \n\n  Supplies of the larger size of Apple's new phone have been exhausted in all shades, and the smaller iPhone 7 has also sold out in the new jet black color, the company said.\n  \n\n  Customers who enter\n  Apple\n  Stores Friday, when the gadgets hit shelves, will not be able to purchase the sold-out phones on site, but they can continue to place orders for their desired models online, Apple said.\n  \n\n  \"We sincerely appreciate our customers' patience as we work hard to get the new iPhone into the hands of everyone who wants one as quickly as possible,\" Apple spokeswoman Trudy Muller said in a statement.\n  \n\n  Apple launched the new phones at a San Francisco event earlier this month. The gadgets feature improved\n  cameras\n  and eliminate the traditional headphone jack in favor of new technology.\n  \n\n\nApple slashes prices of iPhone 6s and iPhone 6s Plus by up to Rs 22,000Apple has announced biggest-ever price drop for its smartphones in India. Under the new pricing, iPhone 6S (128GB), carying an MRP of Rs 82,000, will now be available at an MRP of Rs 60,000. iPhone 6s Plus (128GB) will now be available at an MRP of Rs 70,000,  the smartphone too has received a price cut of Rs 22,000. Apple's 4-inch smartphone iPhone SE, too has got a price cut. The 64GB version of iPhone SE will now be available at Rs 44,000.\n\n\n  Breaking with tradition, the company will not release first-weekend sales of the iPhone 7 and 7 Plus, saying the figure is more a reflection of supply than demand.\n  \n\n  The decision sparked concerns among some on Wall Street, where many fear sales of the iPhone, a critical product for Apple, may be leveling off. But US wireless carriers Sprint Corp and\n  T-Mobile\n  US Inc said on Tuesday they received strong pre-orders for the iPhone 7, sending Apple shares up.\n  \n\n  \"Based on everything I've seen it looks like demand is very strong,\" analyst Jan Dawson of Jackdaw Research wrote in an email.\n  \n\n  The 5.5-inch iPhone model, known as the Plus, has sold out soon after launch since Apple introduced the size with the\n  iPhone 6\n  in 2014. Phones in newly released finishes are also typically snapped up quickly by customers eager to showcase the latest iPhone design.\n  \n", "\n\n  NEW DELHI: Videocon Mobiles has launched its latest 4G smartphone, Cube 3 (V50JL) in India. Priced at Rs 8,490, the smartphone will available across all retail stores.\n  Videocon\n  has also partnered with\n  Reliance for the Jio Welcome Offer\n  that enable customers to get a free Jio sim with free data, voice calls, SMS and a host of Jio apps till December 31, 2016.\n  \n\n  The Cube 3 (V50JL) comes pre-loaded with SOS-Be Safe emergency response app that has Alert, Walk with me and Reach on time features. The power button of the smartphone doubles up as an\n  SOS button\n  and can be customized to send alerts with GPS location to a user's friends. Walk with me sends the location of a user at regular intervals to emergency contacts. Lastly, Reach on time sends an alert if a user hasn't reached a particular destination at the designated time.\n  \n\n\nVideocon Krypton 3 V50JG review: An average joeWe tested the budget Videocon Krypton 3 V50JG for a few days and this is what we have to say about it in our review.\n\n\n  In terms of specifications,\n  Videocon\n  Cube 3 (V50JL) features a 5-inch HD display of 720x1280 pixel resolution protected with Dragontrail glass on top. It runs Android 6.0 Marshmallow operating system and is powered by a 1.3GHz quad-core MediaTek processor.\n  \n\nVideocon\n  Cube 3 (V50JL) offers 3GB of RAM and 16GB internal storage, which can be further expanded by installing microSD cards. The dual-sim smartphone sports a 13MP rear camera with dual-tone LED flash and a 5MP front camera for selfies.\n  \n\n  Having a 3,000mAh battery, the smartphone offers 4G, LTE, 3G, Wi-Fi, Bluetooth and GPS as major connectivity options.\n  \n"]