{
    "articles": [
    	{
            "content": "MUMBAI: Sensex registered a good beginning on Tuesday as it recouped over 127 points after yesterday's loss, with Asia providing a positive backdrop amid sustained foreign inflows.\nThe 30-share index was trading higher by 127.47 points, or 0.43 per cent, at 29,364.62, with all indices led by technology, IT, power and healthcare trading in the green with gains up to 0.79 per cent.\nThe gauge had lost 184.25 points in the previous session.\nThe NSE Nifty rose by 46.35 points, or 0.51 per cent, to 9,091.55.\nRetail investors got back to buying and foreign money kept coming in amid a firming Asian trend on renewed optimism for tax reforms in the US.\nMajor players that supported the recovery were Axis Bank, Sun Pharma, Tata Motors, Wipro, HDFC Ltd, Asian Paints, NTPC and ICICI Bank, gaining by up to 1.96 per cent.\nHong Kong's Hang Seng was up by 0.50 per cent while Japan's Nikkei rose 1.07 per cent in early trade today.\nShanghai Composite, however, shed 0.23 per cent.\n",
            "title": "Sensex back on rails, up 127 points",
            "source_url": "http://timesofindia.indiatimes.com/business/india-business/sensex-back-on-rails-up-127-points/articleshow/57867030.cms",
            "author": "PTI",
            "published": "28/03/2017",
            "newspaper": "timesofindia"
        },
        {
        	"content": "MUMBAI: London-headquartered Vodafone and Kumar Birla-controlled IdeaCellular on Monday announced India Inc's biggest-ever merger to create the country's undisputed leader in the world's second largest telecom market after China.\nThe combined 394-million subscriber base of India's second and third largest telcos will eclipse Bharti Airtel's 270 million - and catapult the merged company to No 2 spot globally.\nIt could also alter the landscape of an industry that's facing cut-throat competition from Mukesh Ambani's recently-launched Reliance Jio.\nTOI was the first to write, in its edition of January 28, that Vodafone and Idea were in advanced discussions for a merger (there had been some speculation last year, also reported by TOI, but nothing had come of it at the time).\nThe mega-merger will create a company that will be No.\n1 or a strong No. 2 in all telecom circles except Jammu & Kashmir.\nVoda's 204 million subscribers and Idea's 190 million (at the end of 2016) will give them a combined market share of 35%.\nAggregate revenues of over Rs 80,000 crore represent 42% of the national pie.\nVodafone's global CEO Vittorio Colao told TOI in a joint interview with Birla that the consolidation was driven primarily by the \"arrival of data, which is very capital heavy and consumes a lot of spectrum\" - along with reasons like synergy and cost savings.\nAlthough Vodafone will hold 45% and Idea Cellular 26% stake in the post-merger company, which is being valued at $23 billion, they will have equal voting rights (again, TOI had reported on Jan 28 that Idea was pressing for it).\nThe combine - the name and brand identity of which will be decided in due course - will be jointly managed with three representatives each on a 12-member board.\nBirla will take over as chairman of the new entity upon the completion of the deal in 2018.\nWhile the two sides will together decide on the CEO, Idea's Himanshu Kapania is expected to steer the combined operations; the choice of chief financial officer will be Vodafone's.\nThe transaction gives Idea the option to buy 9.5% stake in the new company over the next four years at Rs 130 per share.\nIf Birla chooses not to exercise the option, Vodafone will sell down shares to equalize its shareholding with Idea.\nOn January 30, two days after the TOI report, Vodafone and Idea had confirmed they were in talks.\nOn Monday, they maintained that the merger would not breach subscriber and spectrum threshold limits in a big way (only in five circles, according to telecom analysts) as reported by this newspaper on January 28.\nPerhaps in a bid to bring about near-parity between the two, the merger excludes the Vodafone's 42% interest in Indus Towers while valuing the British telecom giant unlisted Indian subsidiary at $12.4 billion (Rs 82,000 crore), but includes Mumbai-listed Idea's 11% stake in Indus in its $10.8 billion (72,000 crore) valuation.\nAnalysts viewed the deal making as a strategic retreat for Vodafone from a lossmaking market where it has written off $9 billion till date.\n Jio's freebies have pushed incumbents into a corner with Bharti Airtel, Vodafone and Idea posting quarterly losses.\nIn 2007, Vodafone stepped into Indian market when it paid Hutchison Whampoa $11 billion for controlling stake, and later coughed up another $5.5 billion to buy out the 33% held by the Ruias of Essar.\nVodafone has since invested billions in multiple rounds of spectrum auctions even as competition ate into pricing power in what was once hailed as one of the world's most promising telecom markets.\nLosses from the Indian business have weighed down Vodafone's global results in the recent past and prompted its CEO to consider 'de-consolidation'.\nThe merger will also strengthen Birla's hand in a bruising war, providing him a leadership platform and a bigger balance sheet to take on rivals, including Jio.\nIdea shares have been beaten down - until the merger speculation gained credence - as it was considered to be the weakest among the top three to face the Jio onslaught.\nIdea shares gyrated wildly rising 15% in morning trade but subsequently declined 10% indicating investor apathy with the deal construct.\nBoth Vodafone and Idea played down the market volatility stating it would take markets \"a while to digest details of a complex transaction\".\n\"For Idea shareholders and lenders who have supported us thus far, this transaction is highly accretive, and Idea and Vodafone will together create a very valuable company given our complementary strengths,\" Birla said.\n\"The combined company will have the scale required to ensure sustainable consumer choice in a competitive market and to expand new technologies that have the potential to transform daily life,\" Colao added.\n",
        	"title": "Voda, Idea to create telecom giant in biggest-ever merger",
        	"source_url": "http://timesofindia.indiatimes.com/business/india-business/voda-idea-to-create-telecom-giant-in-biggest-ever-merger/articleshow/57742708.cms",
        	"author": "Boby Kurian & Partha Sinha",
        	"published": "21/03/2017",
        	"newspaper": "timesofindia"
        },
        {
        	"content": "BRIDE'S PRIDE AND PREJUDICES STORY : Badrinath is looking for a typical bride; Vaidehi is looking for an independent life.\nTogether they must break with tradition and redefine their role\n\nREVIEW : Badrinath Ki Dulhania is a rucksack full of radioactive social issues handled cautiously with bedazzled Dharma gloves.\nBut 'handled' is the operative word here.\nSet in small towns like Jhansi and Kota where patriarchy is as evident as daylight, the movie focuses on Badrinath (Varun Dhawan), a sahukar's son in pursuit of a bride.\nHe spots Vaidehi (Alia Bhatt) at a wedding and starts wooing her.\nBut Vaidehi refuses to bow down to social pressure and succumb to a marriage nurtured by an IV drip of dowry.\nTurns out she's that mutant small-town girl with actual opinions and ambitions and most importantly, a spine.\nAnd her character is the backbone of this story, too.\nShe's fierce and real; she's pushed down but gets back up; she protects her dreams and for once, doesn't get emotionally manipulated.\nHer father's heart condition be damned!\n\nThrough Vaidehi, the movie checks all the important boxes: gender issues, feminism, consent, etc.\nBut the story is treated so stylistically (with elaborate song sequences and flashbacks and cinematic moments) that it loses heat.\nAt times, characters speak like public service announcements, and seem a little contrived.\nThe runtime doesn't help either.\nThis is a story with an obvious climax, so sitting through two and a half hours to find out what you already know might get uncomfortable.\nBut the breezy vibe of the movie and back-to-back hilarious lines should get you through it.\nTogether, Varun Dhawan and Alia Bhatt are the best thing that could have happened to our screens.\nThe beautiful effortlessness of their onscreen companionship plasters a grin on your face.\nDhawan as Badri is adorable; you instantly take to him.\nHe even pulls off some high-drama scenes impressively.\nBhatt, unsurprisingly, gives it her all, and her sincerity comes through.\nBut her accent, casually swinging between Juhu and Jhansi, is bothersome at times.\nRSVP Yes to this wedding; it's grand, with good music, great people and delicious food for thought.\n",
        	"title": "Badrinath Ki Dulhania Movie Review",
        	"source_url": "http://timesofindia.indiatimes.com/entertainment/hindi/movie-reviews/badrinath-ki-dulhania/movie-review/57571715.cms",
        	"author": "TNN",
        	"published": "17/03/2017",
        	"newspaper": "timesofindia"
        },
        {
        	"content":"OF LOVING, LOSING AND LEARNING STORY: Ayan falls in love with his soulmate, Alizeh, but she doesn't reciprocate the feeling.\nLater, a relationship with Saba helps him realize Alizeh's value in his life, irrespective of their relationship status.\nREVIEW: There's a lot of good news, and only a little bad news, so let's start with the former.\nWith Ae Dil Hai Mushkil, Karan Johar has let go of the \"candy\" but retained the \"floss\", resulting in a beautiful-looking film that isn't bereft of logic.\nAyan (Ranbir) and Alizeh (Anushka) strike up a friendship after meeting at a bar.\nThey're Bollywood-crazy goofballs who sing cheesy '80s songs, poke fun at each other's partners and fit into each other like pieces of a jigsaw puzzle.\nBut Ayan wants more from the relationship.\nAlizeh on the other hand is still reeling from her break-up with Ali (Fawad) and a chance encounter makes her slip back into his arms, leaving Ayan distraught.\nAyan then finds solace in a (mostly physical) relationship with Saba (Aishwarya), who helps him get a new perspective on one-sided love.\nThis is Karan Johar's most grown-up movie yet.\nHe has come a long way from \"Pyaar dosti hai,\"\" (Kuch Kuch Hota Hai) to \"Pyaar mein junoon hai, par dosti mein sukoon hai\" (ADHM).\nIn the first half, there's a getting-to-know-each-other arc which reminds you of Before Sunrise; there's also a slight Imtiaz Ali flavour lingering through the movie (strong female characters help a broken boy find himself).\nThere's no celebration of heartbreak; there's no pausing-for-laughs, there are no convenient coincidences.\nThe laughter comes from genuine chemistry between the leads.\nThe sadness comes from real consequences of heartbreak that Johar has always shied away from, but not this time.\nKaran, the writer, overpowers Karan, the director here.\nAnushka Sharma plays the most well-rounded character with abandon; she's remarkable.\nRanbir's portrayal of the clumsy, turned-down one-sided lover is heartbreaking; his honesty comes through yet again.\nSeeing Aishwarya in the role of a confident seductress is a welcome change.\nOn the downside, there's a bizarre twist in the last 15 minutes that could have been replaced with a scene or two of good conversation, but if you have an appetite for melodrama, you might just like it.\nThat said, you usually come away from a Karan Johar movie dreaming of singing sweet tunes in the Alps; but ADHM makes you realize just how cold it is, up there.\nGo watch it for a relatable portrayal of modern-day relationships.\n",
        	"title": "Ae Dil Hai Mushkil Movie Review",
        	"source_url": "http://timesofindia.indiatimes.com/entertainment/hindi/movie-reviews/ae-dil-hai-mushkil/movie-review/55112044.cms",
        	"author": "Nihit Bhave",
        	"published": "28/10/2016",
        	"newspaper": "timesofindia"
        },
        {
        	"content": "Meet the man behind the most expensive haircut in the world!\nRossano Ferretti is known as the most exclusive and expensive hair dresser in the world.\n He is famously known for the method haircut technique, which is also known as the invisible haircut.\nThis haircut allows the hair to fall with natural movement; the cut is not about layers and chop.\nIt follows the natural flow of hair, offering a bespoke experience for everyone.\nHe has more than 20 salons in the world with rumoured clients like Kate Middleton, Lady Gaga, and Jennifer Lawrence to name a few.\nRecently, he was in India to launch the Rossano Ferreti Hair Spa at Zehen at The Manor in New Delhi, where we chatted about his salon in India and the famous haircut.\nTell us about the famous 'invisible haircut'I was 15-years-old when I felt that I was not happy about the techniques used for haircuts in salons over the world.\nI decided to travel and learn more about this.\nAnd that's when I realised that women all over the world were completely unhappy with their experience.\nThey never had an experience of anything different and new at the salonsSo, I came up with the method which is also called the invisible haircut.\nIt was about understanding hair's natural force and customising per the girl.\nIs this haircut available in the Indian salons as well?Yes, it is available in India and at all my salons.\nWe have our stylists who come from learning schools across the world.\nIt's not about India, this is everywhere! I will never open a salon without my team?because they care about the local clients and quality control.\nAnd of course, I need local stylists as well, so we train them first and teach them.\nAnd we've heard that it's the most expensive haircut in the world, is that true?\nRight now, my hair dressers have the regular market price and as I have been the benchmark in the industry for the method, we keep the prices competitive.\nAnd the $1500 cost was years ago, when I was in the market.\nNow, I only do it for a few friends, but you don't want to know the cost for that!\nWhat's the current price of the 'invisible haircut' in India?\nThe Indian cost is Rs 6,500, which includes wash, blow-dry - it's a complete package! It's very much available here and it's not at a crazy price.\nWe've heard about your famous Hollywood clients.\nAnd, we're just curious if there's any Bollywood client as well?\nWell, I don't speak about my clients and friends.\nBut of course, I have Bollywood clients and many in the world.\nBut, I never speak about them.\nI believe that every client is a celebrity to me.\nIt's not about one celebrity or a name that will change your experience at my salon.\nEvery client will be treated in the same way and this is every important to me!\n",
        	"title": "Meet the man behind the most expensive haircut in the world!\n",
        	"source_url": "http://timesofindia.indiatimes.com/life-style/beauty/meet-the-man-behind-the-most-expensive-haircut-in-the-world/articleshow/57794654.cms",
        	"author": "TNN",
        	"published": "23/03/2107",
        	"newspaper": "timesofindia"
        },
        {
        	"content": "Many schools in India start accepting kids who are as young as 2.5 years but that age bracket is no indication of your child being ready for school.\nA lot of parents in India mull over this topic time and again - the right age to start schooling. It is because there are a lot of researches that suggest children should not start schooling very early. Now, a recent research reiterates the theory.\nA recent study conducted by Stanford University has established that parents who waited to enroll their kids in kindergarten by age 6 (and not 5) had better performing kids. The kids had better test scores and better self-control by the time they reached 7 and 11 years.\nPsychologists see self-control as an executive function. They feel it is in the initial years when kids start to possess this quality.\nKids with a strong level of executive function are able to manage their time better and focus even with distractions.\nAccording to a Business Insider article, in the latest study , investigators Thomas Dee and Hans Henrik Sievertsen used the Danish National Birth Cohort (DNBC) study to collect their data.\nThe DNBC included responses from 54,241 parents on measures of mental health when their children were 7 years old and 35,902 responses when the kids were 11.\n",
        	"title": "Your child should not start school before this age\n",
        	"source_url": "http://timesofindia.indiatimes.com/life-style/relationships/parenting/your-child-should-not-start-school-before-this-age/articleshow/57768072.cms",
        	"author": "TNN",
        	"published": "27/03/2017",
        	"newspaper": "timesofindia"
        },
        {
        	"content": "NEW DELHI: In-form India opener Lokesh Rahul hit an unbeaten half-century as India crushed Australia by eight wickets to win the Border-Gavaskar Trophy on the fourth day of the fourth Test at the HPCA Stadium in Dharamsala on Tuesday. India thus won the four-Test series 2-1 to end the home season on an emphatic note.\n\nAs expected, Australia came out all guns blazing and ensured that India didn't have it easy. Murali Vijay (8) endured a tough time before Pat Cummins ended his misery by having him caught behind with a good outswinger with India still 60 runs short of victory.\n\nIndia's highest run scorer in this series, Cheteshwar Pujara, was then run out for a duck with a direct hit from Glenn Maxwell to briefly lift Australia's spirits, but Rahul and Ajinkya Rahane then made sure India didn't have any more hiccups. Rahul scored a solid half-century, his sixth of the series, but it was the whirlwind 38-run knock from the stand-in Indian captain that nailed the series.\n\n\nCummins moved around the stumps in an attempt to intimidate Rahane at the start the 20th over and banged his first ball in, but an undeterred Rahane pulled it nonchalantly over midwicket for a stunning six. The next ball was pitched short and wide outside off stump, and anticipating it brilliantly Rahane gave himself room and smashed it over the covers for a six. A gutsy statement was made.\n\nThe winning runs came when Rahul moved from 49 to 52 with a whip past midwicket, and both batsmen celebrated the victory animatedly.This victory rounded off India's home season of 13 Tests on a resounding note, and is their fourth in row over Australia at home after 2008/09 (2-0), 2010/11 (2-0) and 2012/13 (4-0).\nBrief scores: India 332 & 106/2 (Rahul 51*, Rahane 38*: Cummins 1/42) beat Australia (300 & 137) by 8 wickets to win series 2-1\n\n\n\n\n",
        	"title": "India v Australia: India reclaim Border-Gavaskar Trophy with 2-1 series victory",
        	"source_url": "http://timesofindia.indiatimes.com/sports/cricket/australia-in-india/india-v-australia-india-reclaim-border-gavaskar-trophy-with-2-1-series-victory/articleshow/57867894.cms",
        	"author": "Manish Kumar",
        	"published": "28/03/2017",
        	"newspaper": "timesofindia"
        },
        {
        	"content":"NEW DELHI: Australia captain Steve Smith has apologised for losing control during the course of the four-Test series against India.\nOn Tuesday, India beat Australia by eight wickets in the fourth and final Test in Dharamsala to win the series 2-1.\nSpeaking at the post-match presentation, Steve Smith said, \"It's been pretty intense throughout the series.\nAt times, I have lost control over my emotions.\nI apologise for that.\"\n\nOn Monday, video clips showed Smith using cuss words against Murali Vijay after the Indian fielder had claimed a catch and started rushing towards the dressing room to put his pads on.\nReplays showed the catch wasn't cleanly taken and following that video emerged of Smith apparently calling Vijay \"f*****g cheat.\"\nSmith had brilliant series, scoring 499 runs, the most by any batsmen from either side and hit three centuries to top the batting charts.\nThe 27-year-old said that this was one of the best series of his playing career.\n\" (This is) Probably one of best Test series I've been part of.\nThe way we adapted & challenged Indian in these conditions was really fantastic,\" he said.\nThe hotly contested series gave rise to several controversies and reached to a level that forced the cricket boards of the two teams brokering a pre-match meeting between Smith and India captain Virat Kohli to ensure peaceful proceedings ahead of the third Test in Ranchi.\nBut, it did not seem to have much effect as the intense rivalry and mind-games continued resulting in more controversial moments including one where Glenn Maxwell could be seen mocking Kohli's shoulder injury and in turn the Indian accusing the Australians of showing disrespect to India physio Patrick Farhat.\nSmith praised India and particularly their bowlers for stepping up on Day 3.\n\"Credit to India, they bowled particularly well yesterday.\nUmesh Yadav has bowled brilliantly all series,\" he said.\n",
        	"title": "Steve Smith apologises for losing control over emotions",
        	"source_url": "http://timesofindia.indiatimes.com/sports/cricket/australia-in-india/steve-smith-apologises-for-losing-control-over-emotions/articleshow/57868835.cms",
        	"author": "timesofindia",
        	"published": "28/03/2107",
        	"newspaper": "timesofindia"
        },
        
        {
        	"content": "There is still a day remaining beforeSamsung makes its upcoming flagship(s) -Galaxy S8 (and Galaxy S8+ ) official.\nHowever, someone is already selling the yet-to-be-launched smartphone on eBay.\nHaving a hefty price tag of Rs 89,999, the eBay listing states that the \"Item will be imported from abroad, so you will have to wait for 50-55 days.\nPlease do not buy if you cannot wait.\"\nNeedless to say, the above mentioned price is not the official price of the Galaxy S8.\nAlthough the listing says that the items imported will be \"original\", a cloud of uncertainty still looms.\nMaking the whole offer even more doubtful, the listing details further mention that the box \"will be opened to check contents before shipping.\"\nThe listing mentions specifications as captured from GSMArena website, which are again, based on speculations and rumours.\nWe are just a couple of days away from the official launch of Samsung's flagship smartphones - Galaxy S8 and Galaxy S8+.\nBut considering the countless number of leaks and rumours that have popped up online in the past few months, it doesn't look like the company will showcase anything about the two handsets that we don't already know.\nThe South Korean tech giant has recently revealed the refreshed version of its signature 'Over the Horizon' six-note ringtone, that will be debuting with the Galaxy S8 and Galaxy S8+.\nThe company has teamed up with Grammy-winning artist Jacob Collier for the new version of the ringtone.\n\"Jacob arranged and recorded his version of Samsung's brand song himself, employing a total of 16 different instruments that are harmonized in the video by a veritable ensemble.\n\", reads a post on Samsung Newsroom website.\nIt has been also mentioned that \"Samsung's latest take on 'Over the Horizon' will make its debut with the release of the new Galaxy smartphone.\n",
        	"title": "Samsung Galaxy S8 gets listed online with price, official ringtone announced",
        	"source_url": "http://www.gadgetsnow.com/tech-news/samsung-galaxy-s8-gets-listed-online-with-price-official-ringtone-announced/articleshow/57863755.cms",
        	"author": "Robin Sinha",
        	"published": "28/03/2017",
        	"newspaper": "timesofindia"
        },
        {
        	"content": "BENGALURU: Newly-launched Xiaomi Redmi 4A went out of stock in just four minutes during a flash sale organised on Amazon.in on launch day today.\n\"We had over 1 million 'notify me' requests from customers.\nSmartphones have been a top selling category on Amazon.in and the phenomenal sale today reinforces our focus on expanding the selection and giving our customers the best to choose from,\" said Noor Patel, director of category management at Amazon India.\nSmartphone is the top-selling category in Amazon and i n 2016 the smartphone business for the platform more than doubled in terms of units according to a statement shared by Amazon India.\nRival Flipkart claimed a 65 per cent marketshare in the sale of smartphone category for the period of January-February 2017 in an interview given to ET earlier.\nThe exclusive tie-ups with smartphones device makers drives a large part of revenues for online platforms, which typically assist these companies in distribution and marketing.\n",
        	"title": "Redmi 4A sells over 2.5 lakh units in four minutes: Xiaomi",
        	"source_url": "http://timesofindia.indiatimes.com/companies/redmi-4a-sells-over-2-5-lakh-units-in-four-minutes-xiaomi/articleshow/57810625.cms",
        	"author": "Payal Ganguly",
        	"published": "24/03/2017",
        	"newspaper": "timesofindia"
        }

     
        ]
}            